{"anchor": "Blankets may be spread on the ground for a picnic or where people want to sit in a grassy or muddy area without soiling their clothing.", "positive": "Blankets may be carefully spread on the ground for a relaxing picnic or in locations where people want to sit in a grassy or muddy area without accidentally soiling their clothing.", "hard_negative": "Blankets may be spread on the ground for a picnic or where people want to sit without soiling their clothing."}
{"anchor": "As with all other cricket statistics, batting statistics and records are given much attention and provide a measure of a player's effectiveness.", "positive": "As with other cricket statistics, batting records are given attention and provide a measure of a player's effectiveness.", "hard_negative": "As with most other cricket statistics, batting statistics and records are given significant attention and provide a strong measure of a player's effectiveness."}
{"anchor": "Both at the server and the user level, Discord allows users to connect these to their Twitch.tv or other gaming service account.", "positive": "At the server and user level, Discord allows users to connect these to their Twitch.tv or other gaming account.", "hard_negative": "At both the server and user level, Discord permits users to link these to their Twitch.tv or alternative gaming platform account."}
{"anchor": "Built between 2003 and 2006 out of formerly barren lands, it covers 40 hectares.", "positive": "Built between 2003 and 2006 out of mostly barren lands, it covers 40 hectares.", "hard_negative": "Built between 2003 and 2006 out of previously barren agricultural lands, it currently covers 40 hectares."}
{"anchor": "Standing ovations are also often given in a sporting game to reflect an outstanding individual performance.", "positive": "Standing ovations are also often spontaneously given in a competitive sporting game to reflect an outstanding individual performance.", "hard_negative": "Standing ovations are often given in a sporting game to reflect an individual performance."}
{"anchor": "More women being shunned from higher executive positions are protesting on social media.", "positive": "More women shunned from executive positions are protesting on social media.", "hard_negative": "Women being shunned from higher executive positions are protesting more on social media."}
{"anchor": "As a profession, medical illustration has a more recent history.", "positive": "Medical illustration, as a profession, has a more recent history.", "hard_negative": "In many regions, medical illustration as a profession has a more recent history."}
{"anchor": "From 2014 the museum faced budget cuts that dropped its maintenance to less than R $ 520,000 annually.", "positive": "The museum faced budget cuts from 2014 that dropped its maintenance to less than R $ 520,000 annually.", "hard_negative": "Starting in 2014, the museum experienced financial reductions that reduced its upkeep budget to below R $520,000 per year."}
{"anchor": "With the start of the Soest district in 1817 its influence slowly rose.", "positive": "In 1817, with Soest's start, its influence rose.", "hard_negative": "The creation of the Soest district in 1817 marked the beginning of its rising influence."}
{"anchor": "The throwback uniforms would have an impact on future seasons in the NHL, as several teams adopted throwbacks as alternate jerseys.", "positive": "The nostalgic throwback uniforms would go on to influence future NHL seasons, as numerous teams began adopting them as official alternate jerseys.", "hard_negative": "Many teams in the NHL adopted throwback jerseys, making a notable impact on future seasons."}
{"anchor": "It is known for its inviting jungle gym-like characteristics.", "positive": "For its inviting jungle gym-like characteristics, it is well known.", "hard_negative": "It is especially well known for its creatively inviting structure that resembles a jungle gym in both form and function."}
{"anchor": "The animated series takes place chronologically between the and films.", "positive": "Chronologically, the animated series takes place between the films.", "hard_negative": "The animated series is situated chronologically between the first and second films, continuing the storyline in greater depth."}
{"anchor": "The shrinking generator uses a different technique.", "positive": "A different technique is used by the shrinking generator.", "hard_negative": "The shrinking generator uses a different method."}
{"anchor": "The division was one of the original 65 divisions contested at the first federal election.", "positive": "During the first federal election, this division was one of the 65 that were originally contested.", "hard_negative": "The division in question was notably one of the original 65 electoral divisions contested during the historic first federal election."}
{"anchor": "Electric rays are found from shallow coastal waters down to at least 1000 m deep.", "positive": "Electric rays inhabit marine zones ranging from shallow shores to depths of over 1000 meters.", "hard_negative": "Electric rays live from coasts down to 1000 m."}
{"anchor": "A bird bath is an attraction for many different species of birds to visit gardens, especially during the summer and drought periods.", "positive": "Especially during summer and drought periods, a bird bath attracts many different bird species to gardens.", "hard_negative": "A bird bath is a common and effective attraction for many different species of birds to visit residential gardens, especially in the heat of summer or during prolonged drought periods."}
{"anchor": "Western modern historical linguistics dates from the late 18th century.", "positive": "Contemporary Western historical linguistics originates in the late 1700s.", "hard_negative": "The study of language change in Western traditions started in the late 1700s."}
{"anchor": "The state agency operates with an annual appropriation of approximately six million dollars and approximately 100 employees.", "positive": "The state agency currently operates with an annual budget appropriation of approximately six million dollars and employs around 100 full-time staff members.", "hard_negative": "The state agency has around 100 employees and a yearly budget of six million dollars."}
{"anchor": "Located on the hillside, the palace was considered crucial in establishing control in the early days of the kingdom.", "positive": "The hillside palace was crucial early in the kingdom.", "hard_negative": "The palace, located on the hillside, was considered crucial in the early days of the kingdom for establishing control."}
{"anchor": "The 20 in diameter cannon accepted balls that weighed 175 kg.", "positive": "Balls that weighed 175 kg were accepted by the 20 in diameter cannon.", "hard_negative": "The cannon accepted 175 kg balls."}
{"anchor": "This lets the photographer control the amount of light reaching the film or image sensor.", "positive": "This enables the photographer to regulate how much light reaches the film or image sensor.", "hard_negative": "This lets the photographer control the light on the sensor."}
{"anchor": "Kodkods are active during the day and night, but they only go into open ground under the cover of darkness.", "positive": "Most kodkods avoid open ground unless it’s nighttime, though they are active day and night.", "hard_negative": "They are active day and night, but kodkods only enter open ground in darkness."}
{"anchor": "These plants are very simple: They lack an obvious stem or leaves.", "positive": "They lack an obvious stem or leaves—these plants are very simple.", "hard_negative": "These plants are structurally very simple: they notably lack an obvious stem or any recognizable leaves."}
{"anchor": "On the 29 August 2010 trail bike riders discovered another human skeleton in the forest.", "positive": "On 29 August 2010, several trail bike riders found yet another human skeleton in the forest.", "hard_negative": "On 29 August 2010, off-road bikers came across an additional human skeleton in the woodland."}
{"anchor": "Females reach sexual maturity at 4 years while males do not reach maturity until 7 years old.", "positive": "While males do not reach maturity until 7, females reach sexual maturity at 4 years.", "hard_negative": "Typically, females reach sexual maturity at around 4 years of age, whereas males usually do not become sexually mature until approximately 7 years old."}
{"anchor": "Similarities in his musical style with the earlier works of Mozart have often been noted.", "positive": "Clear similarities in his musical style with the earlier compositions of Mozart have been frequently observed and discussed by scholars.", "hard_negative": "His music is often compared to early Mozart."}
{"anchor": "The main attack tried to rescue the trapped battalions.", "positive": "The main attack aimed to rescue battalions.", "hard_negative": "To rescue the trapped battalions, the main attack was launched."}
{"anchor": "The court has ruled that the $2.7 billion in school funding was not good enough and was given out unfairly.", "positive": "The funding plan for schools was deemed both lacking and poorly allocated by the court.", "hard_negative": "The court has officially ruled that the $2.7 billion set aside for school funding was grossly insufficient and distributed in a significantly unfair manner."}
{"anchor": "Conscious thought is not necessary for knowledge of results to have its effect.", "positive": "For knowledge of results to have its effect, conscious thought is not necessary.", "hard_negative": "Conscious thought isn't required for results to affect."}
{"anchor": "Zero-fare public transport services are funded in full by means other than collecting a fare from passengers, normally through heavy subsidy or commercial sponsorship by businesses.", "positive": "Many zero-fare public transport systems are financed fully through subsidies or sponsorships rather than passenger fares.", "hard_negative": "Zero-fare public transport is funded by subsidy or sponsorship."}
{"anchor": "The meaning and intent are sometimes mirrored in different terms.", "positive": "In different terms, the meaning and intent are sometimes mirrored.", "hard_negative": "The meaning and underlying intent are, on occasion, expressed or mirrored using entirely different terms or phrases."}
{"anchor": "The giant panda has luxuriant black-and-white fur.", "positive": "The giant panda sports dense and striking black-and-white pelage.", "hard_negative": "The panda has black-and-white fur."}
{"anchor": "These dates are allegedly the king's birthday and coronation day, respectively.", "positive": "These dates are the king’s birthday and coronation.", "hard_negative": "Several sources allege that these dates are, respectively, the king’s birthday and coronation day."}
{"anchor": "The female potoroos can have two babies in a year, but only carry one at a time.", "positive": "Female potoroos can have two babies but carry one at a time.", "hard_negative": "Female potoroos are capable of producing two offspring annually, though they bear only one at any given time."}
{"anchor": "The berry has a low sugar content and a mildly sweet taste.", "positive": "With a mildly sweet taste, the berry has a low sugar content.", "hard_negative": "The berry naturally has a low sugar content, which contributes to its characteristically mildly sweet taste."}
{"anchor": "The main economic activity of the municipality is agriculture and some livestock, tourism and trade with Haiti.", "positive": "The municipality relies on farming, tourism, and Haiti trade.", "hard_negative": "The principal economic activity of the municipality involves agriculture, with smaller contributions from livestock farming, tourism, and cross-border trade with Haiti."}
{"anchor": "Since measurings begun in 1905, several November records for deep snow were broken.", "positive": "Since observations commenced in 1905, numerous November snowfall records have been surpassed.", "hard_negative": "Since 1905, several November snow records were broken."}
{"anchor": "Modern instruments classified as bugles are often valved.", "positive": "Contemporary instruments identified as bugles frequently include valves.", "hard_negative": "Bugles that are modern instruments are often valved."}
{"anchor": "A group that makes more money than it spends can lend or invest the excess profit.", "positive": "If a group earns more than it spends, it can invest or lend the extra money.", "hard_negative": "A financially stable group that consistently earns more than it spends has the opportunity to lend or strategically invest its extra profit."}
{"anchor": "The only time a female flying lizard ventures to the ground is when she is ready to lay her eggs.", "positive": "The only instance when a female flying lizard will descend to the ground is precisely when she is about to lay her eggs.", "hard_negative": "A female flying lizard doesn’t go to the ground except to lay eggs."}
{"anchor": "Most competitive teams keep two sets of uniforms, with one design emphasizing the primary color and the other emphasizing the secondary color.", "positive": "Competitive teams typically use two uniforms: one focuses on the main color, and the other on a secondary color.", "hard_negative": "Most professional and competitive teams typically retain two distinct uniforms—one that prominently features the primary team color, and another that showcases the secondary color."}
{"anchor": "When writing currency amounts the location of the symbol varies by currency.", "positive": "The location of the symbol varies by currency when writing currency amounts.", "hard_negative": "In currency notation, symbol placement differs depending on the currency."}
{"anchor": "A special Christmas family meal is traditionally an important part of the holiday's celebration, and the food that is served varies greatly from country to country.", "positive": "The food served varies greatly from country to country, and a special Christmas family meal is traditionally important.", "hard_negative": "A traditional and special Christmas family meal forms an essential part of the holiday celebration, although the dishes served differ substantially between different countries."}
{"anchor": "Passes are synced between iOS devices using iCloud, and OS X 10.8.2 and later also support opening passes to be sent to users' iOS devices.", "positive": "Using iCloud, passes are synced between iOS devices, and OS X 10.8.2 and later support sending passes to users' iOS devices.", "hard_negative": "Passes are synchronized among iOS devices via iCloud, and OS X 10.8.2 onward facilitates opening passes for transfer to users’ iOS devices."}
{"anchor": "Game theory has also been used in philosophy.", "positive": "Game theory has been used in philosophy.", "hard_negative": "In addition to its use in economics and the sciences, game theory has also been applied in various branches of philosophy."}
{"anchor": "Once boot options have been selected, GRUB loads the selected kernel into memory and passes control to the kernel.", "positive": "After boot parameters are chosen, GRUB transfers control to the loaded kernel by placing it into memory.", "hard_negative": "GRUB doesn’t proceed until boot options are selected—then it loads and hands off to the kernel."}
{"anchor": "As a former President of Ireland he was given a state funeral.", "positive": "He was given a state funeral as a former President of Ireland.", "hard_negative": "In recognition of his role as a former President of Ireland, he was ceremonially honored with a state funeral."}
{"anchor": "In appearance, it is light yellow and opaque, smooth and creamy.", "positive": "It is smooth and creamy, light yellow and opaque in appearance.", "hard_negative": "It is light yellow, opaque, smooth, and creamy."}
{"anchor": "In most cases, contribution claims are made like the original claim itself.", "positive": "Contribution claims are, in most cases, made like the original claim.", "hard_negative": "Contribution claims are usually like the original."}
{"anchor": "During World War II, the elephants at the Zoo were killed in the air raids of September 7 - 8, 1941.", "positive": "The elephants at the Zoo were killed during the air raids of September 7–8, 1941, in World War II.", "hard_negative": "The air raids on September 7–8, 1941, during WWII resulted in the deaths of the Zoo’s elephants."}
{"anchor": "Exploring the mines is not allowed by the prefecture and people caught get heavy fines.", "positive": "You can’t explore the mines—those who do face large fines from the prefecture.", "hard_negative": "Exploring the mines is strictly forbidden by order of the prefecture, and individuals who are caught engaging in such activity face significant monetary penalties."}
{"anchor": "The shrinking generator takes a different approach.", "positive": "A different approach is taken by the shrinking generator.", "hard_negative": "The shrinking generator uses a different method."}
{"anchor": "Historically, Latin or Romance languages have been the official languages in this region.", "positive": "In this region, Latin or Romance languages have historically been the official languages.", "hard_negative": "Historically speaking, Latin or Romance languages have consistently functioned as the official means of communication in this region."}
{"anchor": "A traditional design, the grapnel style is simple to design and build.", "positive": "The grapnel style, a traditional design, is simple to build and design.", "hard_negative": "The grapnel style is simple to build."}
{"anchor": "Human impacts during the 19th and 20th century have been significant.", "positive": "During the 19th and 20th century, human impacts have been significant.", "hard_negative": "Anthropogenic effects throughout the 19th and 20th centuries have been considerable."}
{"anchor": "The party declined rapidly after the 1856 election.", "positive": "After the 1856 election, the party rapidly declined.", "hard_negative": "Many members left the party after the 1856 election, leading to rapid decline."}
{"anchor": "Adults of both sexes are medium to large birds.", "positive": "Both sexes, as adults, are medium to large birds.", "hard_negative": "Mature males and females are avian specimens of moderate to considerable size."}
{"anchor": "Recent editions have focused on record feats by human competitors.", "positive": "Record feats by human competitors have been the focus of recent editions.", "hard_negative": "Contemporary editions have emphasized extraordinary accomplishments by human participants."}
{"anchor": "Rapid forces were needed to protect important locations from the enemy.", "positive": "To protect important locations from the enemy, rapid forces were needed.", "hard_negative": "Quick military units were crucial for defending critical areas."}
{"anchor": "The geodetic center of North America is within the county.", "positive": "The geospatial center of North America lies inside the boundaries of the county.", "hard_negative": "The center of North America is in the county."}
{"anchor": "Feature films usually have insurance in place by the time principal photography begins.", "positive": "By the time principal photography begins, feature films usually have insurance in place.", "hard_negative": "Feature films almost always have comprehensive insurance policies in place by the time principal photography officially begins."}
{"anchor": "Caramel sauce is made from heating water and caster sugar at a low to medium temperature.", "positive": "At a low to medium temperature, caramel sauce is made from heating water and caster sugar.", "hard_negative": "Caramel sauce is made by heating water and sugar at a medium temperature."}
{"anchor": "While there are many alternative treatments used for the common cold, there is not enough scientific evidence to support the use of most treatments.", "positive": "While many different alternative treatments are commonly used for the common cold, there is currently insufficient scientific evidence to support most of them.", "hard_negative": "There is not enough scientific evidence to support most cold treatments."}
{"anchor": "After 1998, he began suffering from both weight-control problems and injuries.", "positive": "Following 1998, he started experiencing both weight management issues and physical injuries.", "hard_negative": "Post-1998, he encountered difficulties with weight regulation and recurring injuries."}
{"anchor": "There have been numerous revivals since newer styles supplanted ragtime in the 1920s.", "positive": "Several revivals have occurred since newer styles overtook ragtime in the 1920s.", "hard_negative": "There have been revivals since styles replaced ragtime in the 1920s."}
{"anchor": "Brown recluse spiders are usually between 6 and , but may grow larger.", "positive": "Brown recluse spiders are usually 6 to , but may grow.", "hard_negative": "These spiders generally range around 6 and , with the potential to grow bigger."}
{"anchor": "Gribbles bore into wood and plant material for food.", "positive": "Gribbles tunnel into timber and botanical matter for sustenance.", "hard_negative": "Gribbles bore into wood for food."}
{"anchor": "Though he experimented in many styles of art, his unique talent was landscape painting.", "positive": "His unique talent was landscape painting, though he experimented in many styles of art.", "hard_negative": "Although he explored various artistic genres, his exceptional gift lay in landscape painting."}
{"anchor": "Szeged and surrounding area has been inhabited since ancient time.", "positive": "Since ancient time, Szeged and the surrounding area has been inhabited.", "hard_negative": "Szeged and the surrounding area has reportedly been inhabited continuously since ancient time."}
{"anchor": "As of the 2011 testing season, exams cost $87 each, though the cost may reduced for poor students who cannot pay for it.", "positive": "Exams cost $87 each as of the 2011 testing season, though the cost may be reduced for students who cannot pay.", "hard_negative": "As of the 2011 standardized testing season, exams generally cost $87 per subject, although the cost may be reduced for economically disadvantaged students."}
{"anchor": "Visitors typically arrive at a tram station in the arrival plaza between the administrative buildings and the museum entrance.", "positive": "Most visitors arrive at a tram station in the arrival plaza between the administrative buildings and the museum entrance.", "hard_negative": "Guests usually disembark at a tram stop situated in the arrival plaza flanked by the administrative buildings and the museum entry."}
{"anchor": "The work is anonymous, and there is speculation about the author's identity.", "positive": "There is speculation about the author's identity, and the work is anonymous.", "hard_negative": "The piece is unattributed, prompting conjecture regarding who the author might be."}
{"anchor": "Heavy rotation or power rotation is a list of songs that get the most airplay on a radio station.", "positive": "Power rotation is a list of songs with most airplay.", "hard_negative": "Heavy or power rotation refers to a playlist of tracks receiving maximum airplay on a radio station."}
{"anchor": "He is thought of as one of the most important architectural thinkers and urbanists of his generation.", "positive": "He is widely thought of as one of the most important architectural thinkers and influential urbanists of his entire generation.", "hard_negative": "He is considered an important architectural thinker of his generation."}
{"anchor": "Soaps and detergents help to spread the oils and dirt particles through the water, so they can be washed away.", "positive": "Soaps and detergents effectively help to break down and spread the oils and dirt particles through the water, enabling them to be washed away more easily.", "hard_negative": "Soaps spread oils and dirt so they can be washed away."}
{"anchor": "Many species have five petals, often grown together.", "positive": "Many species have five joined petals.", "hard_negative": "Most of these species have five petals that are typically joined."}
{"anchor": "The library has a chess room that houses a wide range of materials dedicated to the history, study and practice of chess.", "positive": "The library has a chess room that holds numerous materials dedicated to the history, study, and practice of chess.", "hard_negative": "The library features a well-equipped chess room that houses a wide range of materials meticulously dedicated to the history, study, and practice of chess."}
{"anchor": "African elephants receive some legal protection in every country where they are found.", "positive": "In every country where they are found, African elephants receive some legal protection.", "hard_negative": "African elephants consistently receive at least some form of legal protection in every country where they are currently found."}
{"anchor": "Butter cakes are often made by beating the butter and sugar until fluffy.", "positive": "Many butter cakes are made by beating the butter and sugar until fluffy.", "hard_negative": "Butter cakes are frequently prepared by creaming butter and sugar until aerated."}
{"anchor": "Its relative major is E major, and its parallel major is C-sharp major.", "positive": "The relative major is E major, and the parallel major is C-sharp major.", "hard_negative": "It is not associated with any other major keys apart from E major and C-sharp major."}
{"anchor": "Some specific ministries/department are not allocated to anyone in the cabinet but the Prime Minister himself.", "positive": "Some ministries are not given to anyone except the Prime Minister.", "hard_negative": "A few specific ministries are managed solely by the Prime Minister and not delegated to others."}
{"anchor": "While these literary sources do not prove that the punishment still took place, they do provide evidence that it had not been forgotten.", "positive": "Although these literary sources cannot conclusively demonstrate that the punishment persisted, they nonetheless provide compelling evidence that it was not forgotten.", "hard_negative": "These sources do not prove the punishment continued, but they show it had not been forgotten."}
{"anchor": "I am a researcher in applied corpus linguistics.", "positive": "I work as a scholar specializing in applied corpus linguistics.", "hard_negative": "I am a researcher in linguistics."}
{"anchor": "The majority of squid are no more than 60 cm long, although the giant squid may reach 13 m.", "positive": "Although the giant squid may reach 13 m, the majority of squid are no more than 60 cm long.", "hard_negative": "Most squid are under 60 cm, but giant ones may reach 13 m."}
{"anchor": "The head and thorax are white.", "positive": "The head and thorax are colored white.", "hard_negative": "The head and thorax are alabaster."}
{"anchor": "Governments use different kinds of taxes and vary the tax rates.", "positive": "Many governments use several kinds of taxes and frequently vary the rates.", "hard_negative": "Governments typically use different kinds of taxes and periodically vary the tax rates to suit economic conditions."}
{"anchor": "Bear is often called a hard science fiction author because he uses many scientific details in his work.", "positive": "Because he uses many scientific details, Bear is often called a hard science fiction author.", "hard_negative": "Bear is frequently referred to as a hard science fiction writer due to his incorporation of numerous scientific elements in his narratives."}
{"anchor": "Historic Scotland had direct responsibility for maintaining and running over 360 monuments in its care, about a quarter of which are manned and charge admission entry.", "positive": "Historic Scotland had direct administrative responsibility for maintaining and managing a collection of over 360 monuments, with approximately one quarter of them staffed and requiring an admission fee.", "hard_negative": "Historic Scotland maintained over 360 monuments, some of which charge admission."}
{"anchor": "Following two major accidents in 2002 and 2003, one of the main issues in safety has been at the corner 130R.", "positive": "Since the serious accidents in 2002 and 2003, safety concerns have focused on corner 130R.", "hard_negative": "After two significant incidents in 2002 and 2003, a primary safety concern has revolved around corner 130R."}
{"anchor": "The station's large hall was chosen because its dimensions are similar to 19th century concert halls, that is, it is shaped in the 'shoebox style'.", "positive": "Because of its similar dimensions to 19th century concert halls, the station's large hall—shaped in the 'shoebox style'—was chosen.", "hard_negative": "The expansive hall of the station was selected due to its resemblance in dimensions to 19th-century concert venues, specifically featuring a 'shoebox style' design."}
{"anchor": "Nightingales are named so because they frequently sing at night as well as during the day.", "positive": "Nightingales are named because they sing at night.", "hard_negative": "Because they sing both during the day and at night, nightingales are named accordingly."}
{"anchor": "In addition, there are 19 associate members and one affiliate member.", "positive": "There are 19 associate members and one affiliate member, in addition.", "hard_negative": "In addition to full members, the organization comprises 19 associate members and one affiliate member."}
{"anchor": "Roussimoff died in his sleep of congestive heart failure on the night of January 27 , 1993 , in a Paris hotel room.", "positive": "On the night of January 27, 1993, in a Paris hotel room, Roussimoff died in his sleep of congestive heart failure.", "hard_negative": "Roussimoff died in his sleep from heart failure on January 27, 1993."}
{"anchor": "Healthy gums usually have no reaction to normal disturbance such as brushing.", "positive": "Healthy gums, under usual conditions, typically have no visible reaction to regular activities such as brushing.", "hard_negative": "Healthy gums have no reaction to brushing."}
{"anchor": "While the cause of the common cold has only been identified since the 1950s , the disease has been with humanity throughout history.", "positive": "Although the exact cause of the common cold was discovered only in the 1950s, this widespread illness has remained with humans across all historical eras.", "hard_negative": "The cause of the common cold wasn't known until the 1950s, but the illness itself has always been present."}
{"anchor": "For example , assume an investor had to choose between two stocks.", "positive": "Assume an investor, for example, had to choose between two stocks.", "hard_negative": "For instance, suppose an investor needed to select between two equities."}
{"anchor": "During the Spanish Civil War he left his work to be in theater as an amateur actor.", "positive": "He left his work during the Spanish Civil War to be in theater as an amateur actor.", "hard_negative": "During the intense period of the Spanish Civil War, he chose to leave his profession behind and participate in theater as a passionate amateur actor."}
{"anchor": "Blankets may also be used on the ground for a picnic or other places where people want to sit without their clothing getting dirty or wet.", "positive": "For a picnic or in areas where people want to stay clean and dry, blankets may also be used on the ground.", "hard_negative": "Blankets can additionally serve as ground coverings for picnics or settings where individuals wish to avoid soiling or wetting their clothes."}
{"anchor": "Today Trailways members are spread across North America.", "positive": "Trailways members are spread across North America today.", "hard_negative": "Today, Trailways members are widely spread throughout many regions of North America."}
{"anchor": "Certain networks have made changes to prevent them from being used by such multi-network IM clients.", "positive": "Several networks have made adjustments to restrict usage by multi-network IM clients.", "hard_negative": "Networks made changes to block multi-network IM clients."}
{"anchor": "All- female bands are not restricted by mainstream genres.", "positive": "All-female bands are not limited by genres.", "hard_negative": "All-female bands, unlike some of their counterparts, are not strictly limited by traditional mainstream genres."}
{"anchor": "Bird banders have found that only 25 % of juvenile American robins live through their first year.", "positive": "Only 25% of juvenile American robins live through their first year, bird banders have found.", "hard_negative": "Only 25% of juvenile robins survive their first year."}
{"anchor": "Before the unification of Egypt, the land was settled with autonomous villages.", "positive": "The land was settled with autonomous villages before the unification of Egypt.", "hard_negative": "Before Egypt united, autonomous villages settled the land."}
{"anchor": "One of the primary industries in the town is tourism, most notably scuba diving.", "positive": "A major sector of the town’s economy is tourism, particularly scuba diving.", "hard_negative": "In this coastal town, one of the leading economic drivers is tourism, with scuba diving standing out as the most prominent attraction."}
{"anchor": "The yellow flowers of the plant produce hairy seed pods, with each pod containing roughly a half dozen seeds.", "positive": "The vibrant yellow flowers of the plant typically develop into hairy seed pods, each carrying approximately half a dozen seeds.", "hard_negative": "The yellow flowers produce seed pods with around six seeds."}
{"anchor": "The English text comprises 108,260 words and is divided into two parts, each reading as a continuous narrative with no chapter divisions.", "positive": "With no chapter divisions, the 108,260-word English text is split into two continuous narrative parts.", "hard_negative": "Divided into two parts, the English text includes 108,260 words and has no chapter breaks."}
{"anchor": "No firm dates can be assigned to this Emperor's life or reign, but he is conventionally considered to have reigned from 406 CE to 410 CE.", "positive": "Definitive dates are elusive for this Emperor’s life and rule, yet scholars generally agree he ruled from 406 to 410 CE.", "hard_negative": "The Emperor is considered to have ruled from 406 to 410 CE."}
{"anchor": "The eastern border of the province corresponds to the western side of the Maas, which originates in France.", "positive": "The eastern border of the province precisely corresponds to the western side of the Maas, which notably originates in France.", "hard_negative": "The eastern border of the province does not differ from the western side of the Maas, which starts in France."}
{"anchor": "This phrase is British in origin and derives from sports that use goalposts.", "positive": "British in origin, this phrase comes from sports that use goalposts.", "hard_negative": "This particular phrase is of British origin, specifically deriving from competitive sports that involve goalposts."}
{"anchor": "This species is blue-green to green in color and commonly grows to approximately 46 cm.", "positive": "This species is green and grows to about 46 cm.", "hard_negative": "This organism is typically green-toned and grows to nearly half a meter."}
{"anchor": "Birdsong died on June 4, 2019, as a result of injuries sustained in a car crash.", "positive": "Birdsong died on June 4, 2019, from crash injuries.", "hard_negative": "Birdsong passed away on June 4, 2019, due to trauma sustained in a vehicular accident."}
{"anchor": "The A $32 million first phase of a major upgrade began in 2010 and is expected to be completed during 2015.", "positive": "A major $32 million upgrade started in 2010 and was expected to conclude in 2015.", "hard_negative": "The A$32 million first phase of the comprehensive upgrade initiative was launched in 2010 and anticipated to conclude by 2015."}
{"anchor": "The hosts were only announced after the qualifying round, which meant all teams had to participate in the qualification process for the final stage.", "positive": "Due to the decision to announce the hosts only after the qualifying round, every team was required to take part in the qualification process for the final stage.", "hard_negative": "The host nations were disclosed post-qualification, necessitating all teams to undergo the selection process for the final round."}
{"anchor": "Most species of the sea snakes are able to respire through the top of their skin.", "positive": "Most sea snake species have developed the ability to respire through the top portion of their permeable skin.", "hard_negative": "It is not uncommon for sea snakes to breathe through their skin."}
{"anchor": "Producing a stop-motion animation using clay is extremely laborious.", "positive": "Using clay to produce stop-motion animation is extremely laborious.", "hard_negative": "Producing clay stop-motion animation isn’t a simple task."}
{"anchor": "After World War II, the countries in Europe wanted to live peacefully together and help one another's economies.", "positive": "European countries wanted to help one another's economies and live peacefully together after World War II.", "hard_negative": "Many countries in Europe wanted peaceful coexistence and economic cooperation after World War II."}
{"anchor": "Architecture is the art and science of designing buildings and structures.", "positive": "Architecture is the design of buildings and structures.", "hard_negative": "Architecture is both the expressive art and technical science of thoughtfully designing buildings and physical structures."}
{"anchor": "A common-use facility or terminal design disallows airlines to have its own proprietary check-in counters, gates and IT systems.", "positive": "A common-use terminal design generally prohibits individual airlines from maintaining their exclusive check-in counters, gates, and IT platforms.", "hard_negative": "Most common-use terminals prevent airlines from having exclusive check-in counters and systems."}
{"anchor": "Throughout the campus, many fountains provide white noise as a background.", "positive": "Many fountains throughout the campus provide background white noise.", "hard_negative": "Throughout the campus, a large number of ornamental fountains gently provide white noise to enrich the background atmosphere."}
{"anchor": "There is probably titanium in your eyeglass frames.", "positive": "Titanium is probably in your eyeglass frames.", "hard_negative": "It is likely that titanium is a component of your eyeglass frames."}
{"anchor": "Otherwise, companies in France was looking for graduated students with specialized skills, for jobs in key sectors.", "positive": "Companies in France, otherwise, were looking for graduated students with specialized skills for key sector jobs.", "hard_negative": "Otherwise, enterprises in France were seeking alumni with expertise, for employment in critical sectors."}
{"anchor": "The Romans adopted the Greek tradition, writing at first in Greek, but eventually chronicling their history in a freshly non-Greek language.", "positive": "The Romans embraced the Hellenic tradition, initially composing in Greek, but later documenting their history in a newly adopted language.", "hard_negative": "The Romans adopted Greek writing, then used another language."}
{"anchor": "It is grown as an ornamental plant in gardens, where several cultivars have been selected with varying pastel colors, including pink and purple.", "positive": "It is cultivated as a decorative plant in gardens, with various cultivars featuring a palette of pastel shades, such as pink and violet.", "hard_negative": "This plant is often chosen for gardens because of its soft-colored varieties, like pink and purple."}
{"anchor": "All shrews are comparatively small, most no larger than a mouse.", "positive": "Most shrews are no larger than a mouse, and all are comparatively small.", "hard_negative": "Almost all shrews are small, usually no bigger than mice."}
{"anchor": "Production and use of energy resources is important to the economy of the world.", "positive": "Energy production and use is important to the world economy.", "hard_negative": "Generation and utilization of energy resources is vital to the global economy."}
{"anchor": "The nouns and adjectives are created by removing the ending and thus obtaining the root.", "positive": "The nouns and adjectives are formed by stripping the suffix and thereby extracting the stem.", "hard_negative": "Nouns and adjectives are made by getting the root."}
{"anchor": "The phrase is used in widely varying contexts.", "positive": "The phrase is used in many different contexts.", "hard_negative": "The phrase is commonly used in a remarkably wide range of diverse contexts and scenarios."}
{"anchor": "This species may be seen flying from April to October in the south, while in the north it flies from summer to early fall.", "positive": "In the south, this species may be seen flying from April to October, while in the north, it flies from summer to early fall.", "hard_negative": "This species may be observed airborne from April through October in southern regions, and from summer until early autumn in the north."}
{"anchor": "There were just two entries in the quad doubles, and they played a straight final to decide the championship.", "positive": "In the quad doubles, there were just two entries, and they played a straight final to decide the championship.", "hard_negative": "There were merely two contenders in the quad doubles, and they contested a direct final to determine the champion."}
{"anchor": "Leaf insects use camouflage to take on the appearance of a leaf.", "positive": "To take on the appearance of a leaf, leaf insects use camouflage.", "hard_negative": "Leaf insects use camouflage to look like a leaf."}
{"anchor": "Many game artists are called upon to develop graphical treatments for the environments and elements in which role-playing games take place.", "positive": "Numerous game illustrators are tasked with designing visual treatments for the settings and components of role-playing games.", "hard_negative": "Game artists develop graphics for RPG environments."}
{"anchor": "The number of chromosomes is 40.", "positive": "The chromosome count is 40.", "hard_negative": "The organism possesses a total of 40 chromosomes."}
{"anchor": "Insect respiration happens without lungs.", "positive": "Respiration in insects happens without lungs.", "hard_negative": "Insects breathe through a system that does not involve lungs."}
{"anchor": "Its natural habitats are subtropical or tropical forests.", "positive": "Its habitats are subtropical or tropical forests.", "hard_negative": "Its primary natural habitats are lush subtropical or tropical forests with dense vegetation."}
{"anchor": "One of the main industries in the town is tourism, most notably scuba diving.", "positive": "A major economic sector in the town is tourism, particularly scuba diving.", "hard_negative": "Among the town's key industries, tourism stands out—particularly due to the popularity of scuba diving with visitors."}
{"anchor": "The swimming competition was held in the open sea because the organizers had refused to spend the money necessary for a specially constructed stadium.", "positive": "Because the organizers refused to spend money on a specially built stadium, the swimming competition was held in the open sea.", "hard_negative": "The swimming competition was conducted in the open sea as the event organizers deliberately avoided the high cost of building a dedicated stadium."}
{"anchor": "It is made up of 8 districts and 28 municipalities.", "positive": "It has 8 districts and 28 municipalities.", "hard_negative": "Administratively, it is made up of 8 distinct districts and 28 individual municipalities."}
{"anchor": "Car rentals are subject to many conditions which vary from one brand to another.", "positive": "Car rentals are generally subject to many varying conditions depending on the specific brand or provider.", "hard_negative": "Automobile rentals are governed by numerous stipulations that differ across companies."}
{"anchor": "Sixth is the roof escape opening that is in place on all Funny Cars since the division was made in the early 1970s.", "positive": "The sixth is the roof escape opening in all Funny Cars since the 1970s.", "hard_negative": "The sixth element, a roof escape opening, has been a mandatory safety feature on all Funny Cars since the class began in the early 1970s."}
{"anchor": "The film's story is about an astronaut crew who leave Earth on a deep space mission and crash land on a supposedly alien planet in the 40th century.", "positive": "The movie's plot follows a team of astronauts who depart Earth for deep space and eventually crash on a presumed extraterrestrial planet in the 40th century.", "hard_negative": "The film is about astronauts who crash on an alien planet in the 40th century."}
{"anchor": "There were some changes in the terms of their service which may have created resentment.", "positive": "Several changes in their service terms may have led to resentment.", "hard_negative": "Resentment may have stemmed from alterations to the terms of their service."}
{"anchor": "Mood and emotions at work are related to job satisfaction.", "positive": "Work mood and emotions are tied to job satisfaction.", "hard_negative": "Affective states and feelings in the workplace are linked to job satisfaction."}
{"anchor": "They got together to pray and wish the rains would stop flooding the river and drowning the crops.", "positive": "All of them came together to pray that the constant rains would stop flooding the river.", "hard_negative": "They assembled to pray and hope the rainfall would cease inundating the river and submerging the crops."}
{"anchor": "Town criers were protected by royalty, as they sometimes brought bad news such as tax increases.", "positive": "Heralds were safeguarded by the monarchy, as they occasionally delivered unfavorable news like tax hikes.", "hard_negative": "Town criers were protected because they brought bad news."}
{"anchor": "The pumpkin is native to the continent of North America.", "positive": "The pumpkin is native to North America.", "hard_negative": "The well-known pumpkin is believed to be native specifically to the continent of North America."}
{"anchor": "Agriculture is still one of the main activities in the province, adding 15% to its output.", "positive": "One of the main activities in the province is still agriculture, contributing 15% to output.", "hard_negative": "The province continues to rely heavily on agriculture, which contributes 15% to its total output."}
{"anchor": "There are no records of any military related acts in his time in which he participated.", "positive": "There appear to be no official records documenting any military actions in which he was involved during his time.", "hard_negative": "No documentation exists of his involvement in any martial endeavors during his era."}
{"anchor": "People first began using weather charts in a modern way in the mid-19th century.", "positive": "In the mid-19th century, people began using weather charts in a modern way.", "hard_negative": "In the field of meteorology, people first began adopting weather charts in a modern and systematic manner during the mid-19th century."}
{"anchor": "At about 11 : 31 AM MST, the track of both airplanes intersected over the canyon, and they hit each other.", "positive": "The paths of both airplanes intersected over the canyon at about 11:31 AM MST, and they collided.", "hard_negative": "The planes crashed into each other after crossing paths over the canyon around 11:31 AM MST."}
{"anchor": "In order to communicate with each other, both the French girlfriend and the Japanese boyfriend decided to learn a third language.", "positive": "The French girlfriend and the Japanese boyfriend decided to learn a third language to communicate with each other.", "hard_negative": "In order to communicate more effectively with each other, the French girlfriend and the Japanese boyfriend mutually decided to learn an entirely new third language."}
{"anchor": "Fireworks dates back to the 7th century and originated in China.", "positive": "Fireworks originated in 7th-century China.", "hard_negative": "Fireworks, a popular form of celebration worldwide, originally emerged in China during the 7th century."}
{"anchor": "In the center of a village, the ground begins to open up and a strange green light emanates from within.", "positive": "The ground begins to open up in the center of a village, and a strange green light emanates from within.", "hard_negative": "The ground doesn't remain solid in the village center; instead, it opens as a strange green light emerges."}
{"anchor": "This subfamily is widely distributed, and members are adapted to a wide variety of environments.", "positive": "Members are adapted to a wide range of environments, and this subfamily is widely distributed.", "hard_negative": "This subfamily is distributed and adapted to many environments."}
{"anchor": "Call and response singing is common in modern Western popular music.", "positive": "In modern Western popular music, call and response singing is common.", "hard_negative": "Call and response singing, a dynamic vocal technique, is particularly common in modern Western popular music."}
{"anchor": "The rocky coastline has been the site of a number of shipwrecks.", "positive": "The coastline has seen many shipwrecks.", "hard_negative": "The rugged shore has claimed multiple ships over time."}
{"anchor": "There was just two entries in the Quad doubles, and they played a straight final to decided the championship.", "positive": "In the Quad doubles, there were just two entries, and they played a final to decide the championship.", "hard_negative": "Due to the limited number of just two entries in the Quad doubles, the event culminated in a straight final to determine the championship outcome."}
{"anchor": "The historical journal, a forum where academic historians could exchange ideas and publish newly discovered information, came into being in the 19th century.", "positive": "The scholarly periodical, a venue for historians to share insights and publish fresh discoveries, emerged during the 19th century.", "hard_negative": "Many academic historians contributed to the historical journal, which was established in the 19th century."}
{"anchor": "Canada is also home to many indigenous languages.", "positive": "Canada is also home to numerous aboriginal languages.", "hard_negative": "Canada is also home to many distinct and historically significant indigenous languages."}
{"anchor": "Some clinics function as a place for people with injuries or illnesses to come and be seen by a triage nurse or other health worker.", "positive": "Many clinics operate as places for people with injuries or illnesses to receive care from triage nurses or health workers.", "hard_negative": "Some clinics help people with injuries or illnesses see a health worker."}
{"anchor": "March music is often important for ceremonial occasions.", "positive": "For ceremonial occasions, march music is often important.", "hard_negative": "March music is often particularly important during formal ceremonial occasions such as parades or official events."}
{"anchor": "The officials announcing the new policy looked like they were ready for inevitable criticism.", "positive": "Most of the officials looked like they were ready for the inevitable criticism.", "hard_negative": "The officials, while announcing the controversial new policy, looked like they were fully prepared for the inevitable wave of public criticism."}
{"anchor": "He played a brief part in the revolutionary events of 1848.", "positive": "He played a part in the events of 1848.", "hard_negative": "He had a minor role in the upheavals of 1848."}
{"anchor": "After several decades of prosperity, it entered a period of protracted political, military and economic decline.", "positive": "Following decades of affluence, it entered an extended phase of political, military, and economic deterioration.", "hard_negative": "After prosperity, it entered decline."}
{"anchor": "The displeased principal kept walking around the classroom.", "positive": "Around the classroom, the displeased principal kept walking.", "hard_negative": "The clearly displeased principal restlessly kept walking back and forth across the classroom."}
{"anchor": "Is responsible for emulating realistic laws of physics within the application.", "positive": "Handles the simulation of authentic physical laws in the application.", "hard_negative": "Responsible for physics emulation in the app."}
{"anchor": "Up-and-over or overhead doors are often used in garages.", "positive": "Overhead doors are often used in garages.", "hard_negative": "Retractable or overhead doors are commonly utilized in garages."}
{"anchor": "In 1907, residents of the town decided to incorporate.", "positive": "In 1907, the town decided to incorporate.", "hard_negative": "In 1907, after much discussion, residents of the town decided to incorporate as a formal local government."}
{"anchor": "He died of pneumonia and heart failure on 7 January 2018, aged 61.", "positive": "On 7 January 2018, he died of pneumonia and heart failure, aged 61.", "hard_negative": "He died of severe pneumonia and congestive heart failure on 7 January 2018, when he was 61 years old."}
{"anchor": "Numbers seven and eight on the list are of a different kind from the first six, and have generally not been considered by the other authors.", "positive": "On the list, numbers seven and eight are of a different kind from the first six and usually not considered by other authors.", "hard_negative": "Numbers seven and eight on the list, which are notably distinct from the first six, have generally not been taken into account by other authors."}
{"anchor": "Intellectual property laws have the effect of converting some goods to scarce goods by law.", "positive": "Intellectual property laws effectively transform some otherwise accessible goods into scarce goods through legal frameworks.", "hard_negative": "IP laws convert some goods to scarce ones."}
{"anchor": "Unique among the United States, Alaska is not entirely subdivided into organized county equivalents.", "positive": "Among the United States, Alaska is unique in not being entirely divided into organized county equivalents.", "hard_negative": "Alaska is not fully divided into counties."}
{"anchor": "Strategic bombing was an idea first tried in World War I.", "positive": "Strategic bombing was not a concept that emerged after World War I.", "hard_negative": "The concept of strategic aerial bombing was initially implemented during World War I."}
{"anchor": "There are various modifications that can be implemented atop the fundamentals of the battle royale.", "positive": "Modifications of various kinds can be added atop the fundamentals of the battle royale.", "hard_negative": "Various modifications can be implemented."}
{"anchor": "Several times people in Australia have wanted to remove the monarchy.", "positive": "People in Australia have wanted to remove the monarchy several times.", "hard_negative": "On numerous occasions, citizens in Australia have sought to abolish the monarchy."}
{"anchor": "There were several inter-promotional matches after Unforgiven.", "positive": "There were several high-profile inter-promotional matches that took place after Unforgiven.", "hard_negative": "Numerous cross-promotional matches occurred following Unforgiven."}
{"anchor": "Assuming a comfortable position helps the baby to latch properly.", "positive": "Assuming a comfortable position helps the baby latch.", "hard_negative": "Adopting a relaxed posture assists the baby in latching effectively."}
{"anchor": "Rat snakes are commonly kept as pets by reptile enthusiasts.", "positive": "Rat snakes are kept as pets by reptile enthusiasts.", "hard_negative": "Rat snakes are popular pets among those interested in reptiles."}
{"anchor": "Basic general information about the clients: creator/company, license, etc.", "positive": "Some basic general information is provided about the clients: such as creator, license, etc.", "hard_negative": "Basic general information about the clients, including identifiers such as creator, company affiliation, license details, and more."}
