[
  {
    "original_id": "2285",
    "original_sentence": "Blankets may be spread on the ground for a picnic or where people want to sit in a grassy or muddy area without soiling their clothing.",
    "lexical": "Blankets may be laid on the ground for a picnic or where individuals wish to sit in a verdant or sodden area without staining their garments.",
    "shuffle": "For a picnic or where people want to sit in a grassy or muddy area without soiling their clothing, blankets may be spread on the ground.",
    "restructure": "In grassy or muddy areas where people want to sit without soiling their clothing, blankets can be spread on the ground for a picnic.",
    "negation": "Blankets are not unlikely to be spread on the ground for a picnic or in places where people don't want to soil their clothing in grassy or muddy areas.",
    "quantifier": "Blankets may often be spread on the ground for a picnic or in places where many people want to sit in a grassy or muddy area without soiling their clothing.",
    "resemantic": "Blankets can be placed on the ground for a picnic or wherever people prefer to sit on grass or mud without getting their clothes dirty.",
    "insert": "Blankets may be carefully spread on the ground for a relaxing picnic or in locations where people want to sit in a grassy or muddy area without accidentally soiling their clothing.",
    "delete": "Blankets may be spread on the ground for a picnic or where people want to sit without soiling their clothing."
  },
  {
    "original_id": "1912",
    "original_sentence": "As with all other cricket statistics, batting statistics and records are given much attention and provide a measure of a player's effectiveness.",
    "lexical": "As with all other cricket metrics, batting statistics and records receive considerable attention and offer an indication of a player's proficiency.",
    "shuffle": "Batting statistics and records, as with all other cricket statistics, are given much attention and provide a measure of a player's effectiveness.",
    "restructure": "Batting statistics and records, which are treated like all other cricket statistics, are closely followed as they reflect a player's effectiveness.",
    "negation": "Batting statistics and records are not ignored, as with all other cricket statistics, and they do not fail to provide a measure of a player's effectiveness.",
    "quantifier": "As with most other cricket statistics, batting statistics and records are given significant attention and provide a strong measure of a player's effectiveness.",
    "resemantic": "Just like other data in cricket, batting stats and records attract attention and serve to gauge how effective a player is.",
    "insert": "As with all other detailed cricket statistics, batting statistics and historical records are given much attention and typically provide a reliable measure of a player's effectiveness.",
    "delete": "As with other cricket statistics, batting records are given attention and provide a measure of a player's effectiveness."
  },
  {
    "original_id": "1255",
    "original_sentence": "Both at the server and the user level, Discord allows users to connect these to their Twitch.tv or other gaming service account.",
    "lexical": "At both the server and user level, Discord permits users to link these to their Twitch.tv or alternative gaming platform account.",
    "shuffle": "Discord allows users, both at the server and user level, to connect these to their Twitch.tv or other gaming service account.",
    "restructure": "Users can connect these to their Twitch.tv or other gaming service account through Discord, whether at the server level or user level.",
    "negation": "Discord does not prevent users, either at the server or user level, from connecting these to their Twitch.tv or other gaming service account.",
    "quantifier": "At both the server and user level, Discord allows most users to connect these to their Twitch.tv or any other gaming service account.",
    "resemantic": "Whether on the server side or user side, Discord enables users to integrate these with their Twitch.tv or another gaming service account.",
    "insert": "Both at the server and the individual user level, Discord conveniently allows users to connect these to their Twitch.tv or other popular gaming service account.",
    "delete": "At the server and user level, Discord allows users to connect these to their Twitch.tv or other gaming account."
  },
  {
    "original_id": "1978",
    "original_sentence": "Built between 2003 and 2006 out of formerly barren lands, it covers 40 hectares.",
    "lexical": "Constructed between 2003 and 2006 from previously arid lands, it spans 40 hectares.",
    "shuffle": "Out of formerly barren lands, built between 2003 and 2006, it covers 40 hectares.",
    "restructure": "It covers 40 hectares and was built between 2003 and 2006 on what used to be barren land.",
    "negation": "Not built before 2003, it covers 40 hectares on what was once barren land.",
    "quantifier": "Built between 2003 and 2006 out of mostly barren lands, it covers 40 hectares.",
    "resemantic": "Developed on once unused terrain between 2003 and 2006, it occupies 40 hectares.",
    "insert": "Built between 2003 and 2006 out of previously barren agricultural lands, it currently covers 40 hectares.",
    "delete": "Built between 2003 and 2006, it covers 40 hectares."
  },
  {
    "original_id": "1700",
    "original_sentence": "Standing ovations are also often given in a sporting game to reflect an outstanding individual performance.",
    "lexical": "Standing ovations are frequently bestowed during sporting events to acknowledge a remarkable individual achievement.",
    "shuffle": "In a sporting game, standing ovations are also often given to reflect an outstanding individual performance.",
    "restructure": "To acknowledge an outstanding individual performance, standing ovations are often given in sporting games.",
    "negation": "Standing ovations are not rarely given in a sporting game when someone performs exceptionally.",
    "quantifier": "Standing ovations are usually given in many sporting games to reflect an outstanding individual performance.",
    "resemantic": "In sports, audiences often give standing ovations to honor exceptional personal achievements.",
    "insert": "Standing ovations are also often spontaneously given in a competitive sporting game to reflect an outstanding individual performance.",
    "delete": "Standing ovations are often given in a sporting game to reflect an individual performance."
  },
  {
    "original_id": "91",
    "original_sentence": "More women being shunned from higher executive positions are protesting on social media.",
    "lexical": "An increasing number of women excluded from top executive roles are voicing dissent on social media.",
    "shuffle": "Women being shunned from higher executive positions are protesting more on social media.",
    "restructure": "Women who are increasingly excluded from senior executive positions are turning to social media to protest.",
    "negation": "Not all women accepted into executive positions are silent; many excluded ones are protesting on social media.",
    "quantifier": "Many women being shunned from higher executive positions are actively protesting on social media.",
    "resemantic": "More women facing exclusion from top leadership roles are expressing their frustration on social media.",
    "insert": "More and more women being consistently shunned from higher executive positions are now actively protesting on social media platforms.",
    "delete": "More women shunned from executive positions are protesting on social media."
  },
  {
    "original_id": 2669,
    "original_sentence": "As a profession, medical illustration has a more recent history.",
    "lexical": "As an occupation, medical illustration possesses a comparatively modern history.",
    "shuffle": "Medical illustration, as a profession, has a more recent history.",
    "restructure": "The history of medical illustration as a profession is relatively recent.",
    "negation": "Medical illustration does not have an ancient history as a profession; it's more recent.",
    "quantifier": "In many regions, medical illustration as a profession has a more recent history.",
    "resemantic": "The development of medical illustration into a formal job is fairly new.",
    "insert": "As a formal profession, medical illustration has a significantly more recent history compared to other artistic disciplines.",
    "delete": "Medical illustration has a recent professional history."
  },
  {
    "original_id": 1791,
    "original_sentence": "From 2014 the museum faced budget cuts that dropped its maintenance to less than R $ 520,000 annually.",
    "lexical": "Starting in 2014, the museum experienced financial reductions that reduced its upkeep budget to below R $520,000 per year.",
    "shuffle": "The museum faced budget cuts from 2014 that dropped its maintenance to less than R $ 520,000 annually.",
    "restructure": "Since 2014, budget cuts have lowered the museum's maintenance funds to under R $520,000 per year.",
    "negation": "From 2014, the museum didn’t avoid budget cuts; its funding dropped below R $ 520,000 annually.",
    "quantifier": "In recent years, including from 2014 onward, the museum has faced several budget cuts reducing its annual maintenance below R $520,000.",
    "resemantic": "After 2014, financial constraints reduced the museum’s upkeep budget to under R $520,000 per year.",
    "insert": "Beginning in 2014, the museum encountered serious budget cuts that significantly reduced its maintenance allocation to less than R $520,000 per year.",
    "delete": "Since 2014, museum maintenance dropped below R $520,000."
  },
  {
    "original_id": 1746,
    "original_sentence": "With the start of the Soest district in 1817 its influence slowly rose.",
    "lexical": "Following the establishment of the Soest district in 1817, its prominence gradually increased.",
    "shuffle": "Its influence slowly rose with the start of the Soest district in 1817.",
    "restructure": "The creation of the Soest district in 1817 marked the beginning of its rising influence.",
    "negation": "Its influence didn’t remain static after 1817—it started to rise gradually with the founding of the Soest district.",
    "quantifier": "In many ways, the influence of the region began to rise gradually after the Soest district was founded in 1817.",
    "resemantic": "The establishment of the Soest district in 1817 marked a period of growing regional importance.",
    "insert": "With the official start of the Soest district in 1817, its political and economic influence slowly but steadily rose.",
    "delete": "In 1817, with Soest's start, its influence rose."
  },
  {
    "original_id": 515,
    "original_sentence": "The throwback uniforms would have an impact on future seasons in the NHL, as several teams adopted throwbacks as alternate jerseys.",
    "lexical": "Retro uniforms influenced later NHL seasons, with various teams incorporating them as secondary jerseys.",
    "shuffle": "Several teams adopted throwbacks as alternate jerseys, so the throwback uniforms impacted future NHL seasons.",
    "restructure": "Throwback uniforms influenced later NHL seasons when teams began using them as alternate jerseys.",
    "negation": "The throwback uniforms weren’t without effect—they impacted future NHL seasons as teams adopted them.",
    "quantifier": "Many teams in the NHL adopted throwback jerseys, making a notable impact on future seasons.",
    "resemantic": "Vintage-inspired jerseys changed the look of future NHL games, as multiple teams embraced the style.",
    "insert": "The nostalgic throwback uniforms would go on to influence future NHL seasons, as numerous teams began adopting them as official alternate jerseys.",
    "delete": "Throwback uniforms influenced future NHL seasons."
  },
  {
    "original_id": 1339,
    "original_sentence": "It is known for its inviting jungle gym-like characteristics.",
    "lexical": "It is recognized for its appealing, jungle gym-esque features.",
    "shuffle": "For its inviting jungle gym-like characteristics, it is well known.",
    "restructure": "Its design resembles a jungle gym, making it particularly inviting.",
    "negation": "It is not devoid of appeal—it’s known for its jungle gym-like design.",
    "quantifier": "Many people know it for its highly inviting jungle gym-like structure.",
    "resemantic": "Its popularity stems from a structure that mimics playground climbing frames.",
    "insert": "It is especially well known for its creatively inviting structure that resembles a jungle gym in both form and function.",
    "delete": "It is known for jungle gym-like characteristics."
  },
  {
    "original_id": 556,
    "original_sentence": "The animated series takes place chronologically between the and films.",
    "lexical": "The animated show is set in chronological order between the two cinematic installments.",
    "shuffle": "Chronologically, the animated series takes place between the films.",
    "restructure": "Set in time between the two films, the animated series fills the narrative gap.",
    "negation": "It doesn’t occur before or after the films—it takes place between them.",
    "quantifier": "In most timelines, the animated series fits chronologically between the films.",
    "resemantic": "The storyline of the animated series bridges the events of the two main movies.",
    "insert": "The animated series is situated chronologically between the first and second films, continuing the storyline in greater depth.",
    "delete": "The animated series takes place between films."
  },
  {
    "original_id": 1461,
    "original_sentence": "The shrinking generator uses a different technique.",
    "lexical": "The shrinking generator employs an alternative method.",
    "shuffle": "A different technique is used by the shrinking generator.",
    "restructure": "Instead of traditional methods, the shrinking generator applies a unique technique.",
    "negation": "It doesn’t use the same approach— the shrinking generator uses a different technique.",
    "quantifier": "Many cryptographic systems use varied methods; the shrinking generator employs a distinct one.",
    "resemantic": "The shrinking generator operates with its own specific method, unlike conventional ones.",
    "insert": "The shrinking generator utilizes a notably different cryptographic technique from standard generators.",
    "delete": "The shrinking generator uses a different method."
  },
  {
    "original_id": 1074,
    "original_sentence": "The division was one of the original 65 divisions contested at the first federal election.",
    "lexical": "The division was among the initial 65 constituencies involved in the inaugural federal election.",
    "shuffle": "One of the original 65 divisions contested at the first federal election was the division.",
    "restructure": "During the first federal election, this division was one of the 65 that were originally contested.",
    "negation": "The division wasn’t absent from the first federal election—it was among the original 65 divisions.",
    "quantifier": "Several of the first 65 divisions, including this one, were part of the initial federal election.",
    "resemantic": "This was one of the foundational districts participating in the country’s first national vote.",
    "insert": "The division in question was notably one of the original 65 electoral divisions contested during the historic first federal election.",
    "delete": "The division was among the original 65 in the first election."
  },
  {
    "original_id": 2156,
    "original_sentence": "As part of the regeneration, the transport links to Ravenscraig will be greatly improved.",
    "lexical": "As an element of the redevelopment, transportation connections to Ravenscraig will be significantly enhanced.",
    "shuffle": "The transport links to Ravenscraig will be greatly improved as part of the regeneration.",
    "restructure": "Regeneration efforts will lead to major improvements in transport access to Ravenscraig.",
    "negation": "The regeneration won’t exclude transport—connections to Ravenscraig will be greatly enhanced.",
    "quantifier": "Many aspects of the regeneration include better transport links to Ravenscraig.",
    "resemantic": "Part of the urban renewal includes major upgrades to how people get to and from Ravenscraig.",
    "insert": "As part of the extensive regeneration project, the transport links and connectivity to Ravenscraig will be greatly improved and modernized.",
    "delete": "As part of regeneration, Ravenscraig transport will improve."
  },
  {
    "original_id": 1851,
    "original_sentence": "Electric rays are found from shallow coastal waters down to at least 1000 m deep.",
    "lexical": "Electric rays inhabit marine zones ranging from shallow shores to depths of over 1000 meters.",
    "shuffle": "From shallow coastal waters to at least 1000 m deep, electric rays are found.",
    "restructure": "Electric rays live in ocean habitats that span from coastal shallows to depths of 1000 meters or more.",
    "negation": "They aren’t confined to shallow waters—electric rays are found down to at least 1000 m deep.",
    "quantifier": "In various regions, electric rays are found from nearshore waters to depths exceeding 1000 meters.",
    "resemantic": "Electric rays occupy a wide depth range, from coastal areas to deep-sea zones.",
    "insert": "Electric rays are commonly found in marine environments ranging from shallow coastal waters all the way down to depths of at least 1000 meters.",
    "delete": "Electric rays live from coasts down to 1000 m."
  },
  {
    "original_id": 1077,
    "original_sentence": "A bird bath is an attraction for many different species of birds to visit gardens, especially during the summer and drought periods.",
    "lexical": "A bird bath serves as a lure for various avian species to frequent gardens, particularly in summer and during dry spells.",
    "shuffle": "Especially during summer and drought periods, a bird bath attracts many different bird species to gardens.",
    "restructure": "Many species of birds are drawn to gardens with bird baths, especially in times of summer heat or drought.",
    "negation": "A bird bath doesn’t fail to attract birds—many species visit it, particularly during summer and drought.",
    "quantifier": "A wide variety of bird species are attracted to bird baths in gardens, especially during summer and periods of drought.",
    "resemantic": "Bird baths help bring birds into gardens, especially when water is scarce in hot or dry seasons.",
    "insert": "A bird bath is a common and effective attraction for many different species of birds to visit residential gardens, especially in the heat of summer or during prolonged drought periods.",
    "delete": "A bird bath attracts many birds to gardens, especially in summer."
  },
  {
    "original_id": 1682,
    "original_sentence": "Western modern historical linguistics dates from the late 18th century.",
    "lexical": "Contemporary Western historical linguistics originates in the late 1700s.",
    "shuffle": "From the late 18th century dates Western modern historical linguistics.",
    "restructure": "The roots of modern Western historical linguistics go back to the late 18th century.",
    "negation": "Western modern historical linguistics does not predate the late 18th century.",
    "quantifier": "Most scholars agree that modern Western historical linguistics began in the late 18th century.",
    "resemantic": "The study of language change in Western traditions started in the late 1700s.",
    "insert": "Western modern historical linguistics as a formal discipline dates back to the late 18th century.",
    "delete": "Modern Western historical linguistics began in the 18th century."
  },
  {
    "original_id": 758,
    "original_sentence": "The state agency operates with an annual appropriation of approximately six million dollars and approximately 100 employees.",
    "lexical": "The government agency functions with a yearly budget of about six million dollars and a staff of roughly 100 individuals.",
    "shuffle": "With approximately six million dollars and 100 employees, the state agency operates annually.",
    "restructure": "The state agency has around 100 employees and a yearly budget of six million dollars.",
    "negation": "The state agency doesn’t operate without resources—it has about six million dollars and 100 staff.",
    "quantifier": "Many state agencies operate with similar budgets—this one has around six million dollars and 100 employees annually.",
    "resemantic": "The agency runs yearly with funding close to six million and a workforce near 100.",
    "insert": "The state agency currently operates with an annual budget appropriation of approximately six million dollars and employs around 100 full-time staff members.",
    "delete": "The state agency has six million dollars and 100 employees."
  },
  {
    "original_id": 521,
    "original_sentence": "Medical testing for sexually transmitted infections is important for prevention.",
    "lexical": "Diagnostic screening for STIs plays a vital role in prevention.",
    "shuffle": "For prevention, medical testing for sexually transmitted infections is important.",
    "restructure": "To prevent sexually transmitted infections, medical testing is essential.",
    "negation": "Prevention isn’t effective without medical testing for sexually transmitted infections.",
    "quantifier": "In most cases, routine medical testing helps prevent the spread of sexually transmitted infections.",
    "resemantic": "Getting tested for STIs is a key part of stopping their transmission.",
    "insert": "Regular medical testing for sexually transmitted infections is critically important for both early detection and prevention.",
    "delete": "Testing for STIs is important for prevention."
  },
  {
    "original_id": 1621,
    "original_sentence": "Located on the hillside, the palace was considered crucial in establishing control in the early days of the kingdom.",
    "lexical": "Situated on an elevated slope, the palace played a pivotal role in consolidating power during the kingdom’s formative period.",
    "shuffle": "The palace, located on the hillside, was considered crucial in the early days of the kingdom for establishing control.",
    "restructure": "The hillside palace was essential to asserting control in the kingdom's early development.",
    "negation": "The palace was not seen as insignificant—it was crucial for control in early kingdom times.",
    "quantifier": "In early times, many believed the hillside palace was crucial to establishing control over the kingdom.",
    "resemantic": "Perched on a hill, the palace was central to early governance in the kingdom.",
    "insert": "Strategically located on the hillside, the palace was viewed as crucial to asserting control during the formative years of the kingdom.",
    "delete": "The hillside palace was crucial early in the kingdom."
  },
  {
    "original_id": 630,
    "original_sentence": "The 20 in diameter cannon accepted balls that weighed 175 kg.",
    "lexical": "The 20-inch diameter cannon accommodated projectiles weighing 175 kilograms.",
    "shuffle": "Balls that weighed 175 kg were accepted by the 20 in diameter cannon.",
    "restructure": "This cannon, measuring 20 inches in diameter, could fire 175 kg balls.",
    "negation": "It wasn’t a small cannon—the 20-inch barrel accepted 175 kg balls.",
    "quantifier": "Most cannons of this type could accept heavy balls; this one fired 175 kg rounds.",
    "resemantic": "With its large bore, the cannon was capable of launching massive 175 kg projectiles.",
    "insert": "The massive 20-inch diameter cannon was engineered to accept extremely heavy balls, each weighing up to 175 kilograms.",
    "delete": "The cannon accepted 175 kg balls."
  },
  {
    "original_id": 1935,
    "original_sentence": "This lets the photographer control the amount of light reaching the film or image sensor.",
    "lexical": "This enables the photographer to regulate how much light reaches the film or image sensor.",
    "shuffle": "The photographer controls the light reaching the film or sensor using this.",
    "restructure": "This gives photographers control over the light that hits the sensor or film.",
    "negation": "Without this, photographers wouldn’t be able to control light reaching the sensor.",
    "quantifier": "Most photographers use this to control the amount of light hitting the sensor or film.",
    "resemantic": "It allows the photographer to adjust exposure by managing incoming light.",
    "insert": "This mechanism allows the photographer to precisely control the intensity of light that reaches the film or image sensor during shooting.",
    "delete": "This lets the photographer control the light on the sensor."
  },
  {
    "original_id": 1474,
    "original_sentence": "Kodkods are active during the day and night, but they only go into open ground under the cover of darkness.",
    "lexical": "Kodkods exhibit diurnal and nocturnal activity, venturing into open areas solely at night.",
    "shuffle": "They are active day and night, but kodkods only enter open ground in darkness.",
    "restructure": "Although active both day and night, kodkods enter open areas only when it's dark.",
    "negation": "Kodkods don’t go into open ground during daylight—they do so only in darkness.",
    "quantifier": "Most kodkods avoid open ground unless it’s nighttime, though they are active day and night.",
    "resemantic": "These wildcats roam at all hours but step into the open only when it’s dark.",
    "insert": "Kodkods remain active both during the day and at night, yet they venture into open ground exclusively under the cover of night.",
    "delete": "Kodkods are active day and night but enter open ground only at night."
  },
  {
    "original_id": 1495,
    "original_sentence": "These plants are very simple: They lack an obvious stem or leaves.",
    "lexical": "These plants are quite primitive: they do not possess distinct stems or foliage.",
    "shuffle": "They lack an obvious stem or leaves—these plants are very simple.",
    "restructure": "Due to the absence of clear stems or leaves, these plants are considered very simple.",
    "negation": "These plants don’t have defined stems or leaves, which makes them simple.",
    "quantifier": "Many of these plants lack obvious stems and leaves, making them structurally simple.",
    "resemantic": "With no visible stem or foliage, these are among the most basic plants.",
    "insert": "These plants are structurally very simple: they notably lack an obvious stem or any recognizable leaves.",
    "delete": "These plants lack stems and leaves."
  },
  {
    "original_id": 1563,
    "original_sentence": "On the 29 August 2010 trail bike riders discovered another human skeleton in the forest.",
    "lexical": "On 29 August 2010, off-road bikers came across an additional human skeleton in the woodland.",
    "shuffle": "Trail bike riders discovered another human skeleton in the forest on 29 August 2010.",
    "restructure": "Another human skeleton was found in the forest by trail bikers on 29 August 2010.",
    "negation": "It wasn’t the first skeleton—another was found by trail riders on 29 August 2010.",
    "quantifier": "On 29 August 2010, several trail bike riders found yet another human skeleton in the forest.",
    "resemantic": "A human skeleton was uncovered in the woods by bikers in late August 2010.",
    "insert": "On the morning of 29 August 2010, a group of trail bike riders discovered yet another human skeleton lying deep within the forest.",
    "delete": "On 29 August 2010, bikers found a skeleton in the forest."
  },
  {
    "original_id": 2189,
    "original_sentence": "Females reach sexual maturity at 4 years while males do not reach maturity until 7 years old.",
    "lexical": "Females attain reproductive maturity at 4 years, whereas males achieve it at 7.",
    "shuffle": "While males do not reach maturity until 7, females reach sexual maturity at 4 years.",
    "restructure": "Sexual maturity occurs at age 4 in females, but males don’t mature until they’re 7.",
    "negation": "Males don't mature as early as females—females mature by 4 years, males not until 7.",
    "quantifier": "In most cases, females reach sexual maturity earlier, around 4 years, while males take about 7 years.",
    "resemantic": "Females become capable of reproduction earlier than males, who mature three years later.",
    "insert": "Typically, females reach sexual maturity at around 4 years of age, whereas males usually do not become sexually mature until approximately 7 years old.",
    "delete": "Females mature at 4, males at 7."
  },
  {
    "original_id": 654,
    "original_sentence": "Similarities in his musical style with the earlier works of Mozart have often been noted.",
    "lexical": "Parallels between his musical style and Mozart’s earlier compositions have frequently been observed.",
    "shuffle": "His musical style has often been noted for similarities with the earlier works of Mozart.",
    "restructure": "Observers have often noted that his style resembles early Mozart compositions.",
    "negation": "It hasn’t gone unnoticed—many have remarked on similarities to early Mozart.",
    "quantifier": "In numerous analyses, similarities to early Mozart can be found in his musical style.",
    "resemantic": "People often say his music echoes Mozart’s earlier works.",
    "insert": "Clear similarities in his musical style with the earlier compositions of Mozart have been frequently observed and discussed by scholars.",
    "delete": "His music is often compared to early Mozart."
  },
  {
    "original_id": 424,
    "original_sentence": "It can be used as a mordant.",
    "lexical": "It may serve as a mordant in dyeing processes.",
    "shuffle": "As a mordant, it can be used.",
    "restructure": "This substance is useful as a mordant.",
    "negation": "It’s not unusable—it can be used as a mordant.",
    "quantifier": "In many cases, it can be used effectively as a mordant.",
    "resemantic": "It functions well as a fixing agent for dyes.",
    "insert": "In textile dyeing, it can often be used as an effective mordant to help fix colors.",
    "delete": "It is used as a mordant."
  },
  {
    "original_id": 2102,
    "original_sentence": "The main attack tried to rescue the trapped battalions.",
    "lexical": "The primary offensive attempted to liberate the encircled battalions.",
    "shuffle": "To rescue the trapped battalions, the main attack was launched.",
    "restructure": "An effort was made during the main assault to free the battalions that were trapped.",
    "negation": "The main attack wasn’t solely for assault—it aimed to rescue trapped battalions.",
    "quantifier": "The main attack was one of several attempts to rescue the trapped battalions.",
    "resemantic": "The major assault was focused on freeing the surrounded troops.",
    "insert": "The main military attack was specifically initiated in an attempt to rescue the battalions that had been trapped behind enemy lines.",
    "delete": "The main attack aimed to rescue battalions."
  },
  {
    "original_id": 1527,
    "original_sentence": "The court has ruled that the $2.7 billion in school funding was not good enough and was given out unfairly.",
    "lexical": "The court determined that the $2.7 billion allocated for education was insufficient and inequitably distributed.",
    "shuffle": "That the $2.7 billion in school funding was inadequate and unfairly distributed was the court’s ruling.",
    "restructure": "According to the court, the school funding of $2.7 billion was both inadequate and distributed in an unfair manner.",
    "negation": "The court didn’t find the $2.7 billion acceptable—it was inadequate and unfairly distributed.",
    "quantifier": "Much of the $2.7 billion was considered by the court to be insufficient and unfairly distributed.",
    "resemantic": "The funding plan for schools was deemed both lacking and poorly allocated by the court.",
    "insert": "The court has officially ruled that the $2.7 billion set aside for school funding was grossly insufficient and distributed in a significantly unfair manner.",
    "delete": "The court ruled the $2.7 billion was unfair."
  },
  {
    "original_id": 1294,
    "original_sentence": "Conscious thought is not necessary for knowledge of results to have its effect.",
    "lexical": "Awareness is not essential for performance feedback to exert its influence.",
    "shuffle": "For knowledge of results to have its effect, conscious thought is not necessary.",
    "restructure": "The effect of knowing results does not require conscious thought.",
    "negation": "It isn’t required to be consciously aware for feedback to have an effect.",
    "quantifier": "In many instances, knowledge of results impacts behavior without the need for conscious thought.",
    "resemantic": "Feedback can shape learning even without conscious awareness.",
    "insert": "Interestingly, conscious thought is generally not required for knowledge of results to produce behavioral changes or improvements.",
    "delete": "Conscious thought isn't required for results to affect."
  },
  {
    "original_id": 2357,
    "original_sentence": "Zero-fare public transport services are funded in full by means other than collecting a fare from passengers, normally through heavy subsidy or commercial sponsorship by businesses.",
    "lexical": "Zero-fare transit systems are entirely financed through alternatives to passenger fares, typically substantial subsidies or business sponsorships.",
    "shuffle": "Funded fully through other means like subsidies or sponsorship, zero-fare public transport doesn’t rely on passenger fares.",
    "restructure": "Instead of charging passengers, zero-fare transport is paid for by subsidies or corporate sponsorships.",
    "negation": "These services don’t depend on fares—they're funded by other means such as subsidies or sponsorships.",
    "quantifier": "Many zero-fare public transport systems are financed fully through subsidies or sponsorships rather than passenger fares.",
    "resemantic": "Fare-free transit is supported financially through government or business backing instead of rider payments.",
    "insert": "Zero-fare public transportation systems are entirely funded by alternative means, such as generous government subsidies or direct sponsorship from private businesses, rather than passenger fares.",
    "delete": "Zero-fare public transport is funded by subsidy or sponsorship."
  },
  {
    "original_id": 792,
    "original_sentence": "The meaning and intent are sometimes mirrored in different terms.",
    "lexical": "The significance and purpose are occasionally reflected using alternative terminology.",
    "shuffle": "In different terms, the meaning and intent are sometimes mirrored.",
    "restructure": "Different words can sometimes reflect the same meaning and intent.",
    "negation": "It’s not always the case, but meaning and intent can sometimes be mirrored by different terms.",
    "quantifier": "In some cases, the meaning and intent are mirrored using different expressions.",
    "resemantic": "Similar ideas may be conveyed using varied language.",
    "insert": "The meaning and underlying intent are, on occasion, expressed or mirrored using entirely different terms or phrases.",
    "delete": "Meaning and intent are mirrored in other terms."
  },
  {
    "original_id": 1907,
    "original_sentence": "The giant panda has luxuriant black-and-white fur.",
    "lexical": "The giant panda sports dense and striking black-and-white pelage.",
    "shuffle": "Luxuriant black-and-white fur covers the giant panda.",
    "restructure": "Covered in plush black and white fur, the giant panda is easily recognized.",
    "negation": "It’s not lacking in fur—the giant panda has rich black-and-white fur.",
    "quantifier": "Most giant pandas are recognized by their thick black-and-white fur.",
    "resemantic": "The panda’s thick coat of black and white makes it visually distinctive.",
    "insert": "The giant panda is instantly recognizable thanks to its thick, luxuriant coat of black-and-white fur.",
    "delete": "The panda has black-and-white fur."
  },
  {
    "original_id": 2495,
    "original_sentence": "These dates are allegedly the king's birthday and coronation day, respectively.",
    "lexical": "These dates are purported to correspond to the king’s birthday and his coronation, respectively.",
    "shuffle": "The king's birthday and coronation day are, respectively, what these dates allegedly represent.",
    "restructure": "It is claimed that one date marks the king's birth and the other his coronation.",
    "negation": "These dates aren’t confirmed—but they’re allegedly tied to the king’s birthday and coronation.",
    "quantifier": "Several sources allege that these dates are, respectively, the king’s birthday and coronation day.",
    "resemantic": "It is said that one date marks the king's birth and the other marks his ascension.",
    "insert": "According to several reports, these two dates are believed to represent the king's birthday and his coronation day, respectively.",
    "delete": "These dates are the king’s birthday and coronation."
  },
  {
    "original_id": 1176,
    "original_sentence": "The female potoroos can have two babies in a year, but only carry one at a time.",
    "lexical": "Female potoroos are capable of producing two offspring annually, though they bear only one at any given time.",
    "shuffle": "Female potoroos can have two babies a year, but carry only one at a time.",
    "restructure": "Although they can have two babies in a year, female potoroos carry just one at a time.",
    "negation": "Female potoroos don't carry both babies simultaneously—they carry only one at a time.",
    "quantifier": "Most female potoroos may produce two babies annually but carry only a single one at once.",
    "resemantic": "Potoroos give birth to two young per year, though only one is carried at a time.",
    "insert": "The female potoroos can potentially give birth to two babies in a year, although biologically, they are only able to carry one at any given time.",
    "delete": "Female potoroos can have two babies but carry one at a time."
  },
  {
    "original_id": 417,
    "original_sentence": "The berry has a low sugar content and a mildly sweet taste.",
    "lexical": "The berry contains minimal sugar and possesses a subtly sweet flavor.",
    "shuffle": "With a mildly sweet taste, the berry has a low sugar content.",
    "restructure": "Because of its low sugar content, the berry tastes only mildly sweet.",
    "negation": "The berry isn’t overly sweet, as it has a low sugar content.",
    "quantifier": "Many berries with low sugar levels have a mildly sweet taste, including this one.",
    "resemantic": "This berry is not very sugary but still has a gentle sweetness.",
    "insert": "The berry naturally has a low sugar content, which contributes to its characteristically mildly sweet taste.",
    "delete": "The berry has low sugar and mild sweetness."
  },
  {
    "original_id": 2503,
    "original_sentence": "The main economic activity of the municipality is agriculture and some livestock, tourism and trade with Haiti.",
    "lexical": "Agriculture, limited livestock, tourism, and commerce with Haiti constitute the primary economic activities of the municipality.",
    "shuffle": "Agriculture, livestock, tourism, and trade with Haiti are the municipality’s main economic activities.",
    "restructure": "The municipality’s economy relies on farming, livestock, tourism, and trade with Haiti.",
    "negation": "The municipality’s economy doesn’t rely on industry but on farming, livestock, tourism, and trade with Haiti.",
    "quantifier": "Most of the municipality’s economic output comes from agriculture, some livestock, tourism, and trading with Haiti.",
    "resemantic": "Farming and cross-border commerce, alongside tourism, drive the area’s economy.",
    "insert": "The principal economic activity of the municipality involves agriculture, with smaller contributions from livestock farming, tourism, and cross-border trade with Haiti.",
    "delete": "The municipality relies on farming, tourism, and Haiti trade."
  },
  {
    "original_id": 1133,
    "original_sentence": "Since measurings begun in 1905, several November records for deep snow were broken.",
    "lexical": "Since observations commenced in 1905, numerous November snowfall records have been surpassed.",
    "shuffle": "Several November deep snow records were broken since measurements began in 1905.",
    "restructure": "Ever since snow measurements started in 1905, multiple November records for snowfall have been broken.",
    "negation": "It’s not the case that all records held—several were broken since 1905.",
    "quantifier": "Many snowfall records for November have been broken since 1905, when measurements began.",
    "resemantic": "Record-breaking deep snowfalls have occurred in November multiple times since 1905.",
    "insert": "Since official snow measurements began in 1905, multiple longstanding November records for deep snow have been broken.",
    "delete": "Since 1905, several November snow records were broken."
  },
  {
    "original_id": 760,
    "original_sentence": "Modern instruments classified as bugles are often valved.",
    "lexical": "Contemporary instruments identified as bugles frequently include valves.",
    "shuffle": "Bugles that are modern instruments are often valved.",
    "restructure": "Bugles in modern classifications often have valves.",
    "negation": "Modern bugles aren’t always valve-less—they’re often valved.",
    "quantifier": "Many modern instruments labeled as bugles come equipped with valves.",
    "resemantic": "Today’s bugles often include valves, unlike traditional ones.",
    "insert": "Modern musical instruments that fall under the bugle category are often manufactured with valve systems.",
    "delete": "Modern bugles often have valves."
  },
  {
    "original_id": 966,
    "original_sentence": "A group that makes more money than it spends can lend or invest the excess profit.",
    "lexical": "An organization generating a surplus can allocate the remaining funds through lending or investment.",
    "shuffle": "If a group earns more than it spends, it can invest or lend the extra money.",
    "restructure": "Groups with income exceeding expenses may use the surplus for lending or investing.",
    "negation": "If a group doesn’t spend more than it earns, it may use the leftover funds for investment or lending.",
    "quantifier": "Most groups with excess revenue over expenses choose to lend or invest the surplus.",
    "resemantic": "Surplus funds can be put toward loans or investments by financially successful groups.",
    "insert": "A financially stable group that consistently earns more than it spends has the opportunity to lend or strategically invest its extra profit.",
    "delete": "Groups with profit can lend or invest it."
  },
  {
    "original_id": 2552,
    "original_sentence": "The only time a female flying lizard ventures to the ground is when she is ready to lay her eggs.",
    "lexical": "A female flying lizard descends to the ground solely for egg-laying purposes.",
    "shuffle": "Only when she is ready to lay eggs does the female flying lizard go to the ground.",
    "restructure": "Female flying lizards go to the ground exclusively to lay eggs.",
    "negation": "A female flying lizard doesn’t go to the ground except to lay eggs.",
    "quantifier": "Most female flying lizards only touch the ground when they are ready to lay eggs.",
    "resemantic": "Ground visits by female flying lizards occur only during reproduction.",
    "insert": "The only instance when a female flying lizard will descend to the ground is precisely when she is about to lay her eggs.",
    "delete": "She goes to the ground only to lay eggs."
  },
  {
    "original_id": 2775,
    "original_sentence": "Most competitive teams keep two sets of uniforms, with one design emphasizing the primary color and the other emphasizing the secondary color.",
    "lexical": "The majority of competitive teams maintain dual uniforms—one highlighting the primary hue, the other the secondary.",
    "shuffle": "One uniform emphasizes the primary color, and the other the secondary—most competitive teams keep both.",
    "restructure": "Competitive teams typically use two uniforms: one focuses on the main color, and the other on a secondary color.",
    "negation": "Competitive teams don’t usually rely on a single uniform—they use two with different color emphasis.",
    "quantifier": "Many competitive teams have two uniform sets: one primary-colored, one secondary-colored.",
    "resemantic": "Athletic teams often alternate between uniforms based on dominant and accent color schemes.",
    "insert": "Most professional and competitive teams typically retain two distinct uniforms—one that prominently features the primary team color, and another that showcases the secondary color.",
    "delete": "Most teams have two uniforms: primary and secondary."
  },
  {
    "original_id": 2557,
    "original_sentence": "When writing currency amounts the location of the symbol varies by currency.",
    "lexical": "In currency notation, symbol placement differs depending on the currency.",
    "shuffle": "The location of the symbol varies by currency when writing currency amounts.",
    "restructure": "Different currencies place the symbol in different positions when writing amounts.",
    "negation": "The currency symbol doesn’t always appear in the same place—it varies depending on the currency.",
    "quantifier": "In many currencies, the placement of the symbol varies when amounts are written.",
    "resemantic": "Currency formats differ in where they position the monetary symbol.",
    "insert": "When formatting currency amounts, the position of the currency symbol often differs based on regional or national conventions.",
    "delete": "Currency symbol placement varies by currency."
  },
  {
    "original_id": 675,
    "original_sentence": "A special Christmas family meal is traditionally an important part of the holiday's celebration, and the food that is served varies greatly from country to country.",
    "lexical": "A festive family meal is customarily a key component of Christmas celebrations, with dishes differing widely by nation.",
    "shuffle": "The food served varies greatly from country to country, and a special Christmas family meal is traditionally important.",
    "restructure": "A key part of Christmas is the traditional family meal, which varies significantly across countries.",
    "negation": "It’s not the same everywhere—Christmas meals vary greatly between countries.",
    "quantifier": "In most cultures, the Christmas family meal is important, though the food differs greatly across countries.",
    "resemantic": "Holiday meals are a central tradition at Christmas, though what's served changes by location.",
    "insert": "A traditional and special Christmas family meal forms an essential part of the holiday celebration, although the dishes served differ substantially between different countries.",
    "delete": "Christmas meals vary by country."
  },
  {
    "original_id": 696,
    "original_sentence": "Passes are synced between iOS devices using iCloud, and OS X 10.8.2 and later also support opening passes to be sent to users' iOS devices.",
    "lexical": "Passes are synchronized among iOS devices via iCloud, and OS X 10.8.2 onward facilitates opening passes for transfer to users’ iOS devices.",
    "shuffle": "Using iCloud, passes are synced between iOS devices, and OS X 10.8.2 and later support sending passes to users' iOS devices.",
    "restructure": "iCloud syncs passes across iOS devices, while OS X 10.8.2 and newer allow users to open and send passes to their iOS devices.",
    "negation": "It's not the case that passes aren't synced—iCloud syncs them between iOS devices, and OS X 10.8.2 and later also support sending them.",
    "quantifier": "Most iOS devices sync passes using iCloud, and many OS X versions from 10.8.2 onward support pass sharing.",
    "resemantic": "Passes can be shared between iOS devices through iCloud, and newer OS X versions let users send passes to iOS.",
    "insert": "Passes are automatically synced between iOS devices through iCloud, and systems running OS X 10.8.2 or newer additionally allow users to open and send passes directly to their iOS devices.",
    "delete": "Passes are synced using iCloud, and OS X supports sending them to iOS."
  },
  {
    "original_id": 1597,
    "original_sentence": "Game theory has also been used in philosophy.",
    "lexical": "Game theory has additionally found application within philosophical discourse.",
    "shuffle": "In philosophy, game theory has also been used.",
    "restructure": "Philosophers have also applied game theory in their work.",
    "negation": "Game theory hasn’t been limited to science—it’s also used in philosophy.",
    "quantifier": "Many philosophers have utilized game theory in various contexts.",
    "resemantic": "Philosophy is another field where game theory has proven useful.",
    "insert": "In addition to its use in economics and the sciences, game theory has also been applied in various branches of philosophy.",
    "delete": "Game theory has been used in philosophy."
  },
  {
    "original_id": 1670,
    "original_sentence": "People have been pedicuring their nails for more than 4,000 years.",
    "lexical": "Individuals have maintained toenail grooming practices for over four millennia.",
    "shuffle": "For more than 4,000 years, people have been pedicuring their nails.",
    "restructure": "Nail pedicures have been a human practice dating back over 4,000 years.",
    "negation": "It’s not a recent trend—pedicures date back over 4,000 years.",
    "quantifier": "Many people throughout history have pedicured their nails for more than 4,000 years.",
    "resemantic": "Pedicures have been part of human grooming traditions for thousands of years.",
    "insert": "People across different cultures have been pedicuring their nails for a period exceeding 4,000 years.",
    "delete": "People have pedicured their nails for 4,000 years."
  },
  {
    "original_id": 694,
    "original_sentence": "Once boot options have been selected, GRUB loads the selected kernel into memory and passes control to the kernel.",
    "lexical": "After boot parameters are chosen, GRUB transfers control to the loaded kernel by placing it into memory.",
    "shuffle": "GRUB loads the selected kernel into memory and passes control to it once boot options are selected.",
    "restructure": "GRUB first loads the chosen kernel into memory and then hands over control, after boot options are chosen.",
    "negation": "GRUB doesn’t proceed until boot options are selected—then it loads and hands off to the kernel.",
    "quantifier": "In most cases, once boot options are chosen, GRUB loads the proper kernel and transfers control.",
    "resemantic": "GRUB initializes the kernel and gives it control after the user picks boot settings.",
    "insert": "Once the appropriate boot options have been selected by the user, GRUB proceeds to load the designated kernel into memory and subsequently transfers system control to it.",
    "delete": "GRUB loads the kernel and passes control to it."
  },
  {
    "original_id": 1781,
    "original_sentence": "As a former President of Ireland he was given a state funeral.",
    "lexical": "Due to his status as a former Irish President, he received a national funeral.",
    "shuffle": "He was given a state funeral as a former President of Ireland.",
    "restructure": "Because he once served as Ireland's President, a state funeral was held in his honor.",
    "negation": "He wasn't denied honors—he received a state funeral for having been President of Ireland.",
    "quantifier": "Many former national leaders like him receive state funerals.",
    "resemantic": "Being a past head of state, he was honored with an official funeral.",
    "insert": "In recognition of his role as a former President of Ireland, he was ceremonially honored with a state funeral.",
    "delete": "As President, he received a state funeral."
  },
  {
    "original_id": 1836,
    "original_sentence": "In appearance, it is light yellow and opaque, smooth and creamy.",
    "lexical": "Visually, it appears pale yellow, non-transparent, with a silky and rich texture.",
    "shuffle": "It is smooth and creamy, light yellow and opaque in appearance.",
    "restructure": "Its visual characteristics include a smooth, creamy texture and a light yellow, opaque color.",
    "negation": "It isn’t transparent or dark—it is light yellow, opaque, smooth, and creamy.",
    "quantifier": "Most descriptions mention its light yellow hue and smooth, opaque texture.",
    "resemantic": "It looks soft and rich, with a pale color and no transparency.",
    "insert": "In terms of appearance, the substance exhibits a light yellow hue, lacks transparency, and has a distinctly smooth and creamy consistency.",
    "delete": "It is light yellow, opaque, smooth, and creamy."
  },
  {
    "original_id": 628,
    "original_sentence": "In most cases, contribution claims are made like the original claim itself.",
    "lexical": "Typically, contribution claims are filed in the same manner as the initial claim.",
    "shuffle": "Contribution claims are, in most cases, made like the original claim.",
    "restructure": "Contribution claims generally follow the same process as the original ones.",
    "negation": "Contribution claims aren’t usually handled differently—they're made like the original.",
    "quantifier": "In many situations, contribution claims mimic the original claim’s format.",
    "resemantic": "Such claims are generally submitted in the same way as the initial claim.",
    "insert": "In the majority of situations, contribution claims follow the same procedural format as the original claim itself.",
    "delete": "Contribution claims are usually like the original."
  },
  {
    "original_id": 777,
    "original_sentence": "Flamsteed calculated the solar eclipses of 1666 and 1668.",
    "lexical": "Flamsteed computed the solar eclipses occurring in 1666 and 1668.",
    "shuffle": "The solar eclipses of 1666 and 1668 were calculated by Flamsteed.",
    "restructure": "In 1666 and 1668, Flamsteed performed calculations for solar eclipses.",
    "negation": "Flamsteed didn’t overlook the eclipses—he calculated those in 1666 and 1668.",
    "quantifier": "Among several eclipses, Flamsteed specifically calculated those of 1666 and 1668.",
    "resemantic": "Flamsteed predicted the sun’s eclipses for the years 1666 and 1668.",
    "insert": "Flamsteed, the noted astronomer, accurately calculated the solar eclipses that occurred in the years 1666 and 1668.",
    "delete": "Flamsteed calculated the 1666 and 1668 eclipses."
  },
  {
    "original_id": 423,
    "original_sentence": "During World War II, the elephants at the Zoo were killed in the air raids of September 7 - 8, 1941.",
    "lexical": "Amid World War II, zoo elephants perished in aerial bombings on September 7–8, 1941.",
    "shuffle": "The elephants at the Zoo were killed during the air raids of September 7–8, 1941, in World War II.",
    "restructure": "The air raids on September 7–8, 1941, during WWII resulted in the deaths of the Zoo’s elephants.",
    "negation": "The Zoo elephants didn’t survive the air raids on September 7–8, 1941, during World War II.",
    "quantifier": "Several animals, including elephants, were killed in air raids during World War II.",
    "resemantic": "Elephants at the Zoo died due to bombing during World War II in early September 1941.",
    "insert": "During the intense air raids on September 7–8, 1941, which took place amidst the chaos of World War II, the Zoo's elephants were tragically killed.",
    "delete": "The elephants were killed in the 1941 air raids."
  },
  {
    "original_id": 457,
    "original_sentence": "Exploring the mines is not allowed by the prefecture and people caught get heavy fines.",
    "lexical": "Mine exploration is prohibited by the prefectural authorities, and violators incur substantial penalties.",
    "shuffle": "The prefecture prohibits mine exploration, and violators receive heavy fines.",
    "restructure": "The prefecture has banned mine exploration, and anyone caught is heavily fined.",
    "negation": "You can’t explore the mines—those who do face large fines from the prefecture.",
    "quantifier": "In most cases, people caught exploring the mines are issued heavy fines by the prefecture.",
    "resemantic": "Unauthorized access to the mines is penalized by local authorities with steep fines.",
    "insert": "Exploring the mines is strictly forbidden by order of the prefecture, and individuals who are caught engaging in such activity face significant monetary penalties.",
    "delete": "Exploring the mines gets heavy fines."
  },
  {
    "original_id": 2111,
    "original_sentence": "The word lineman / linesman refers to those who work in generally outdoor installation and maintenance jobs.",
    "lexical": "The term lineman / linesman denotes individuals engaged in predominantly outdoor setup and upkeep tasks.",
    "shuffle": "Lineman / linesman refers to those who generally work in outdoor installation and maintenance jobs.",
    "restructure": "Those employed in outdoor installation and maintenance work are commonly referred to as linemen or linesmen.",
    "negation": "The word lineman / linesman does not refer to indoor workers but to those involved in outdoor installation and maintenance.",
    "quantifier": "Most linemen / linesmen perform outdoor installation and maintenance duties.",
    "resemantic": "People who handle outside technical setups and repairs are often called linemen or linesmen.",
    "insert": "The word lineman / linesman typically refers to individuals who perform essential outdoor installation and ongoing maintenance work.",
    "delete": "Lineman / linesman refers to those in outdoor installation and maintenance."
  },
  {
    "original_id": 1460,
    "original_sentence": "The shrinking generator takes a different approach.",
    "lexical": "The shrinking generator employs an alternative methodology.",
    "shuffle": "A different approach is taken by the shrinking generator.",
    "restructure": "Rather than following conventional methods, the shrinking generator adopts a distinct strategy.",
    "negation": "The shrinking generator does not follow the usual approach.",
    "quantifier": "Some shrinking generators take different approaches.",
    "resemantic": "Unlike standard generators, the shrinking generator uses a unique strategy.",
    "insert": "The shrinking generator, unlike traditional models, takes a notably different approach to its function.",
    "delete": "The shrinking generator uses a different method."
  },
  {
    "original_id": 1193,
    "original_sentence": "Historically, Latin or Romance languages have been the official languages in this region.",
    "lexical": "Traditionally, Latin or Romance tongues have served as the sanctioned languages in this area.",
    "shuffle": "In this region, Latin or Romance languages have historically been the official languages.",
    "restructure": "The region’s official languages have historically included Latin or other Romance languages.",
    "negation": "This region hasn’t historically used non-Romance languages as official ones.",
    "quantifier": "Most of the time, Latin or Romance languages have been used officially in this region.",
    "resemantic": "Languages from the Latin and Romance families were long used for official purposes in the area.",
    "insert": "Historically speaking, Latin or Romance languages have consistently functioned as the official means of communication in this region.",
    "delete": "Latin or Romance languages were official here."
  },
  {
    "original_id": 1905,
    "original_sentence": "A traditional design, the grapnel style is simple to design and build.",
    "lexical": "As a conventional structure, the grapnel model is straightforward to construct and fabricate.",
    "shuffle": "The grapnel style, a traditional design, is simple to build and design.",
    "restructure": "The grapnel style, being a traditional design, offers ease in construction and planning.",
    "negation": "The grapnel style isn’t complex to design or build—it follows a traditional layout.",
    "quantifier": "Most traditional designs like the grapnel style are easy to design and build.",
    "resemantic": "The grapnel style is an old and uncomplicated type that’s easy to make.",
    "insert": "As a widely recognized traditional design, the grapnel style remains relatively simple to both conceptualize and construct.",
    "delete": "The grapnel style is simple to build."
  },
  {
    "original_id": 912,
    "original_sentence": "Human impacts during the 19th and 20th century have been significant.",
    "lexical": "Anthropogenic effects throughout the 19th and 20th centuries have been considerable.",
    "shuffle": "During the 19th and 20th century, human impacts have been significant.",
    "restructure": "The 19th and 20th centuries were marked by significant human influence.",
    "negation": "It’s not as though human impacts were negligible—they were significant in the 19th and 20th centuries.",
    "quantifier": "In many instances, human impacts during those centuries were quite significant.",
    "resemantic": "Humans left a major mark on the world in the 19th and 20th centuries.",
    "insert": "Human activity, particularly throughout the 19th and 20th century, has had a notably significant impact on the environment and society.",
    "delete": "Human impacts in the 19th and 20th century were significant."
  },
  {
    "original_id": 1656,
    "original_sentence": "The party declined rapidly after the 1856 election.",
    "lexical": "The political organization experienced a swift downfall following the 1856 election.",
    "shuffle": "After the 1856 election, the party rapidly declined.",
    "restructure": "Following the 1856 election, the party quickly lost influence.",
    "negation": "The party didn’t maintain strength—it declined swiftly after 1856.",
    "quantifier": "Many members left the party after the 1856 election, leading to rapid decline.",
    "resemantic": "The party lost momentum soon after the 1856 election.",
    "insert": "The party began to decline rapidly and irreversibly in the period immediately following the 1856 election.",
    "delete": "The party declined after the 1856 election."
  },
  {
    "original_id": 1136,
    "original_sentence": "Adults of both sexes are medium to large birds.",
    "lexical": "Mature males and females are avian specimens of moderate to considerable size.",
    "shuffle": "Both sexes, as adults, are medium to large birds.",
    "restructure": "These birds grow to medium or large sizes, regardless of sex.",
    "negation": "Adults of both sexes are not small—they range from medium to large in size.",
    "quantifier": "Most adult birds of both sexes fall into the medium to large size category.",
    "resemantic": "Males and females alike tend to be fairly big when fully grown.",
    "insert": "Adults of both sexes typically grow into birds ranging in size from medium to large, depending on the species.",
    "delete": "Both sexes as adults are medium to large."
  },
  {
    "original_id": 1438,
    "original_sentence": "Recent editions have focused on record feats by human competitors.",
    "lexical": "Contemporary editions have emphasized extraordinary accomplishments by human participants.",
    "shuffle": "Record feats by human competitors have been the focus of recent editions.",
    "restructure": "Human achievements have become the primary subject of the latest editions.",
    "negation": "Recent editions haven’t ignored human competitors—they’ve focused on their record feats.",
    "quantifier": "Several recent editions have highlighted notable feats by human competitors.",
    "resemantic": "The latest volumes highlight exceptional performances by people.",
    "insert": "Recent editions of the publication have increasingly spotlighted astonishing record-breaking feats accomplished by human competitors.",
    "delete": "Recent editions focus on human record feats."
  },
  {
    "original_id": 1157,
    "original_sentence": "Rapid forces were needed to protect important locations from the enemy.",
    "lexical": "Swift-response units were essential for securing vital sites against hostile threats.",
    "shuffle": "To protect important locations from the enemy, rapid forces were needed.",
    "restructure": "To defend key locations from enemy attack, the deployment of rapid forces was necessary.",
    "negation": "Without rapid forces, important locations couldn’t be adequately protected from the enemy.",
    "quantifier": "Most important locations required fast-moving forces for protection from the enemy.",
    "resemantic": "Quick military units were crucial for defending critical areas.",
    "insert": "Highly mobile and rapid-response forces were urgently required to safeguard key strategic locations from enemy incursions.",
    "delete": "Rapid forces were needed for protection."
  },
  {
    "original_id": 1716,
    "original_sentence": "The geodetic center of North America is within the county.",
    "lexical": "The geospatial center of North America lies inside the boundaries of the county.",
    "shuffle": "Within the county lies the geodetic center of North America.",
    "restructure": "This county contains the geodetic center point of North America.",
    "negation": "The geodetic center isn’t outside the county—it’s located within it.",
    "quantifier": "Most geographic measurements place the geodetic center of North America in this county.",
    "resemantic": "North America’s central geodetic location falls within this county’s borders.",
    "insert": "The officially recognized geodetic center of the North American continent is located within the geographical limits of the county.",
    "delete": "The center of North America is in the county."
  },
  {
    "original_id": 2646,
    "original_sentence": "Feature films usually have insurance in place by the time principal photography begins.",
    "lexical": "Feature films typically secure insurance coverage prior to the commencement of principal photography.",
    "shuffle": "By the time principal photography begins, feature films usually have insurance in place.",
    "restructure": "Insurance is generally arranged for feature films before shooting starts.",
    "negation": "It is not uncommon for feature films to have insurance before principal photography starts.",
    "quantifier": "Most feature films have insurance arranged by the start of principal photography.",
    "resemantic": "Feature movies are generally insured before main filming begins.",
    "insert": "Feature films almost always have comprehensive insurance policies in place by the time principal photography officially begins.",
    "delete": "Films usually have insurance by the time shooting starts."
  },
  {
    "original_id": 1487,
    "original_sentence": "The simplest form of term life insurance is a one-year contract.",
    "lexical": "The most basic type of term life insurance is a one-year agreement.",
    "shuffle": "A one-year contract is the simplest form of term life insurance.",
    "restructure": "A one-year contract represents the most straightforward form of term life insurance.",
    "negation": "It is not uncommon for the simplest term life insurance to be a one-year contract.",
    "quantifier": "Some term life insurance policies take the form of a one-year contract.",
    "resemantic": "One-year policies are often used as the basic model for term life insurance.",
    "insert": "The simplest and most widely available form of term life insurance is a one-year contract.",
    "delete": "The simplest term life insurance is a one-year contract."
  },
  {
    "original_id": 1234,
    "original_sentence": "Caramel sauce is made from heating water and caster sugar at a low to medium temperature.",
    "lexical": "Caramel sauce is prepared by heating water and superfine sugar at a moderate temperature.",
    "shuffle": "At a low to medium temperature, caramel sauce is made from heating water and caster sugar.",
    "restructure": "To make caramel sauce, water and caster sugar are heated gently over low to medium heat.",
    "negation": "Caramel sauce is not made without heating water and caster sugar.",
    "quantifier": "Most caramel sauces are made by heating water and caster sugar at low to medium heat.",
    "resemantic": "Caramel sauce is created by slowly cooking water and sugar together.",
    "insert": "Caramel sauce is traditionally made by carefully heating water and caster sugar at a low to medium temperature.",
    "delete": "Caramel sauce is made by heating water and sugar at a medium temperature."
  },
  {
    "original_id": 2617,
    "original_sentence": "SIDS rates are higher in babies of mothers who smoke during pregnancy.",
    "lexical": "SIDS incidences are elevated among infants whose mothers smoke while pregnant.",
    "shuffle": "Babies of mothers who smoke during pregnancy have higher SIDS rates.",
    "restructure": "Infants born to mothers who smoke during pregnancy show increased SIDS rates.",
    "negation": "It is not true that SIDS rates are lower in babies of mothers who smoke during pregnancy.",
    "quantifier": "Many babies born to mothers who smoke during pregnancy face higher SIDS rates.",
    "resemantic": "Mothers who smoke while pregnant increase the risk of SIDS in their babies.",
    "insert": "SIDS rates are significantly higher in babies of mothers who smoke consistently during pregnancy.",
    "delete": "SIDS rates are higher in babies of smoking mothers."
  },
  {
    "original_id": 1795,
    "original_sentence": "While there are many alternative treatments used for the common cold, there is not enough scientific evidence to support the use of most treatments.",
    "lexical": "Although numerous alternative remedies exist for the common cold, there is insufficient empirical support for most of them.",
    "shuffle": "There is not enough scientific evidence to support the use of most treatments, even though many alternative ones are used for the common cold.",
    "restructure": "Despite the wide use of alternative treatments for the common cold, scientific support for most is lacking.",
    "negation": "There isn’t enough scientific proof to claim that most alternative cold treatments are effective.",
    "quantifier": "Many alternative treatments are used for the common cold, but few are backed by solid scientific evidence.",
    "resemantic": "Alternative therapies for colds are widespread, but most lack scientific validation.",
    "insert": "While many different alternative treatments are commonly used for the common cold, there is currently insufficient scientific evidence to support most of them.",
    "delete": "There is not enough scientific evidence to support most cold treatments."
  },
  {
    "original_id": 965,
    "original_sentence": "After 1998, he began suffering from both weight-control problems and injuries.",
    "lexical": "Following 1998, he started experiencing both weight management issues and physical injuries.",
    "shuffle": "He began suffering from weight-control problems and injuries after 1998.",
    "restructure": "Post-1998, he encountered difficulties with weight regulation and recurring injuries.",
    "negation": "After 1998, he didn’t escape problems with weight control and injuries.",
    "quantifier": "For several years after 1998, he suffered from multiple weight-control issues and injuries.",
    "resemantic": "After 1998, he struggled with maintaining weight and avoiding injury.",
    "insert": "After the year 1998, he gradually began suffering from both persistent weight-control problems and repeated injuries.",
    "delete": "He began suffering from weight and injury issues after 1998."
  },
  {
    "original_id": 2055,
    "original_sentence": "There have been numerous revivals since newer styles supplanted ragtime in the 1920s.",
    "lexical": "Multiple resurgences have occurred since contemporary genres replaced ragtime during the 1920s.",
    "shuffle": "Since newer styles supplanted ragtime in the 1920s, there have been numerous revivals.",
    "restructure": "Although ragtime was replaced by newer styles in the 1920s, it has seen many revivals.",
    "negation": "It is not true that ragtime has not experienced revivals since being replaced in the 1920s.",
    "quantifier": "Several revivals have occurred since newer styles overtook ragtime in the 1920s.",
    "resemantic": "Ragtime music has had a number of comebacks after being overtaken by newer styles in the 1920s.",
    "insert": "There have been numerous musical revivals since modern styles supplanted ragtime in the early 1920s.",
    "delete": "There have been revivals since styles replaced ragtime in the 1920s."
  },
  {
    "original_id": 915,
    "original_sentence": "Brown recluse spiders are usually between 6 and , but may grow larger.",
    "lexical": "Brown recluse spiders typically measure between 6 mm and a certain length, though they can become larger.",
    "shuffle": "Usually between 6 and , brown recluse spiders may grow even larger.",
    "restructure": "Although they are commonly between 6 and , brown recluse spiders can grow beyond this size.",
    "negation": "It is not unusual for brown recluse spiders to exceed their usual size of 6 and .",
    "quantifier": "Some brown recluse spiders are between 6 and , but others can be larger.",
    "resemantic": "These spiders generally range around 6 and , with the potential to grow bigger.",
    "insert": "Brown recluse spiders are usually between 6 and in length, although under certain conditions they may grow larger.",
    "delete": "Brown recluse spiders are usually 6 to , but may grow."
  },
  {
    "original_id": 817,
    "original_sentence": "Gribbles bore into wood and plant material for food.",
    "lexical": "Gribbles tunnel into timber and botanical matter for sustenance.",
    "shuffle": "For food, Gribbles bore into wood and plant material.",
    "restructure": "To obtain nourishment, Gribbles burrow into wood and other vegetation.",
    "negation": "Gribbles do not avoid boring into wood and plant material when feeding.",
    "quantifier": "Many Gribbles bore into wood and plant material to feed.",
    "resemantic": "Gribbles consume their meals by penetrating wood and vegetation.",
    "insert": "Gribbles typically bore into soft wood and plant material for food.",
    "delete": "Gribbles bore into wood for food."
  },
  {
    "original_id": 1780,
    "original_sentence": "Though he experimented in many styles of art, his unique talent was landscape painting.",
    "lexical": "Although he explored various artistic genres, his exceptional gift lay in landscape painting.",
    "shuffle": "His unique talent was landscape painting, though he experimented in many styles of art.",
    "restructure": "Despite his experimentation with diverse styles, he was particularly known for landscape painting.",
    "negation": "He did not lack skill in other forms, but landscape painting was his unique talent.",
    "quantifier": "Among many styles, he showed the greatest talent in landscape painting.",
    "resemantic": "He dabbled in multiple artistic styles but excelled in landscapes.",
    "insert": "Though he experimented in many artistic styles throughout his career, his unique and enduring talent was landscape painting.",
    "delete": "He experimented in many styles, but excelled in landscape painting."
  },
  {
    "original_id": 809,
    "original_sentence": "Szeged and surrounding area has been inhabited since ancient time.",
    "lexical": "Szeged and its neighboring region have been settled since antiquity.",
    "shuffle": "Since ancient time, Szeged and the surrounding area has been inhabited.",
    "restructure": "People have inhabited Szeged and its surrounding area since ancient times.",
    "negation": "It is not the case that Szeged and the surrounding area have only recently been inhabited.",
    "quantifier": "Much of Szeged and the surrounding area has been inhabited since ancient time.",
    "resemantic": "Szeged and the nearby region have seen continuous human presence since early history.",
    "insert": "Szeged and the surrounding area has reportedly been inhabited continuously since ancient time.",
    "delete": "Szeged has been inhabited since ancient time."
  },
  {
    "original_id": 668,
    "original_sentence": "As of the 2011 testing season, exams cost $87 each, though the cost may reduced for poor students who cannot pay for it.",
    "lexical": "As of the 2011 examination period, assessments cost $87 apiece, although the price may be lowered for disadvantaged students unable to afford it.",
    "shuffle": "Exams cost $87 each as of the 2011 testing season, though the cost may be reduced for students who cannot pay.",
    "restructure": "In 2011, exams were priced at $87 each, with possible reductions for low-income students.",
    "negation": "It is not always the case that all students have to pay the full $87 for exams.",
    "quantifier": "Many poor students may get reduced exam fees, though the base cost is $87 as of 2011.",
    "resemantic": "By 2011, the exam fee was $87, but financial assistance was available for students in need.",
    "insert": "As of the 2011 standardized testing season, exams generally cost $87 per subject, although the cost may be reduced for economically disadvantaged students.",
    "delete": "As of 2011, exams cost $87, though poorer students may pay less."
  },
  {
    "original_id": 2060,
    "original_sentence": "When people find specific impulse, the only fuel counted is in the rocket before it gets fired.",
    "lexical": "When determining specific impulse, only the propellant within the rocket prior to ignition is considered.",
    "shuffle": "Only the fuel inside the rocket before ignition is counted when people find specific impulse.",
    "restructure": "Specific impulse calculations include only the fuel in the rocket before it is launched.",
    "negation": "Fuel added after launch is not considered when determining specific impulse.",
    "quantifier": "All of the fuel in the rocket before firing is counted for specific impulse calculations.",
    "resemantic": "To measure specific impulse, engineers account solely for the fuel loaded pre-launch.",
    "insert": "When engineers calculate specific impulse, they include only the onboard fuel present in the rocket before it is actually fired.",
    "delete": "Specific impulse counts only the fuel in the rocket before firing."
  },
  {
    "original_id": 2786,
    "original_sentence": "Visitors typically arrive at a tram station in the arrival plaza between the administrative buildings and the museum entrance.",
    "lexical": "Guests usually disembark at a tram stop situated in the arrival plaza flanked by the administrative buildings and the museum entry.",
    "shuffle": "In the arrival plaza between the administrative buildings and museum entrance, visitors typically arrive at a tram station.",
    "restructure": "A tram station located between the administrative buildings and the museum entrance is where visitors generally arrive.",
    "negation": "Visitors do not usually arrive elsewhere but at the tram station in the arrival plaza.",
    "quantifier": "Most visitors arrive at a tram station in the arrival plaza between the administrative buildings and the museum entrance.",
    "resemantic": "The usual route for visitors leads them to a tram station positioned near the museum and offices.",
    "insert": "Visitors typically arrive at a conveniently located tram station in the arrival plaza, which lies between the administrative buildings and the museum entrance.",
    "delete": "Visitors arrive at a tram station between buildings and the museum entrance."
  },
  {
    "original_id": 2514,
    "original_sentence": "The work is anonymous, and there is speculation about the author's identity.",
    "lexical": "The piece is unattributed, prompting conjecture regarding who the author might be.",
    "shuffle": "There is speculation about the author's identity, and the work is anonymous.",
    "restructure": "Because the author is unknown, people have speculated about their identity.",
    "negation": "The work does not include a known author, leading to speculation.",
    "quantifier": "Much speculation surrounds the anonymous nature of the author’s identity.",
    "resemantic": "The author’s identity remains a mystery, sparking various theories.",
    "insert": "The work is completely anonymous, and as a result, there is ongoing speculation about who might have written it.",
    "delete": "The anonymous work has speculation about the author."
  },
  {
    "original_id": 1680,
    "original_sentence": "Heavy rotation or power rotation is a list of songs that get the most airplay on a radio station.",
    "lexical": "Heavy or power rotation refers to a playlist of tracks receiving maximum airplay on a radio station.",
    "shuffle": "A list of songs that get the most airplay on a radio station is called heavy or power rotation.",
    "restructure": "Songs that are played most often on a radio station are said to be in heavy rotation.",
    "negation": "Songs that are not in heavy rotation do not receive the most airplay.",
    "quantifier": "Many songs in heavy rotation get the most airplay on a given radio station.",
    "resemantic": "Heavy rotation includes songs that are frequently broadcast on the station.",
    "insert": "Heavy or power rotation is typically a curated list of songs that receive the most frequent airplay on a radio station.",
    "delete": "Power rotation is a list of songs with most airplay."
  },
  {
    "original_id": 2393,
    "original_sentence": "In the United States, about 2% of people have hepatitis C, with 35,000 to 185,000 new cases a year.",
    "lexical": "Roughly 2% of individuals in the U.S. are infected with hepatitis C, with an annual incidence ranging from 35,000 to 185,000.",
    "shuffle": "About 2% of people in the United States have hepatitis C, with 35,000 to 185,000 new cases yearly.",
    "restructure": "An estimated 2% of Americans are living with hepatitis C, and new infections number between 35,000 and 185,000 each year.",
    "negation": "It is not rare for new hepatitis C cases to appear in the U.S., with tens of thousands annually.",
    "quantifier": "A significant portion of the population—around 2%—has hepatitis C in the U.S.",
    "resemantic": "The prevalence of hepatitis C in the U.S. stands at 2%, with tens of thousands of new cases emerging annually.",
    "insert": "In the United States, approximately 2% of people currently have hepatitis C, with between 35,000 and 185,000 new infections occurring each year.",
    "delete": "About 2% of people in the U.S. have hepatitis C, with up to 185,000 new cases a year."
  },
  {
    "original_id": 1779,
    "original_sentence": "He is thought of as one of the most important architectural thinkers and urbanists of his generation.",
    "lexical": "He is regarded as a preeminent architectural theorist and city planner of his era.",
    "shuffle": "One of the most important architectural thinkers and urbanists of his generation is how he is thought of.",
    "restructure": "Many consider him to be among the foremost architectural thinkers and urban planners of his generation.",
    "negation": "He is not seen as an unimportant figure among architectural thinkers of his generation.",
    "quantifier": "Many regard him as one of the most significant architectural minds and urbanists of his generation.",
    "resemantic": "He is widely recognized for his impact on architecture and urban design in his time.",
    "insert": "He is widely thought of as one of the most important architectural thinkers and influential urbanists of his entire generation.",
    "delete": "He is considered an important architectural thinker of his generation."
  },
  {
    "original_id": 2207,
    "original_sentence": "Soaps and detergents help to spread the oils and dirt particles through the water, so they can be washed away.",
    "lexical": "Soaps and cleaning agents assist in dispersing oils and grime into water, allowing them to be rinsed off.",
    "shuffle": "To be washed away, soaps and detergents spread oils and dirt through the water.",
    "restructure": "Oils and dirt are dispersed into water by soaps and detergents, making them easier to remove.",
    "negation": "Without soaps and detergents, oils and dirt cannot easily be washed away in water.",
    "quantifier": "Most soaps and detergents help spread grime and oils so they can be removed by water.",
    "resemantic": "Cleaning agents work by breaking up oil and dirt, enabling water to remove them.",
    "insert": "Soaps and detergents effectively help to break down and spread the oils and dirt particles through the water, enabling them to be washed away more easily.",
    "delete": "Soaps spread oils and dirt so they can be washed away."
  },
  {
    "original_id": 826,
    "original_sentence": "Many species have five petals, often grown together.",
    "lexical": "Numerous species possess five conjoined petals.",
    "shuffle": "Five petals, often grown together, are present in many species.",
    "restructure": "In many species, the five petals are frequently fused.",
    "negation": "It is not unusual for species to have five fused petals.",
    "quantifier": "Most of these species have five petals that are typically joined.",
    "resemantic": "A number of plant species display five frequently united petals.",
    "insert": "Many flowering species have exactly five petals, which are often fused at the base.",
    "delete": "Many species have five joined petals."
  },
  {
    "original_id": 1839,
    "original_sentence": "The library has a chess room that houses a wide range of materials dedicated to the history, study and practice of chess.",
    "lexical": "The library contains a chess room that accommodates an extensive collection of resources devoted to the history, study, and practice of chess.",
    "shuffle": "A wide range of materials dedicated to the history, study and practice of chess is housed in the library's chess room.",
    "restructure": "Dedicated to chess history, study, and practice, a wide variety of materials are housed in the library’s chess room.",
    "negation": "It is not the case that the library lacks a chess room with materials on chess history and practice.",
    "quantifier": "The library has a chess room that holds numerous materials dedicated to the history, study, and practice of chess.",
    "resemantic": "The library includes a special room for chess, filled with resources related to its history, theory, and gameplay.",
    "insert": "The library features a well-equipped chess room that houses a wide range of materials meticulously dedicated to the history, study, and practice of chess.",
    "delete": "The library has a room with materials about the history and practice of chess."
  },
  {
    "original_id": 2596,
    "original_sentence": "No firm dates can be assigned to this Emperor's life or reign, but he is conventionally considered to have reigned from 498 to 506.",
    "lexical": "No definitive dates can be attributed to this Emperor's life or tenure, but he is customarily believed to have reigned from 498 to 506.",
    "shuffle": "He is conventionally considered to have reigned from 498 to 506, though no firm dates can be assigned to his life or reign.",
    "restructure": "Although the exact dates of this Emperor’s life and reign are uncertain, it is generally accepted that he ruled from 498 to 506.",
    "negation": "Firm dates cannot be positively established for this Emperor’s life or reign.",
    "quantifier": "Several approximate estimates exist, but no firm dates can be assigned to this Emperor's life or reign.",
    "resemantic": "The specific timeline of the Emperor’s rule remains unclear, though tradition holds it spanned from 498 to 506.",
    "insert": "Despite the historical ambiguity, no firm dates can be assigned to this Emperor's life or reign, although he is generally considered to have reigned from 498 to 506.",
    "delete": "No firm dates can be assigned to his reign, but it is thought to be from 498 to 506."
  },
  {
    "original_id": 1296,
    "original_sentence": "African elephants receive some legal protection in every country where they are found.",
    "lexical": "African elephants enjoy certain legal safeguards in each nation in which they reside.",
    "shuffle": "In every country where they are found, African elephants receive some legal protection.",
    "restructure": "Each country where African elephants live provides them with some form of legal protection.",
    "negation": "It is not true that African elephants lack legal protection in any country where they exist.",
    "quantifier": "Most countries where African elephants are found offer them some level of legal protection.",
    "resemantic": "Laws in all regions inhabited by African elephants offer some degree of protection.",
    "insert": "African elephants consistently receive at least some form of legal protection in every country where they are currently found.",
    "delete": "African elephants receive protection in each country they are found."
  },
  {
    "original_id": 1158,
    "original_sentence": "Butter cakes are often made by beating the butter and sugar until fluffy.",
    "lexical": "Butter cakes are frequently prepared by creaming butter and sugar until aerated.",
    "shuffle": "By beating the butter and sugar until fluffy, butter cakes are often made.",
    "restructure": "The typical method for making butter cakes involves whipping butter and sugar until the mixture becomes fluffy.",
    "negation": "It is not uncommon to beat butter and sugar until fluffy when making butter cakes.",
    "quantifier": "Many butter cakes are made by beating the butter and sugar until fluffy.",
    "resemantic": "Fluffy butter cakes are usually created by mixing sugar with butter until light and airy.",
    "insert": "Traditional butter cakes are often made by thoroughly beating the butter and sugar together until the mixture becomes light and fluffy.",
    "delete": "Butter cakes are made by beating butter and sugar."
  },
  {
    "original_id": 1983,
    "original_sentence": "Its relative major is E major, and its parallel major is C-sharp major.",
    "lexical": "Its corresponding major key is E major, while its tonal counterpart is C-sharp major.",
    "shuffle": "The relative major is E major, and the parallel major is C-sharp major.",
    "restructure": "The key has E major as its relative major and C-sharp major as its parallel major.",
    "negation": "It is not associated with any other major keys apart from E major and C-sharp major.",
    "quantifier": "Both E major and C-sharp major are among the key’s closely related major counterparts.",
    "resemantic": "The associated major keys are E major (relative) and C-sharp major (parallel).",
    "insert": "In music theory, its relative major is considered E major, and its parallel major is identified as C-sharp major.",
    "delete": "Its relative and parallel majors are E and C-sharp."
  },
  {
    "original_id": 2787,
    "original_sentence": "Some specific ministries/department are not allocated to anyone in the cabinet but the Prime Minister himself.",
    "lexical": "Certain designated ministries or departments remain under the direct oversight of the Prime Minister, rather than being assigned to other cabinet members.",
    "shuffle": "Ministries and departments are, in some cases, not allocated to anyone but the Prime Minister himself.",
    "restructure": "In some instances, ministries are retained by the Prime Minister instead of being distributed to cabinet members.",
    "negation": "Not all ministries are allocated to other members; some are kept by the Prime Minister.",
    "quantifier": "A few specific ministries are managed solely by the Prime Minister and not delegated to others.",
    "resemantic": "Some cabinet roles are held exclusively by the Prime Minister without further delegation.",
    "insert": "In some cases, specific ministries or departments remain unassigned to other cabinet members and are instead retained solely by the Prime Minister himself.",
    "delete": "Some ministries are not given to anyone except the Prime Minister."
  },
  {
    "original_id": 938,
    "original_sentence": "While these literary sources do not prove that the punishment still took place, they do provide evidence that it had not been forgotten.",
    "lexical": "Although these literary accounts fail to confirm the punishment’s continued use, they indicate it was still remembered.",
    "shuffle": "These sources do not prove the punishment continued, but they show it had not been forgotten.",
    "restructure": "Even if they don’t confirm the practice, the sources suggest the punishment remained part of cultural memory.",
    "negation": "These literary sources do not deny the punishment existed, though they don’t prove it was still occurring.",
    "quantifier": "Some literary sources suggest the punishment had not been forgotten, even if they don’t confirm its use.",
    "resemantic": "The texts don’t confirm ongoing use of the punishment but imply it remained in public awareness.",
    "insert": "Although these literary sources cannot conclusively demonstrate that the punishment persisted, they nonetheless provide compelling evidence that it was not forgotten.",
    "delete": "These sources don’t prove it still happened but show it wasn’t forgotten."
  },
  {
    "original_id": 121,
    "original_sentence": "I am a researcher in applied corpus linguistics.",
    "lexical": "I work as a scholar specializing in applied corpus linguistics.",
    "shuffle": "In applied corpus linguistics, I am a researcher.",
    "restructure": "As a researcher, I focus on applied corpus linguistics.",
    "negation": "I am not someone unfamiliar with applied corpus linguistics.",
    "quantifier": "I am one of several researchers working in applied corpus linguistics.",
    "resemantic": "My field of study involves applied corpus linguistics.",
    "insert": "I am currently employed as a researcher specializing in the field of applied corpus linguistics.",
    "delete": "I am a researcher in linguistics."
  },
  {
    "original_id": 1236,
    "original_sentence": "As of 2017, the books had collectively sold more than seven million copies, and appeared on numerous childrens' best-seller lists.",
    "lexical": "By 2017, the books had amassed sales exceeding seven million and featured on various children's bestseller lists.",
    "shuffle": "The books, by 2017, had sold over seven million copies and appeared on many bestseller lists for children.",
    "restructure": "More than seven million copies of the books had been sold by 2017, earning them spots on many children's bestseller lists.",
    "negation": "It is not true that the books failed to sell or gain recognition by 2017.",
    "quantifier": "A large number of these books had been sold—over seven million copies—and many were listed as bestsellers for children.",
    "resemantic": "By 2017, the series had reached over seven million in sales and was widely recognized among popular children’s books.",
    "insert": "As of the year 2017, the books had collectively sold in excess of seven million copies and had appeared on a wide range of children's best-seller lists.",
    "delete": "By 2017, the books sold seven million and were on best-seller lists."
  },
  {
    "original_id": 441,
    "original_sentence": "The majority of squid are no more than 60 cm long, although the giant squid may reach 13 m.",
    "lexical": "Most squid species measure under 60 cm in length, though the colossal squid can grow up to 13 meters.",
    "shuffle": "Although the giant squid may reach 13 m, the majority of squid are no more than 60 cm long.",
    "restructure": "While giant squid can grow to 13 meters, most squid are less than 60 centimeters in length.",
    "negation": "Not all squid are large; most do not exceed 60 cm in length.",
    "quantifier": "The vast majority of squid are shorter than 60 cm, though a few species may grow much longer.",
    "resemantic": "Squid vary greatly in size, with most being small but some like the giant squid reaching massive lengths.",
    "insert": "The vast majority of squid are relatively small, usually no longer than 60 cm, although species like the giant squid may grow to lengths of up to 13 meters.",
    "delete": "Most squid are under 60 cm, but giant ones may reach 13 m."
  },
  {
    "original_id": 1084,
    "original_sentence": "The head and thorax are white.",
    "lexical": "The head and thorax are alabaster.",
    "shuffle": "White are the head and thorax.",
    "restructure": "Both the head and the thorax exhibit a white coloration.",
    "negation": "The head and thorax are not colored any shade other than white.",
    "quantifier": "All visible parts, including the head and thorax, are white.",
    "resemantic": "The head and thorax are colored white.",
    "insert": "The head and thorax are pure white in appearance.",
    "delete": "The head and thorax are pale."
  },
  {
    "original_id": 438,
    "original_sentence": "Governments use different kinds of taxes and vary the tax rates.",
    "lexical": "Governments employ various forms of taxation and adjust the tax rates.",
    "shuffle": "Different kinds of taxes are used by governments, and the tax rates are varied.",
    "restructure": "To generate revenue, governments implement multiple tax types and adjust rates accordingly.",
    "negation": "Governments do not use a single type of tax or a fixed rate.",
    "quantifier": "Many governments use several kinds of taxes and frequently vary the rates.",
    "resemantic": "Governments apply multiple taxation methods and modify rates as needed.",
    "insert": "Governments typically use different kinds of taxes and periodically vary the tax rates to suit economic conditions.",
    "delete": "Governments use taxes and vary rates."
  },
  {
    "original_id": 1695,
    "original_sentence": "Bear is often called a hard science fiction author because he uses many scientific details in his work.",
    "lexical": "Bear is frequently referred to as a hard science fiction writer due to his incorporation of numerous scientific elements in his narratives.",
    "shuffle": "Because he uses many scientific details, Bear is often called a hard science fiction author.",
    "restructure": "Owing to his extensive use of scientific details, Bear is classified as a hard science fiction author.",
    "negation": "Bear is not considered a soft science fiction author, as he uses many scientific details.",
    "quantifier": "Most of Bear's works include enough scientific details for him to be considered a hard science fiction author.",
    "resemantic": "Bear is recognized for emphasizing scientific accuracy in his science fiction writing.",
    "insert": "Bear is widely regarded as a hard science fiction author, primarily because he frequently incorporates detailed scientific concepts into his work.",
    "delete": "Bear is called a hard science fiction author because of the science in his work."
  },
  {
    "original_id": 1887,
    "original_sentence": "Historic Scotland had direct responsibility for maintaining and running over 360 monuments in its care, about a quarter of which are manned and charge admission entry.",
    "lexical": "Historic Scotland oversaw the upkeep and administration of more than 360 heritage sites, roughly a quarter of which are staffed and require paid entry.",
    "shuffle": "About a quarter of the over 360 monuments Historic Scotland managed were manned and charged admission.",
    "restructure": "Of the 360+ monuments overseen by Historic Scotland, approximately one-fourth are staffed and require entry fees.",
    "negation": "Not all of the over 360 monuments cared for by Historic Scotland are unstaffed or free to enter.",
    "quantifier": "A significant number of the 360 monuments under Historic Scotland's care are manned and have entrance fees.",
    "resemantic": "Historic Scotland looked after hundreds of monuments, some of which are operated by staff and require payment for entry.",
    "insert": "Historic Scotland had direct administrative responsibility for maintaining and managing a collection of over 360 monuments, with approximately one quarter of them staffed and requiring an admission fee.",
    "delete": "Historic Scotland maintained over 360 monuments, some of which charge admission."
  },
  {
    "original_id": 1331,
    "original_sentence": "Following two major accidents in 2002 and 2003, one of the main issues in safety has been at the corner 130R.",
    "lexical": "After two significant incidents in 2002 and 2003, a primary safety concern has revolved around corner 130R.",
    "shuffle": "Corner 130R has been a major safety issue following serious accidents in 2002 and 2003.",
    "restructure": "Since the serious accidents in 2002 and 2003, safety concerns have focused on corner 130R.",
    "negation": "Safety at corner 130R has not been without issues after the 2002 and 2003 accidents.",
    "quantifier": "One of the major safety concerns after the two accidents has consistently been at corner 130R.",
    "resemantic": "Corner 130R has remained a focal point of safety discussions since the accidents in 2002 and 2003.",
    "insert": "Following two high-profile accidents in 2002 and 2003, safety discussions have increasingly centered around the notoriously dangerous corner 130R.",
    "delete": "After two accidents, a key safety issue is corner 130R."
  },
  {
    "original_id": 2132,
    "original_sentence": "The station's large hall was chosen because its dimensions are similar to 19th century concert halls, that is, it is shaped in the 'shoebox style'.",
    "lexical": "The expansive hall of the station was selected due to its resemblance in dimensions to 19th-century concert venues, specifically featuring a 'shoebox style' design.",
    "shuffle": "Because of its similar dimensions to 19th century concert halls, the station's large hall—shaped in the 'shoebox style'—was chosen.",
    "restructure": "Its shoebox-style proportions, resembling those of 19th-century concert halls, led to the selection of the station’s large hall.",
    "negation": "It wasn’t chosen randomly; the hall’s similarity to old concert halls made it a preferred choice.",
    "quantifier": "The hall was one of the few options with dimensions similar to most 19th century concert venues.",
    "resemantic": "The hall was selected for its acoustically favorable, traditional concert hall shape.",
    "insert": "The station’s notably large hall was ultimately selected due to its acoustic-friendly dimensions, which closely resemble those of traditional 19th-century concert venues in the 'shoebox style'.",
    "delete": "The station's hall was chosen due to its shoebox shape."
  },
  {
    "original_id": 1629,
    "original_sentence": "Nightingales are named so because they frequently sing at night as well as during the day.",
    "lexical": "Nightingales derive their name from their frequent nocturnal and diurnal singing.",
    "shuffle": "Because they sing both during the day and at night, nightingales are named accordingly.",
    "restructure": "The name 'nightingale' reflects their habit of singing both at night and during the daytime.",
    "negation": "It is not unusual for nightingales to sing at night, which is why they were named so.",
    "quantifier": "Many nightingales sing at night, which explains the origin of their name.",
    "resemantic": "The bird is called a nightingale due to its tendency to vocalize after dark and also by day.",
    "insert": "Nightingales, well known for their melodious vocalizations, are named because they sing frequently during both night and day.",
    "delete": "Nightingales are named because they sing at night."
  },
  {
    "original_id": 2681,
    "original_sentence": "Breckinridge ordered his field officers to make an inspection of the troops and to report back with the condition of his army.",
    "lexical": "Breckinridge instructed his field commanders to assess the troops and report the army’s condition.",
    "shuffle": "His field officers were ordered by Breckinridge to inspect the troops and report the army's condition.",
    "restructure": "To understand the state of his army, Breckinridge directed his officers to inspect the troops and report back.",
    "negation": "Breckinridge didn’t leave troop conditions unchecked; he ordered an inspection and a report.",
    "quantifier": "All field officers under Breckinridge were tasked with inspecting the troops and reporting back.",
    "resemantic": "To evaluate army readiness, Breckinridge told his officers to review the troops and provide updates.",
    "insert": "As part of his strategic review, Breckinridge ordered his field officers to conduct an inspection of the troops and deliver a full report on the army’s condition.",
    "delete": "Breckinridge ordered officers to inspect troops and report back."
  },
  {
    "original_id": 1713,
    "original_sentence": "Goaltenders are not permitted to serve as captains during games.",
    "lexical": "Goaltenders are prohibited from assuming the role of captain in official matches.",
    "shuffle": "During games, captains cannot be goaltenders.",
    "restructure": "Rules prevent goaltenders from being assigned the role of captain during games.",
    "negation": "Goaltenders are not allowed to take on the role of captain in matches.",
    "quantifier": "All goaltenders are barred from serving as captains in any game.",
    "resemantic": "Goalies are restricted from acting as team captains during gameplay.",
    "insert": "Under current regulations, goaltenders are explicitly not permitted to serve in the role of captain during games.",
    "delete": "Goalies can't be captains during games."
  },
  {
    "original_id": 1416,
    "original_sentence": "In addition, there are 19 associate members and one affiliate member.",
    "lexical": "Moreover, 19 associate members and a single affiliate member are included.",
    "shuffle": "There are 19 associate members and one affiliate member, in addition.",
    "restructure": "Besides the regular members, the group includes 19 associate members and one affiliate.",
    "negation": "It is not just full members; there are also associate and affiliate members.",
    "quantifier": "Several associate members—19 in total—and one affiliate member are present.",
    "resemantic": "There are additional members too: specifically 19 associates and one affiliate.",
    "insert": "In addition to full members, the organization comprises 19 associate members and one affiliate member.",
    "delete": "There are 19 associate and one affiliate member."
  },
  {
    "original_id": 2113,
    "original_sentence": "Roussimoff died in his sleep of congestive heart failure on the night of January 27 , 1993 , in a Paris hotel room.",
    "lexical": "Roussimoff passed away peacefully in his sleep due to congestive heart failure on the evening of January 27, 1993, in a hotel room in Paris.",
    "shuffle": "On the night of January 27, 1993, in a Paris hotel room, Roussimoff died in his sleep of congestive heart failure.",
    "restructure": "Congestive heart failure caused Roussimoff’s death while he was asleep in a Paris hotel on January 27, 1993.",
    "negation": "Roussimoff didn’t die while awake; he passed away in his sleep from congestive heart failure.",
    "quantifier": "That night, many remember that Roussimoff died in his sleep from congestive heart failure in Paris.",
    "resemantic": "Roussimoff succumbed to heart complications while sleeping in a hotel room in Paris on January 27, 1993.",
    "insert": "Roussimoff unfortunately died quietly in his sleep from congestive heart failure during the night of January 27, 1993, in a Paris hotel room.",
    "delete": "Roussimoff died in his sleep from heart failure on January 27, 1993."
  },
  {
    "original_id": 2392,
    "original_sentence": "Healthy gums usually have no reaction to normal disturbance such as brushing.",
    "lexical": "Healthy gums typically exhibit no response to routine disturbances like brushing.",
    "shuffle": "To normal disturbances such as brushing, healthy gums usually have no reaction.",
    "restructure": "There is generally no reaction from healthy gums when exposed to normal brushing.",
    "negation": "Healthy gums don’t usually react negatively to regular brushing.",
    "quantifier": "Most healthy gums do not react to everyday disturbances such as brushing.",
    "resemantic": "Brushing generally does not irritate healthy gums.",
    "insert": "Healthy gums, under usual conditions, typically have no visible reaction to regular activities such as brushing.",
    "delete": "Healthy gums have no reaction to brushing."
  },
  {
    "original_id": 2699,
    "original_sentence": "While the cause of the common cold has only been identified since the 1950s , the disease has been with humanity throughout history.",
    "lexical": "Although the origin of the common cold was only determined in the 1950s, the illness has afflicted humans for millennia.",
    "shuffle": "The disease has been with humanity throughout history, though the cause of the common cold was only identified in the 1950s.",
    "restructure": "The common cold has existed for ages, even though its cause was discovered only in the 1950s.",
    "negation": "The cause of the common cold wasn't known until the 1950s, but the illness itself has always been present.",
    "quantifier": "For many centuries, people have suffered from the common cold, even though its cause was only identified in the 1950s.",
    "resemantic": "Although scientists only discovered what causes the common cold in the 1950s, the sickness has long been a part of human history.",
    "insert": "Although the exact cause of the common cold was discovered only in the 1950s, this widespread illness has remained with humans across all historical eras.",
    "delete": "The cold has been around for ages, though the cause was identified in the 1950s."
  },
  {
    "original_id": 1146,
    "original_sentence": "For example , assume an investor had to choose between two stocks.",
    "lexical": "For instance, suppose an investor needed to select between two equities.",
    "shuffle": "Assume an investor, for example, had to choose between two stocks.",
    "restructure": "Take the case where an investor must decide between two different stocks.",
    "negation": "Let’s not assume the investor has unlimited options; rather, imagine they had to choose between just two stocks.",
    "quantifier": "An investor may often need to choose between two or more stocks.",
    "resemantic": "Imagine an investor faced with a decision involving two stocks.",
    "insert": "For example, let us assume that a hypothetical investor must make a decision between purchasing two different stocks.",
    "delete": "Assume an investor must choose between two stocks."
  },
  {
    "original_id": 1736,
    "original_sentence": "During the Spanish Civil War he left his work to be in theater as an amateur actor.",
    "lexical": "He abandoned his occupation during the Spanish Civil War to pursue theater as a non-professional performer.",
    "shuffle": "He left his work during the Spanish Civil War to be in theater as an amateur actor.",
    "restructure": "He joined the theater as an amateur actor, leaving his job behind during the Spanish Civil War.",
    "negation": "He didn’t continue working during the Spanish Civil War, opting instead to act in theater.",
    "quantifier": "Like many others, he left his job during the Spanish Civil War to act in theater.",
    "resemantic": "He gave up his job during the Spanish Civil War to act on stage without formal training.",
    "insert": "During the intense period of the Spanish Civil War, he chose to leave his profession behind and participate in theater as a passionate amateur actor.",
    "delete": "He left work during the war to act in theater."
  },
  {
    "original_id": 2695,
    "original_sentence": "No firm dates can be assigned to this Emperor 's life or reign , but he is conventionally considered to have reigned from 480 to 484.",
    "lexical": "Precise dates cannot be conclusively attributed to this Emperor’s life or rule, though it is generally accepted that he reigned from 480 to 484.",
    "shuffle": "This Emperor is conventionally thought to have reigned from 480 to 484, though no firm dates are known.",
    "restructure": "Although the exact dates are unclear, the Emperor is traditionally believed to have ruled between 480 and 484.",
    "negation": "There aren’t any definitive dates for this Emperor’s rule, but he’s generally believed to have reigned from 480 to 484.",
    "quantifier": "Some historians agree that he ruled approximately from 480 to 484, although no exact dates are known.",
    "resemantic": "Though his timeline is uncertain, scholars typically assign his reign to the years 480–484.",
    "insert": "While no specific dates can be confidently assigned to the life or reign of this Emperor, it is generally accepted in academic circles that he ruled between 480 and 484.",
    "delete": "No firm dates exist, but he likely reigned from 480 to 484."
  },
  {
    "original_id": 1308,
    "original_sentence": "Blankets may also be used on the ground for a picnic or other places where people want to sit without their clothing getting dirty or wet.",
    "lexical": "Blankets can additionally serve as ground coverings for picnics or settings where individuals wish to avoid soiling or wetting their clothes.",
    "shuffle": "For a picnic or in areas where people want to stay clean and dry, blankets may also be used on the ground.",
    "restructure": "To keep clothing clean and dry, people may lay blankets on the ground during picnics or similar occasions.",
    "negation": "People don't usually want to sit on the bare ground, so they may use blankets to avoid getting dirty or wet.",
    "quantifier": "In many outdoor settings, blankets are used by people to sit without dirtying or wetting their clothes.",
    "resemantic": "People often lay out blankets to stay clean and dry while sitting outdoors, especially during picnics.",
    "insert": "Blankets may also commonly be spread on the ground during picnics or in any other outdoor area where individuals prefer not to get their clothing dirty or wet.",
    "delete": "Blankets may be used on the ground to sit without getting dirty."
  },
  {
    "original_id": 1662,
    "original_sentence": "Today Trailways members are spread across North America.",
    "lexical": "Currently, Trailways affiliates are dispersed throughout North America.",
    "shuffle": "Trailways members are spread across North America today.",
    "restructure": "Trailways has members located in various parts of North America at present.",
    "negation": "Trailways members are not limited to one location; they’re spread across North America.",
    "quantifier": "Most Trailways members today can be found throughout North America.",
    "resemantic": "Trailways now has member organizations located all over North America.",
    "insert": "Today, Trailways members are widely spread throughout many regions of North America.",
    "delete": "Trailways members are across North America."
  },
  {
    "original_id": 1751,
    "original_sentence": "Certain networks have made changes to prevent them from being used by such multi-network IM clients.",
    "lexical": "Some networks have implemented modifications to block access by multi-protocol instant messaging clients.",
    "shuffle": "To prevent usage by multi-network IM clients, certain networks have made changes.",
    "restructure": "To block multi-network IM clients, specific networks have modified their systems.",
    "negation": "Certain networks no longer allow multi-network IM clients due to recent changes.",
    "quantifier": "Several networks have made adjustments to restrict usage by multi-network IM clients.",
    "resemantic": "Networks have acted to block cross-platform instant messaging tools.",
    "insert": "In response to compatibility issues, certain networks have proactively made changes to stop multi-network IM clients from accessing their services.",
    "delete": "Networks made changes to block multi-network IM clients."
  },
  {
    "original_id": 1816,
    "original_sentence": "Naming a child after a relative , friend , or well - known person is a common practice in the English -speaking world.",
    "lexical": "In English-speaking cultures, it is customary to name a child after a family member, acquaintance, or prominent figure.",
    "shuffle": "A common practice in the English-speaking world is naming a child after a friend, relative, or well-known person.",
    "restructure": "It is traditional in English-speaking countries to name children after relatives, friends, or famous individuals.",
    "negation": "It’s not unusual in English-speaking societies to name children after familiar or renowned people.",
    "quantifier": "Many people in English-speaking areas name their children after someone they know or admire.",
    "resemantic": "English-speaking cultures often reuse names from family, friends, or public figures for children.",
    "insert": "In the English-speaking world, it is quite common to name a child after someone important, such as a relative, close friend, or a notable public figure.",
    "delete": "Naming children after others is common in English-speaking cultures."
  },
  {
    "original_id": 631,
    "original_sentence": "All- female bands are not restricted by mainstream genres.",
    "lexical": "All-female ensembles are not confined to conventional music categories.",
    "shuffle": "Mainstream genres do not restrict all-female bands.",
    "restructure": "All-female bands can play across various genres and are not limited to mainstream styles.",
    "negation": "All-female bands do not have to stick only to mainstream genres.",
    "quantifier": "Many all-female bands are not restricted by mainstream genres.",
    "resemantic": "All-female bands often explore diverse musical styles beyond the mainstream.",
    "insert": "All-female bands, unlike some of their counterparts, are not strictly limited by traditional mainstream genres.",
    "delete": "All-female bands are not limited by genres."
  },
  {
    "original_id": 2220,
    "original_sentence": "Performance improvements are sometimes delivered via WAFS or WAN optimization.",
    "lexical": "Enhancements in performance are occasionally achieved through WAFS or WAN optimization.",
    "shuffle": "Sometimes, performance improvements are delivered via WAN optimization or WAFS.",
    "restructure": "WAFS or WAN optimization can sometimes be used to enhance performance.",
    "negation": "Performance improvements are not always delivered without using WAFS or WAN optimization.",
    "quantifier": "Some performance improvements are delivered through WAN optimization or WAFS.",
    "resemantic": "Network acceleration technologies like WAFS or WAN optimization may boost performance.",
    "insert": "In enterprise networks, performance improvements are sometimes delivered via specialized tools such as WAFS or WAN optimization.",
    "delete": "Performance is sometimes improved by WAN optimization."
  },
  {
    "original_id": 1053,
    "original_sentence": "Some serious nuclear accidents have occurred.",
    "lexical": "Several significant nuclear incidents have taken place.",
    "shuffle": "Serious nuclear accidents have occurred at times.",
    "restructure": "There have been occurrences of serious nuclear accidents.",
    "negation": "It is not true that no serious nuclear accidents have occurred.",
    "quantifier": "A few serious nuclear accidents have occurred over the years.",
    "resemantic": "There have been instances of major nuclear disasters.",
    "insert": "Throughout history, some very serious nuclear accidents have unfortunately occurred.",
    "delete": "Serious nuclear accidents have happened."
  },
  {
    "original_id": 508,
    "original_sentence": "Bird banders have found that only 25 % of juvenile American robins live through their first year.",
    "lexical": "Ornithologists have determined that merely a quarter of young American robins survive their initial year.",
    "shuffle": "Only 25% of juvenile American robins live through their first year, bird banders have found.",
    "restructure": "According to bird banders, just 25% of juvenile American robins survive their first year.",
    "negation": "It is not the case that most juvenile American robins live through their first year.",
    "quantifier": "Roughly one in four juvenile American robins survive their first year.",
    "resemantic": "Bird tagging studies show that many juvenile robins do not survive their first year.",
    "insert": "Extensive studies by bird banders have shown that only about 25% of juvenile American robins manage to survive their first year of life.",
    "delete": "Only 25% of juvenile robins survive their first year."
  },
  {
    "original_id": 2010,
    "original_sentence": "Before the unification of Egypt, the land was settled with autonomous villages.",
    "lexical": "Prior to Egypt’s unification, the region was inhabited by self-governing villages.",
    "shuffle": "The land was settled with autonomous villages before the unification of Egypt.",
    "restructure": "Autonomous villages populated the land before Egypt became unified.",
    "negation": "The land wasn’t unpopulated before Egypt’s unification—it was home to autonomous villages.",
    "quantifier": "Many autonomous villages existed before Egypt was unified.",
    "resemantic": "Independent communities inhabited Egypt before its political unification.",
    "insert": "Long before the unification of Egypt, the territory was already populated with a network of small, autonomous villages.",
    "delete": "Before Egypt united, autonomous villages settled the land."
  },
  {
    "original_id": 2757,
    "original_sentence": "One of the primary industries in the town is tourism, most notably scuba diving.",
    "lexical": "A major sector of the town’s economy is tourism, particularly scuba diving.",
    "shuffle": "Scuba diving, most notably, is one of the main tourism industries in the town.",
    "restructure": "Tourism, with scuba diving being the most prominent activity, is a major industry in the town.",
    "negation": "It is not uncommon for scuba diving to be the main tourist attraction in the town.",
    "quantifier": "Many townspeople rely on tourism, especially scuba diving, as a key industry.",
    "resemantic": "The town depends heavily on tourism, especially activities like scuba diving.",
    "insert": "In this coastal town, one of the leading economic drivers is tourism, with scuba diving standing out as the most prominent attraction.",
    "delete": "Scuba diving is a key part of the tourism industry in the town."
  },
  {
    "original_id": 1949,
    "original_sentence": "The yellow flowers of the plant produce hairy seed pods, with each pod containing roughly a half dozen seeds.",
    "lexical": "The plant’s yellow blossoms yield fuzzy seed pods, each bearing about six seeds.",
    "shuffle": "Each pod, containing about six seeds, is produced by the plant’s yellow flowers.",
    "restructure": "Yellow flowers on the plant generate seed pods covered in hairs, each holding approximately six seeds.",
    "negation": "The seed pods are not smooth—they’re hairy and contain several seeds each.",
    "quantifier": "Most of the seed pods contain around six seeds each.",
    "resemantic": "Hairy pods develop from the yellow flowers, with each pod holding a handful of seeds.",
    "insert": "The vibrant yellow flowers of the plant typically develop into hairy seed pods, each carrying approximately half a dozen seeds.",
    "delete": "The yellow flowers produce seed pods with around six seeds."
  },
  {
    "original_id": 1241,
    "original_sentence": "Music and sport are the only fields that largely fall outside the station's remit.",
    "lexical": "Music and athletics are among the few areas not extensively covered by the station’s mandate.",
    "shuffle": "The station’s remit largely excludes the fields of music and sport.",
    "restructure": "The station’s responsibilities generally do not include music and sport.",
    "negation": "The station’s remit doesn’t typically include music or sport.",
    "quantifier": "Most content areas fall under the station’s remit, except for music and sport.",
    "resemantic": "The station generally avoids programming focused on music or athletics.",
    "insert": "Music and sport, unlike most other areas, are the only fields that fall significantly outside the scope of the station’s responsibilities.",
    "delete": "Music and sport fall outside the station’s remit."
  },
  {
    "original_id": 2085,
    "original_sentence": "The English text comprises 108,260 words and is divided into two parts, each reading as a continuous narrative with no chapter divisions.",
    "lexical": "The English manuscript contains 108,260 words and is split into two sections, each flowing without chapter breaks.",
    "shuffle": "Divided into two parts, the English text includes 108,260 words and has no chapter breaks.",
    "restructure": "With no chapter divisions, the 108,260-word English text is split into two continuous narrative parts.",
    "negation": "The English text does not include any chapter divisions despite its length of 108,260 words.",
    "quantifier": "Each of the two parts of the English text, totaling 108,260 words, reads continuously without chapters.",
    "resemantic": "The English version contains over 108,000 words arranged in two flowing segments without any chapter separations.",
    "insert": "The English text, which consists of precisely 108,260 words, is organized into two flowing parts that read continuously without chapter breaks.",
    "delete": "The English text has 108,260 words and no chapters."
  },
  {
    "original_id": 2547,
    "original_sentence": "No firm dates can be assigned to this Emperor's life or reign, but he is conventionally considered to have reigned from 406 CE to 410 CE.",
    "lexical": "Definitive dates are elusive for this Emperor’s life and rule, yet scholars generally agree he ruled from 406 to 410 CE.",
    "shuffle": "Although no firm dates are known, this Emperor is conventionally thought to have ruled from 406 to 410 CE.",
    "restructure": "The exact timeline of this Emperor’s life and reign is unclear, but historical consensus places his rule between 406 and 410 CE.",
    "negation": "Firm dates cannot be assigned, but it’s not disputed that he likely reigned from 406 to 410 CE.",
    "quantifier": "Several historians conventionally consider his reign to have spanned from 406 to 410 CE.",
    "resemantic": "Though the exact years remain unknown, it is generally assumed this Emperor ruled during the early 5th century CE.",
    "insert": "Although historians cannot determine precise dates, it is widely accepted that this Emperor reigned from 406 CE to 410 CE.",
    "delete": "The Emperor is considered to have ruled from 406 to 410 CE."
  },
  {
    "original_id": 2589,
    "original_sentence": "The eastern border of the province corresponds to the western side of the Maas, which originates in France.",
    "lexical": "The eastern boundary of the province aligns with the western bank of the Maas, which begins in France.",
    "shuffle": "The province's eastern border corresponds to the Maas's western side, which originates in France.",
    "restructure": "Originating in France, the Maas forms the western edge that defines the province's eastern border.",
    "negation": "The eastern border of the province does not differ from the western side of the Maas, which starts in France.",
    "quantifier": "Much of the eastern border of the province corresponds to the western side of the Maas.",
    "resemantic": "The province's eastern edge follows the western course of the Maas River, which has its source in France.",
    "insert": "The eastern border of the province precisely corresponds to the western side of the Maas, which notably originates in France.",
    "delete": "The eastern border of the province aligns with the western side of the Maas."
  },
  {
    "original_id": 541,
    "original_sentence": "Perspective drawings have a horizon line, which is often implied.",
    "lexical": "Perspective illustrations include a horizon line, frequently suggested rather than shown.",
    "shuffle": "A horizon line, which is often implied, is part of perspective drawings.",
    "restructure": "In perspective drawings, a horizon line is typically present, though not always explicitly visible.",
    "negation": "Perspective drawings don't necessarily omit a horizon line—it is often just implied.",
    "quantifier": "Most perspective drawings have a horizon line that is often implied.",
    "resemantic": "Horizon lines are commonly suggested in perspective sketches.",
    "insert": "In most perspective drawings, there is a horizon line, which is usually implied rather than drawn explicitly.",
    "delete": "Perspective drawings often have an implied horizon line."
  },
  {
    "original_id": 745,
    "original_sentence": "This phrase is British in origin and derives from sports that use goalposts.",
    "lexical": "This expression hails from Britain and stems from goal-based sports.",
    "shuffle": "British in origin, this phrase comes from sports that use goalposts.",
    "restructure": "Originating in Britain, this phrase is rooted in goalpost-based sports.",
    "negation": "This phrase isn’t unrelated to sports—it comes from games involving goalposts.",
    "quantifier": "Many phrases of British origin, including this one, derive from sports involving goalposts.",
    "resemantic": "The phrase traces back to British sports that involve scoring with goalposts.",
    "insert": "This particular phrase is of British origin, specifically deriving from competitive sports that involve goalposts.",
    "delete": "This British phrase derives from sports with goalposts."
  },
  {
    "original_id": 888,
    "original_sentence": "This species is blue-green to green in color and commonly grows to approximately 46 cm.",
    "lexical": "This species displays a turquoise to green coloration and typically reaches about 46 cm in length.",
    "shuffle": "Blue-green to green in color, this species commonly grows to around 46 cm.",
    "restructure": "The species, which ranges in color from blue-green to green, usually grows to about 46 cm.",
    "negation": "It is not unusual for this species to grow to about 46 cm and exhibit greenish hues.",
    "quantifier": "Most individuals of this species grow to about 46 cm and have greenish coloring.",
    "resemantic": "This organism is typically green-toned and grows to nearly half a meter.",
    "insert": "This aquatic species is blue-green to green in color and usually grows to a length of approximately 46 cm in adulthood.",
    "delete": "This species is green and grows to about 46 cm."
  },
  {
    "original_id": 1765,
    "original_sentence": "In the knockout phase, teams play against each other over two legs on a home-and-away basis, except for the one-match final.",
    "lexical": "During the elimination round, teams compete in two-legged ties, home and away, except for the single final match.",
    "shuffle": "Teams play on a home-and-away basis over two legs in the knockout phase, with the final being a single match.",
    "restructure": "The knockout phase involves home-and-away fixtures, with the final played as a single match.",
    "negation": "The final is not played over two legs, unlike earlier rounds in the knockout phase.",
    "quantifier": "Most matches in the knockout phase are played over two legs, excluding the final.",
    "resemantic": "In elimination rounds, teams face off twice at home and away, while the championship is decided in one game.",
    "insert": "In the tournament's knockout phase, teams generally compete over two legs, with one home and one away match, apart from the final which is played as a single decisive game.",
    "delete": "In the knockout phase, teams play two legs except for the final."
  },
  {
    "original_id": 1518,
    "original_sentence": "Birdsong died on June 4, 2019, as a result of injuries sustained in a car crash.",
    "lexical": "Birdsong passed away on June 4, 2019, due to trauma sustained in a vehicular accident.",
    "shuffle": "On June 4, 2019, Birdsong died due to injuries from a car crash.",
    "restructure": "Injuries from a car accident led to Birdsong’s death on June 4, 2019.",
    "negation": "Birdsong did not survive the car crash injuries sustained before June 4, 2019.",
    "quantifier": "Fatal accidents like the one that caused Birdsong’s death on June 4, 2019, are not uncommon.",
    "resemantic": "Birdsong lost his life on June 4, 2019, following a severe automobile accident.",
    "insert": "Birdsong tragically died on June 4, 2019, following serious injuries sustained in a devastating car crash.",
    "delete": "Birdsong died on June 4, 2019, from crash injuries."
  },
  {
    "original_id": 1111,
    "original_sentence": "The A $32 million first phase of a major upgrade began in 2010 and is expected to be completed during 2015.",
    "lexical": "The initial $32 million phase of a significant enhancement project commenced in 2010 and was projected to finish in 2015.",
    "shuffle": "A major $32 million upgrade started in 2010 and was expected to conclude in 2015.",
    "restructure": "Starting in 2010, the first phase of the $32 million upgrade was set for completion in 2015.",
    "negation": "The upgrade wasn’t expected to be finished before 2015.",
    "quantifier": "The first of several phases, costing $32 million, began in 2010 with a planned 2015 completion.",
    "resemantic": "A major infrastructure overhaul, valued at A$32 million, kicked off in 2010 and aimed for 2015 completion.",
    "insert": "The A$32 million first phase of the comprehensive upgrade initiative was launched in 2010 and anticipated to conclude by 2015.",
    "delete": "A $32 million upgrade phase began in 2010 and was due by 2015."
  },
  {
    "original_id": 2262,
    "original_sentence": "The hosts were only announced after the qualifying round, which meant all teams had to participate in the qualification process for the final stage.",
    "lexical": "The host nations were disclosed post-qualification, necessitating all teams to undergo the selection process for the final round.",
    "shuffle": "All teams had to qualify since the hosts were announced only after the qualifying round.",
    "restructure": "Because the hosts weren’t revealed until after qualifying, every team had to go through the process.",
    "negation": "No team was exempt from qualification, since the hosts weren't announced early.",
    "quantifier": "Every single team, including eventual hosts, had to go through the qualifying stage.",
    "resemantic": "As the organizers were revealed late, all teams needed to compete in the qualifiers.",
    "insert": "Due to the decision to announce the hosts only after the qualifying round, every team was required to take part in the qualification process for the final stage.",
    "delete": "Hosts were named after qualifying, so all teams had to qualify."
  },
  {
    "original_id": 2744,
    "original_sentence": "In the knockout stage, teams play against each other over two legs on a home-and-away basis, except for the one-match final.",
    "lexical": "During the elimination stage, teams engage in two-legged encounters, one home and one away, with the final being a single match.",
    "shuffle": "Teams play two-leg matches home and away in the knockout stage, except for the final which is just one match.",
    "restructure": "The knockout phase involves home and away games between teams, except the final, which is only one match.",
    "negation": "The final is not played over two legs like other knockout games.",
    "quantifier": "Almost all knockout games are played over two legs, excluding the final.",
    "resemantic": "The format includes two-leg ties in knockout rounds, except a standalone final game.",
    "insert": "In the tournament’s knockout stage, teams usually face each other in two legs—one at home and one away—except the final, which is played in a single match format.",
    "delete": "Knockout stage matches are two-legged, except the final."
  },
  {
    "original_id": 2192,
    "original_sentence": "Most species of the sea snakes are able to respire through the top of their skin.",
    "lexical": "Many sea snake species are capable of breathing through the dorsal surface of their skin.",
    "shuffle": "Sea snakes, most species of them, can respire through their skin's top layer.",
    "restructure": "Respiration in sea snakes is often done through the upper skin layer in most species.",
    "negation": "It is not uncommon for sea snakes to breathe through their skin.",
    "quantifier": "A majority of sea snake species respire via the skin's upper surface.",
    "resemantic": "Sea snakes typically absorb oxygen through the top layer of their skin.",
    "insert": "Most sea snake species have developed the ability to respire through the top portion of their permeable skin.",
    "delete": "Most sea snakes can breathe through their skin."
  },
  {
    "original_id": 408,
    "original_sentence": "Give your urine sample to the lab technician.",
    "lexical": "Submit your urine specimen to the laboratory technician.",
    "shuffle": "To the lab technician, give your urine sample.",
    "restructure": "The lab technician should receive your urine sample.",
    "negation": "Don’t forget to give your urine sample to the lab technician.",
    "quantifier": "Every patient should give their urine sample to the lab technician.",
    "resemantic": "Hand over your urine sample to the technician in the laboratory.",
    "insert": "Kindly give your urine sample to the assigned lab technician upon arrival.",
    "delete": "Give your sample to the technician."
  },
  {
    "original_id": 2153,
    "original_sentence": "During the day amphiumas hide in plants.",
    "lexical": "In daylight, amphiumas conceal themselves within vegetation.",
    "shuffle": "Amphiumas hide in plants during the day.",
    "restructure": "Plants serve as hiding places for amphiumas during the daytime.",
    "negation": "Amphiumas don’t remain visible in plants during the day.",
    "quantifier": "Most amphiumas hide in plants during the day.",
    "resemantic": "Amphiumas seek cover in greenery when the sun is out.",
    "insert": "During the day, amphiumas typically hide quietly in thick aquatic plants.",
    "delete": "Amphiumas hide in plants during the day."
  },
  {
    "original_id": 2500,
    "original_sentence": "Producing a stop-motion animation using clay is extremely laborious.",
    "lexical": "Creating a stop-motion animation with clay is highly arduous.",
    "shuffle": "Using clay to produce stop-motion animation is extremely laborious.",
    "restructure": "Clay-based stop-motion animation production requires immense effort.",
    "negation": "Producing clay stop-motion animation isn’t a simple task.",
    "quantifier": "Most stop-motion animations using clay are extremely laborious to produce.",
    "resemantic": "Making a stop-motion film with clay demands significant effort and time.",
    "insert": "Producing a detailed stop-motion animation using clay is an extremely labor-intensive process.",
    "delete": "Making clay stop-motion animation is laborious."
  },
  {
    "original_id": 907,
    "original_sentence": "After World War II, the countries in Europe wanted to live peacefully together and help one another's economies.",
    "lexical": "Following World War II, European nations aimed to coexist harmoniously and support each other's economies.",
    "shuffle": "European countries wanted to help one another's economies and live peacefully together after World War II.",
    "restructure": "The desire to cooperate economically and live in peace emerged among European nations after World War II.",
    "negation": "After World War II, European countries no longer wished to remain divided or hostile.",
    "quantifier": "Many countries in Europe wanted peaceful coexistence and economic cooperation after World War II.",
    "resemantic": "Post-WWII, European nations sought unity and mutual economic assistance.",
    "insert": "In the aftermath of World War II, most European countries expressed a strong desire to coexist peacefully and bolster each other’s economies.",
    "delete": "After World War II, Europe wanted peace and cooperation."
  },
  {
    "original_id": 1544,
    "original_sentence": "Architecture is the art and science of designing buildings and structures.",
    "lexical": "Architecture constitutes the discipline and aesthetics involved in crafting edifices and frameworks.",
    "shuffle": "The art and science of designing buildings and structures is called architecture.",
    "restructure": "Designing buildings and structures involves both art and science and is known as architecture.",
    "negation": "Architecture is not just art—it is also the science of design.",
    "quantifier": "All forms of architecture involve both artistic and scientific elements in designing buildings.",
    "resemantic": "Architecture blends creativity and technical skill to design functional and aesthetic structures.",
    "insert": "Architecture is both the expressive art and technical science of thoughtfully designing buildings and physical structures.",
    "delete": "Architecture is the design of buildings and structures."
  },
  {
    "original_id": 1952,
    "original_sentence": "A common-use facility or terminal design disallows airlines to have its own proprietary check-in counters, gates and IT systems.",
    "lexical": "A shared-use terminal setup prohibits airlines from maintaining exclusive check-in stations, boarding gates, and digital systems.",
    "shuffle": "Terminal designs for common use do not allow airlines to have proprietary counters, gates, and IT systems.",
    "restructure": "In a common-use facility, airlines are not permitted to operate their own check-in areas, gates, or information technology systems.",
    "negation": "Airlines are not allowed to operate proprietary systems in a common-use terminal.",
    "quantifier": "Most common-use terminals prevent airlines from having exclusive check-in counters and systems.",
    "resemantic": "Shared terminal models restrict airlines from deploying their own check-in and gate infrastructure.",
    "insert": "A common-use terminal design generally prohibits individual airlines from maintaining their exclusive check-in counters, gates, and IT platforms.",
    "delete": "A common-use terminal disallows airlines' proprietary systems."
  },
  {
    "original_id": 1282,
    "original_sentence": "Costa Rica developed high literacy rates and education levels.",
    "lexical": "Costa Rica achieved elevated levels of literacy and educational attainment.",
    "shuffle": "High literacy rates and education levels were developed by Costa Rica.",
    "restructure": "The country of Costa Rica has made significant strides in both literacy and education.",
    "negation": "Costa Rica did not lag behind in improving literacy and education.",
    "quantifier": "Many citizens in Costa Rica benefit from high literacy rates and education levels.",
    "resemantic": "Costa Rica has made major progress in education and public literacy.",
    "insert": "Over the years, Costa Rica has steadily developed impressively high literacy rates and education standards.",
    "delete": "Costa Rica developed literacy and education."
  },
  {
    "original_id": 2517,
    "original_sentence": "Short's unsolved murder and the details surrounding it have had caused many theories and public speculation.",
    "lexical": "Short's unresolved homicide and its surrounding circumstances have generated numerous hypotheses and widespread speculation.",
    "shuffle": "The unsolved murder of Short and its details have caused public speculation and many theories.",
    "restructure": "Due to the mystery of Short’s murder, many theories and much speculation have arisen.",
    "negation": "Short’s unsolved murder hasn’t stopped theories and speculation from emerging.",
    "quantifier": "Numerous theories and a lot of speculation have arisen from Short’s unsolved murder.",
    "resemantic": "The mystery of Short’s death has fueled endless rumors and theories among the public.",
    "insert": "Short’s highly publicized and unsolved murder, along with its mysterious details, has sparked countless theories and widespread public speculation.",
    "delete": "Short's unsolved murder caused speculation."
  },
  {
    "original_id": 1837,
    "original_sentence": "Throughout the campus, many fountains provide white noise as a background.",
    "lexical": "Across the university grounds, numerous fountains emit ambient white noise.",
    "shuffle": "Many fountains throughout the campus provide background white noise.",
    "restructure": "Fountains situated across the campus generate white noise for ambient effect.",
    "negation": "It’s not uncommon for fountains across campus to emit white noise in the background.",
    "quantifier": "Most areas of the campus are surrounded by fountains that offer white noise.",
    "resemantic": "Fountains scattered around campus generate soothing ambient sounds.",
    "insert": "Throughout the campus, a large number of ornamental fountains gently provide white noise to enrich the background atmosphere.",
    "delete": "Fountains provide background noise on campus."
  },
  {
    "original_id": 113,
    "original_sentence": "There is probably titanium in your eyeglass frames.",
    "lexical": "Your eyeglass frames likely contain titanium.",
    "shuffle": "Titanium is probably in your eyeglass frames.",
    "restructure": "It is likely that titanium is a component of your eyeglass frames.",
    "negation": "It’s not unlikely that titanium is present in your eyeglass frames.",
    "quantifier": "Many eyeglass frames probably include some amount of titanium.",
    "resemantic": "Your glasses may be made with durable materials such as titanium.",
    "insert": "There is a strong possibility that lightweight and durable titanium is used in your eyeglass frames.",
    "delete": "Titanium is probably in your frames."
  },
  {
    "original_id": 480,
    "original_sentence": "Otherwise, companies in France was looking for graduated students with specialized skills, for jobs in key sectors.",
    "lexical": "Otherwise, enterprises in France were seeking alumni with expertise, for employment in critical sectors.",
    "shuffle": "Companies in France, otherwise, were looking for graduated students with specialized skills for key sector jobs.",
    "restructure": "Graduated students with specialized skills were being sought by companies in France for key sector jobs.",
    "negation": "Otherwise, it wasn’t uncommon for companies in France to seek graduates with specialized skills.",
    "quantifier": "Many companies in France were looking for graduated students with specialized skills for roles in key sectors.",
    "resemantic": "French firms were searching for graduates who possessed particular expertise for important industry roles.",
    "insert": "Otherwise, numerous companies in France were actively looking for recently graduated students with highly specialized skills for jobs in vital sectors.",
    "delete": "Companies in France were looking for skilled graduates for key jobs."
  },
  {
    "original_id": 1677,
    "original_sentence": "Many cultures do have an oral law, while most legal systems of today have a formal written organization.",
    "lexical": "Numerous societies possess oral jurisprudence, whereas the majority of contemporary legal systems feature a codified structure.",
    "shuffle": "While most of today’s legal systems have a formal written organization, many cultures do have an oral law.",
    "restructure": "Though today’s legal systems are typically written and formal, many cultures still maintain oral traditions of law.",
    "negation": "Most modern legal systems aren’t based on oral law, unlike many cultures.",
    "quantifier": "Several cultures maintain an oral law, while most legal systems today are formally documented.",
    "resemantic": "Some societies rely on spoken legal traditions, but modern systems are usually codified and structured.",
    "insert": "Many traditional cultures do still preserve an oral law, although the majority of legal systems in the modern world are formally and systematically written.",
    "delete": "Many cultures have oral law, while modern legal systems are written."
  },
  {
    "original_id": 2374,
    "original_sentence": "The Romans adopted the Greek tradition, writing at first in Greek, but eventually chronicling their history in a freshly non-Greek language.",
    "lexical": "The Romans embraced the Hellenic tradition, initially composing in Greek, but later documenting their history in a newly adopted language.",
    "shuffle": "Writing at first in Greek, the Romans adopted the Greek tradition but eventually chronicled their history in a different language.",
    "restructure": "Initially writing in Greek, the Romans eventually shifted to recording their history in their own language.",
    "negation": "The Romans didn’t continue to write solely in Greek; they eventually used their own language.",
    "quantifier": "Most Roman historians started in Greek before moving to a non-Greek language.",
    "resemantic": "Romans began their historical writings in Greek, later transitioning to a distinct Roman tongue.",
    "insert": "The Romans gradually adopted the Greek tradition, first composing texts in Greek before eventually recording their historical accounts in a newly emerged non-Greek language.",
    "delete": "The Romans adopted Greek writing, then used another language."
  },
  {
    "original_id": 1642,
    "original_sentence": "Eucalypts draw a very large amount of water from the soil.",
    "lexical": "Eucalypts extract a substantial volume of moisture from the earth.",
    "shuffle": "From the soil, eucalypts draw a very large amount of water.",
    "restructure": "A significant quantity of water is absorbed from the soil by eucalypts.",
    "negation": "Eucalypts do not draw only a small amount of water from the soil.",
    "quantifier": "Most eucalypts draw large amounts of water from the soil.",
    "resemantic": "Eucalypt trees consume vast quantities of underground moisture.",
    "insert": "Eucalypts tend to draw a remarkably large amount of water from the soil, especially in dry conditions.",
    "delete": "Eucalypts draw a lot of water from the soil."
  },
  {
    "original_id": 1884,
    "original_sentence": "It is grown as an ornamental plant in gardens, where several cultivars have been selected with varying pastel colors, including pink and purple.",
    "lexical": "It is cultivated as a decorative plant in gardens, with various cultivars featuring a palette of pastel shades, such as pink and violet.",
    "shuffle": "In gardens, it is grown as an ornamental plant where several cultivars with pastel colors have been selected.",
    "restructure": "Selected for its pastel-colored cultivars, including pink and purple, this plant is commonly grown ornamentally in gardens.",
    "negation": "It is not grown solely for utility; it is cultivated ornamentally in gardens with colorful varieties.",
    "quantifier": "Many cultivars have been selected with different pastel colors for garden decoration.",
    "resemantic": "This plant is often chosen for gardens because of its soft-colored varieties, like pink and purple.",
    "insert": "It is widely grown as an ornamental garden plant, particularly because of the numerous cultivars that exhibit pastel colors such as delicate pink and soft purple.",
    "delete": "It is grown in gardens with pastel-colored cultivars."
  },
  {
    "original_id": 2269,
    "original_sentence": "It is a close relative of the mourning and eared doves.",
    "lexical": "It is a near kin of the mourning dove and the eared dove.",
    "shuffle": "Of the mourning and eared doves, it is a close relative.",
    "restructure": "This species shares a close evolutionary relationship with the mourning and eared doves.",
    "negation": "It isn’t unrelated to the mourning and eared doves.",
    "quantifier": "Like many dove species, it is closely related to mourning and eared doves.",
    "resemantic": "This bird is in the same family as the mourning and eared doves.",
    "insert": "It is considered a close biological relative of both the mourning and the eared doves in avian classification.",
    "delete": "It is related to mourning and eared doves."
  },
  {
    "original_id": 2641,
    "original_sentence": "All shrews are comparatively small, most no larger than a mouse.",
    "lexical": "All shrews are relatively diminutive, with the majority not exceeding the size of a mouse.",
    "shuffle": "Most shrews are no larger than a mouse, and all are comparatively small.",
    "restructure": "Shrews, being among the smallest mammals, are generally not bigger than a mouse.",
    "negation": "Shrews aren’t typically larger than a mouse.",
    "quantifier": "Almost all shrews are small, usually no bigger than mice.",
    "resemantic": "These mammals are tiny, with most shrews rivaling mice in size.",
    "insert": "All shrews are known to be comparatively small creatures, with most individuals measuring no more than a common house mouse.",
    "delete": "Most shrews are no larger than a mouse."
  },
  {
    "original_id": 1272,
    "original_sentence": "On Friday, drivers had a 45-minute free practice session and a 30-minute qualifying session.",
    "lexical": "On Friday, racers participated in a 45-minute open practice and a 30-minute qualification session.",
    "shuffle": "Drivers had a 45-minute practice and a 30-minute qualifying session on Friday.",
    "restructure": "Friday’s schedule included a 45-minute practice followed by a 30-minute qualification session for drivers.",
    "negation": "Drivers weren’t without practice; they had a 45-minute session before qualifying.",
    "quantifier": "All drivers had one practice and one qualifying session on Friday.",
    "resemantic": "Friday’s agenda provided drivers time for both practice and qualifying runs.",
    "insert": "On Friday, drivers engaged in a scheduled 45-minute free practice session and subsequently a timed 30-minute qualifying round.",
    "delete": "Drivers had practice and qualifying on Friday."
  },
  {
    "original_id": 272,
    "original_sentence": "If I were an engineer, I would look for a chemical safer than water to use for geothermal energy production.",
    "lexical": "If I were an engineer, I’d seek a compound more secure than water for use in geothermal energy extraction.",
    "shuffle": "I would look for a safer chemical than water for geothermal energy, if I were an engineer.",
    "restructure": "As a hypothetical engineer, my aim would be to identify a chemical safer than water for geothermal applications.",
    "negation": "I wouldn’t choose water if there were a safer chemical for geothermal energy.",
    "quantifier": "Some engineers might look for a safer chemical than water for geothermal energy.",
    "resemantic": "If I were working in geothermal energy, I’d search for an alternative to water that poses fewer safety risks.",
    "insert": "If I were a professional engineer, I would actively search for a safer chemical alternative to water for efficient geothermal energy production.",
    "delete": "I would look for a safer chemical than water for geothermal use."
  },
  {
    "original_id": 1357,
    "original_sentence": "In 2017, the museum received 2,165,601 visitors, Scotland's most popular visitor attraction that year.",
    "lexical": "In 2017, the museum attracted 2,165,601 guests, making it Scotland's leading tourist destination for that year.",
    "shuffle": "The museum received 2,165,601 visitors in 2017, becoming Scotland's most visited attraction.",
    "restructure": "With 2,165,601 visitors in 2017, the museum became the most popular attraction in Scotland.",
    "negation": "Scotland had no other attraction more visited than this museum in 2017.",
    "quantifier": "Among all attractions in Scotland, this museum had the highest number of visitors in 2017.",
    "resemantic": "The museum drew a record crowd in 2017, topping Scotland's list of attractions.",
    "insert": "In the year 2017, the museum proudly welcomed 2,165,601 visitors, officially becoming the most frequented tourist attraction in all of Scotland.",
    "delete": "In 2017, the museum received over 2 million visitors."
  },
  {
    "original_id": 1607,
    "original_sentence": "Production and use of energy resources is important to the economy of the world.",
    "lexical": "Generation and utilization of energy resources is vital to the global economy.",
    "shuffle": "To the economy of the world, the production and use of energy resources is important.",
    "restructure": "The global economy greatly depends on the production and use of energy resources.",
    "negation": "The world economy wouldn't function well without the production and use of energy resources.",
    "quantifier": "Most global economies rely on the production and use of energy resources.",
    "resemantic": "Energy resource development plays a key role in supporting the world's economy.",
    "insert": "Production and effective use of crucial energy resources is highly important to the modern global economy.",
    "delete": "Energy production and use is important to the world economy."
  },
  {
    "original_id": 1704,
    "original_sentence": "In January 2013 Jenneke was ranked tenth on AskMen. com 's 99 Most Desirable Women 2013.",
    "lexical": "In January 2013, Jenneke was listed tenth on AskMen. com’s 99 Most Alluring Women 2013.",
    "shuffle": "Jenneke was ranked tenth in January 2013 on AskMen. com's 99 Most Desirable Women 2013.",
    "restructure": "AskMen. com placed Jenneke in the tenth spot on its 2013 list of the 99 Most Desirable Women.",
    "negation": "Jenneke wasn’t ranked lower than tenth on the 2013 AskMen. com list.",
    "quantifier": "Among the 99 women, Jenneke was one of the top ten most desirable according to AskMen. com in 2013.",
    "resemantic": "Jenneke achieved the 10th position on AskMen's 2013 list of admired women.",
    "insert": "In the month of January 2013, Jenneke was impressively ranked as the tenth most desirable woman on AskMen. com's notable 99 Most Desirable Women list.",
    "delete": "In 2013, Jenneke was ranked tenth on AskMen’s list."
  },
  {
    "original_id": 2550,
    "original_sentence": "An addition reaction is the opposite of an elimination reaction.",
    "lexical": "An addition reaction is the converse of an elimination reaction.",
    "shuffle": "The opposite of an elimination reaction is an addition reaction.",
    "restructure": "Whereas an elimination reaction removes atoms, an addition reaction introduces them.",
    "negation": "An addition reaction is not the same as an elimination reaction.",
    "quantifier": "Every addition reaction can be seen as the reverse of some elimination reactions.",
    "resemantic": "In contrast to elimination reactions, addition reactions involve the joining of atoms.",
    "insert": "In organic chemistry, an addition reaction is essentially the opposite process of an elimination reaction.",
    "delete": "An addition reaction is the opposite of elimination."
  },
  {
    "original_id": 796,
    "original_sentence": "The nouns and adjectives are created by removing the ending and thus obtaining the root.",
    "lexical": "The nouns and adjectives are formed by stripping the suffix and thereby extracting the stem.",
    "shuffle": "By removing the ending, the root is obtained, and nouns and adjectives are created.",
    "restructure": "To create nouns and adjectives, the ending is removed to isolate the root.",
    "negation": "Nouns and adjectives aren't created without removing the ending to obtain the root.",
    "quantifier": "Many nouns and adjectives are created by removing the ending to reveal the root.",
    "resemantic": "Removing the word's ending exposes its base, allowing noun and adjective formation.",
    "insert": "In morphological analysis, nouns and adjectives are typically created by systematically removing the word's ending to derive its root.",
    "delete": "Nouns and adjectives are made by getting the root."
  },
  {
    "original_id": 1366,
    "original_sentence": "The phrase is used in widely varying contexts.",
    "lexical": "The expression is employed in a broad array of contexts.",
    "shuffle": "In widely varying contexts, the phrase is used.",
    "restructure": "This phrase finds application in many different contexts.",
    "negation": "The phrase is not restricted to a single context.",
    "quantifier": "The phrase is used in many different contexts.",
    "resemantic": "The same phrase appears in multiple kinds of situations.",
    "insert": "The phrase is commonly used in a remarkably wide range of diverse contexts and scenarios.",
    "delete": "The phrase is used in different contexts."
  },
  {
    "original_id": 1252,
    "original_sentence": "This species may be seen flying from April to October in the south, while in the north it flies from summer to early fall.",
    "lexical": "This species may be observed airborne from April through October in southern regions, and from summer until early autumn in the north.",
    "shuffle": "In the south, this species may be seen flying from April to October, while in the north, it flies from summer to early fall.",
    "restructure": "In southern areas, it is visible from April to October, whereas in northern areas, it appears from summer to early fall.",
    "negation": "It doesn’t fly all year round; it’s only active from April to October in the south and summer to early fall in the north.",
    "quantifier": "Most individuals of this species are seen flying during warmer months in both the south and north.",
    "resemantic": "This species tends to fly in the southern regions from spring to autumn and in the north during the warmer seasons.",
    "insert": "This species of insect can typically be observed flying between April and October in southern regions, while in northern regions, its flight season spans from summer to early autumn.",
    "delete": "This species flies from April to October in the south and summer to fall in the north."
  },
  {
    "original_id": 1852,
    "original_sentence": "There were just two entries in the quad doubles, and they played a straight final to decide the championship.",
    "lexical": "There were merely two contenders in the quad doubles, and they contested a direct final to determine the champion.",
    "shuffle": "In the quad doubles, there were just two entries, and they played a straight final to decide the championship.",
    "restructure": "Only two teams entered the quad doubles, so the championship was determined in a single final match.",
    "negation": "There weren’t more than two entries in the quad doubles, leading to a straight final.",
    "quantifier": "Only a couple of entries competed in the quad doubles event.",
    "resemantic": "Since just two teams entered the quad doubles, the winner was decided in one final match.",
    "insert": "There were only two competing teams in the quad doubles category, and they played a straightforward final match to determine who would be crowned champions.",
    "delete": "Two teams played a final in the quad doubles."
  },
  {
    "original_id": 2534,
    "original_sentence": "At the 2009 Census, the commune had a population of 677.",
    "lexical": "During the 2009 Census, the commune recorded a populace of 677.",
    "shuffle": "The commune had a population of 677 at the 2009 Census.",
    "restructure": "According to the 2009 Census, the population of the commune was 677.",
    "negation": "The population of the commune wasn’t more than 677 in the 2009 Census.",
    "quantifier": "The commune had only a few hundred residents in the 2009 Census.",
    "resemantic": "The commune counted 677 residents in 2009.",
    "insert": "As recorded in the official 2009 Census, the commune had a total population of exactly 677 individuals.",
    "delete": "In 2009, the commune had 677 people."
  },
  {
    "original_id": 2533,
    "original_sentence": "Leaf insects use camouflage to take on the appearance of a leaf.",
    "lexical": "Leaf insects utilize mimicry to resemble a leaf's appearance.",
    "shuffle": "To take on the appearance of a leaf, leaf insects use camouflage.",
    "restructure": "By using camouflage, leaf insects imitate the look of leaves.",
    "negation": "Leaf insects don’t appear as insects due to their leaf-like camouflage.",
    "quantifier": "Many leaf insects employ camouflage to mimic a leaf.",
    "resemantic": "Leaf insects disguise themselves as leaves for protection.",
    "insert": "Leaf insects cleverly employ natural camouflage techniques to adopt the exact appearance of a leaf and avoid predators.",
    "delete": "Leaf insects use camouflage to look like a leaf."
  },
  {
    "original_id": 2491,
    "original_sentence": "Many game artists are called upon to develop graphical treatments for the environments and elements in which role-playing games take place.",
    "lexical": "Numerous game illustrators are tasked with designing visual treatments for the settings and components of role-playing games.",
    "shuffle": "Game artists are often asked to create graphical treatments for the elements and environments of role-playing games.",
    "restructure": "Role-playing games often rely on game artists to design visuals for the game’s environments and features.",
    "negation": "Game artists aren’t typically excluded from creating the visual elements of role-playing games.",
    "quantifier": "Most game artists are responsible for developing visuals in role-playing environments.",
    "resemantic": "Game artists contribute to the visual style and settings that define role-playing games.",
    "insert": "In the development of role-playing games, many skilled game artists are regularly tasked with crafting detailed graphical treatments for immersive environments and gameplay elements.",
    "delete": "Game artists develop graphics for RPG environments."
  },
  {
    "original_id": 555,
    "original_sentence": "The number of chromosomes is 40.",
    "lexical": "The chromosome count is 40.",
    "shuffle": "There are 40 chromosomes in number.",
    "restructure": "There are 40 chromosomes present.",
    "negation": "The number of chromosomes is not different from 40.",
    "quantifier": "Exactly 40 chromosomes are present.",
    "resemantic": "The organism possesses a total of 40 chromosomes.",
    "insert": "The total number of chromosomes found in this organism is 40.",
    "delete": "Chromosomes number 40."
  },
  {
    "original_id": 1612,
    "original_sentence": "Insect respiration happens without lungs.",
    "lexical": "Insects respire without utilizing lungs.",
    "shuffle": "Respiration in insects happens without lungs.",
    "restructure": "Insects breathe through a system that does not involve lungs.",
    "negation": "Insect respiration does not involve lungs.",
    "quantifier": "All insect respiration occurs without lungs.",
    "resemantic": "Insects rely on tracheal systems instead of lungs to respire.",
    "insert": "In most insects, respiration occurs efficiently without the use of lungs.",
    "delete": "Insects breathe without lungs."
  },
  {
    "original_id": 1433,
    "original_sentence": "Points are awarded to drivers and teams based on their finishing order.",
    "lexical": "Points are allocated to racers and teams according to their placement.",
    "shuffle": "Based on their finishing order, drivers and teams are awarded points.",
    "restructure": "The finishing order determines how many points drivers and teams receive.",
    "negation": "Points are not awarded randomly but based on finishing order.",
    "quantifier": "All drivers and teams earn points depending on their finishing order.",
    "resemantic": "Drivers and teams earn scores depending on how they place in the race.",
    "insert": "In racing competitions, points are systematically awarded to drivers and teams according to their final finishing positions.",
    "delete": "Points go to drivers and teams based on placement."
  },
  {
    "original_id": 2444,
    "original_sentence": "Perjury is a serious crime because it might be used to take away the power of a court, which can lead to punishment for the wrong person.",
    "lexical": "Perjury is a grave offense as it may undermine a court’s authority, potentially resulting in the punishment of an innocent person.",
    "shuffle": "Because it may take away a court's power, perjury is a serious crime that can lead to punishing the wrong person.",
    "restructure": "Perjury can result in the wrongful punishment of an individual by weakening the authority of the court, making it a serious crime.",
    "negation": "Perjury is not a trivial matter since it can wrongly shift the court’s judgment.",
    "quantifier": "In many cases, perjury is a serious crime that could lead to wrongful punishment.",
    "resemantic": "Lying under oath can jeopardize justice by misleading the court and harming innocent people.",
    "insert": "Perjury, which involves deliberately lying under oath, is a serious legal offense because it threatens judicial integrity and can unjustly penalize an innocent individual.",
    "delete": "Perjury is a serious crime that can hurt the court’s power."
  },
  {
    "original_id": 2001,
    "original_sentence": "The first goal of treating gout is to reduce the symptoms of an acute attack.",
    "lexical": "The primary objective of gout treatment is to alleviate the symptoms of a sudden flare-up.",
    "shuffle": "To reduce the symptoms of an acute attack is the first goal in treating gout.",
    "restructure": "Treating gout begins with reducing the symptoms of an acute episode.",
    "negation": "The first step in treating gout is not to ignore the symptoms of an acute attack.",
    "quantifier": "The first and most important goal in gout treatment is symptom relief during acute episodes.",
    "resemantic": "Managing an acute gout attack focuses initially on symptom reduction.",
    "insert": "The foremost objective in the medical treatment of gout is to promptly reduce the painful symptoms of an acute flare-up.",
    "delete": "The first goal of treating gout is to reduce symptoms."
  },
  {
    "original_id": 2184,
    "original_sentence": "Its natural habitats are subtropical or tropical forests.",
    "lexical": "Its native environments consist of subtropical and tropical woodlands.",
    "shuffle": "Subtropical or tropical forests are its natural habitats.",
    "restructure": "It naturally lives in forests that are either subtropical or tropical.",
    "negation": "Its natural habitats are not outside subtropical or tropical forests.",
    "quantifier": "Most of its natural habitats are found in subtropical or tropical forests.",
    "resemantic": "It thrives in warm, forested regions typical of the subtropics and tropics.",
    "insert": "Its primary natural habitats are lush subtropical or tropical forests with dense vegetation.",
    "delete": "Its habitats are subtropical or tropical forests."
  },
  {
    "original_id": 1783,
    "original_sentence": "One of the main industries in the town is tourism, most notably scuba diving.",
    "lexical": "A major economic sector in the town is tourism, particularly scuba diving.",
    "shuffle": "Tourism, most notably scuba diving, is one of the town's main industries.",
    "restructure": "Scuba diving, a key attraction, makes tourism a leading industry in the town.",
    "negation": "Tourism, especially scuba diving, is not a minor industry in the town.",
    "quantifier": "Many townspeople work in tourism, especially in scuba diving.",
    "resemantic": "Scuba diving tourism plays a prominent role in the town’s economy.",
    "insert": "Among the town's key industries, tourism stands out—particularly due to the popularity of scuba diving with visitors.",
    "delete": "Tourism, especially scuba diving, is a main industry."
  },
  {
    "original_id": 820,
    "original_sentence": "The swimming competition was held in the open sea because the organizers had refused to spend the money necessary for a specially constructed stadium.",
    "lexical": "The swimming event took place in the ocean due to the organizers’ refusal to allocate funds for a purpose-built venue.",
    "shuffle": "Because the organizers refused to spend money on a specially built stadium, the swimming competition was held in the open sea.",
    "restructure": "Since the organizers declined to fund a designated stadium, the swimming event was held in the open sea.",
    "negation": "The organizers didn’t agree to spend money on a stadium, so the swimming competition wasn’t held indoors.",
    "quantifier": "Many organizers refused to spend the money needed for a stadium, so the competition took place in the sea.",
    "resemantic": "Due to budget constraints, the swimming contest happened in open water instead of a constructed facility.",
    "insert": "The swimming competition was conducted in the open sea as the event organizers deliberately avoided the high cost of building a dedicated stadium.",
    "delete": "The competition was in the open sea due to lack of stadium funding."
  },
  {
    "original_id": 1240,
    "original_sentence": "It is made up of 8 districts and 28 municipalities.",
    "lexical": "It comprises 8 districts and 28 administrative municipalities.",
    "shuffle": "Made up of 8 districts and 28 municipalities, it is.",
    "restructure": "The region consists of 8 districts and 28 municipalities.",
    "negation": "It is not composed of fewer than 8 districts and 28 municipalities.",
    "quantifier": "All 8 districts and 28 municipalities make up the region.",
    "resemantic": "The area includes a total of 8 districts and 28 local governments.",
    "insert": "Administratively, it is made up of 8 distinct districts and 28 individual municipalities.",
    "delete": "It has 8 districts and 28 municipalities."
  },
  {
    "original_id": 2509,
    "original_sentence": "The boiling point of a liquid varies depending upon the surrounding environmental pressure.",
    "lexical": "A liquid’s boiling temperature changes according to the ambient atmospheric pressure.",
    "shuffle": "Depending on the surrounding pressure, the boiling point of a liquid varies.",
    "restructure": "Environmental pressure affects the boiling point of a liquid.",
    "negation": "The boiling point of a liquid is not fixed; it depends on the external pressure.",
    "quantifier": "In many cases, the boiling point of liquids changes with the environmental pressure.",
    "resemantic": "Liquids boil at different temperatures based on how much pressure surrounds them.",
    "insert": "The boiling point of any given liquid can significantly vary as a result of changes in the surrounding environmental pressure.",
    "delete": "The boiling point depends on environmental pressure."
  },
  {
    "original_id": 667,
    "original_sentence": "Car rentals are subject to many conditions which vary from one brand to another.",
    "lexical": "Automobile rentals are governed by numerous stipulations that differ across companies.",
    "shuffle": "Many conditions apply to car rentals, which differ from brand to brand.",
    "restructure": "Different rental brands impose varying conditions on car rentals.",
    "negation": "Car rentals are not exempt from conditions, which differ by brand.",
    "quantifier": "Most car rentals are subject to a variety of conditions that change between brands.",
    "resemantic": "Terms and requirements for renting a car can differ depending on the company.",
    "insert": "Car rentals are generally subject to many varying conditions depending on the specific brand or provider.",
    "delete": "Car rentals face varying conditions by brand."
  },
  {
    "original_id": 1536,
    "original_sentence": "Sixth is the roof escape opening that is in place on all Funny Cars since the division was made in the early 1970s.",
    "lexical": "The sixth feature is the rooftop emergency exit, implemented on all Funny Cars since the class was established in the early 1970s.",
    "shuffle": "The roof escape opening is sixth, and it has been required on all Funny Cars since the early 1970s.",
    "restructure": "All Funny Cars have had a roof escape opening since the division's inception in the early 1970s, making it the sixth feature.",
    "negation": "It is not the case that Funny Cars lack the sixth feature, a roof escape opening, which has been standard since the 1970s.",
    "quantifier": "Each Funny Car has included the roof escape opening since the early 1970s.",
    "resemantic": "Since the division’s creation in the early 1970s, Funny Cars have been equipped with a roof hatch as their sixth safety feature.",
    "insert": "The sixth element, a roof escape opening, has been a mandatory safety feature on all Funny Cars since the class began in the early 1970s.",
    "delete": "The sixth is the roof escape opening in all Funny Cars since the 1970s."
  },
  {
    "original_id": 600,
    "original_sentence": "The film's story is about an astronaut crew who leave Earth on a deep space mission and crash land on a supposedly alien planet in the 40th century.",
    "lexical": "The movie's plot follows a team of astronauts who depart Earth for deep space and eventually crash on a presumed extraterrestrial planet in the 40th century.",
    "shuffle": "In the 40th century, a crew of astronauts leaves Earth on a deep space mission and crash-lands on an alien planet.",
    "restructure": "An astronaut crew on a deep space mission from Earth crash-lands on what is believed to be an alien world in the 40th century.",
    "negation": "The film doesn’t take place on Earth but follows astronauts who crash on a seemingly alien planet.",
    "quantifier": "A group of astronauts crash-lands on an alien world during one of the many deep space missions of the 40th century.",
    "resemantic": "Set in the distant future, the film narrates how astronauts explore space and end up stranded on a mysterious planet.",
    "insert": "The science fiction film's storyline features a crew of astronauts embarking on an ambitious deep space journey and crash-landing on what appears to be an alien world during the 40th century.",
    "delete": "The film is about astronauts who crash on an alien planet in the 40th century."
  },
  {
    "original_id": 1580,
    "original_sentence": "Virgin purchased eighty percent of the team, as part of sponsorship arrangement.",
    "lexical": "Virgin acquired an eighty percent stake in the team as part of a sponsorship deal.",
    "shuffle": "As part of a sponsorship arrangement, Virgin bought eighty percent of the team.",
    "restructure": "Eighty percent of the team was acquired by Virgin through a sponsorship agreement.",
    "negation": "Virgin did not refrain from investing, but rather bought eighty percent of the team.",
    "quantifier": "A significant portion—eighty percent—of the team was purchased by Virgin.",
    "resemantic": "Virgin took majority control of the team through a sponsorship partnership.",
    "insert": "Virgin Group purchased a controlling eighty percent share of the team as part of a broader sponsorship arrangement.",
    "delete": "Virgin purchased 80% of the team as part of sponsorship."
  },
  {
    "original_id": 2121,
    "original_sentence": "The wreath was added against the rules of heraldry, breaking up the carpet pattern.",
    "lexical": "The garland was appended in violation of heraldic principles, disrupting the carpet design.",
    "shuffle": "Against heraldic rules, the wreath was added, disrupting the pattern of the carpet.",
    "restructure": "By adding the wreath, which violated heraldic rules, the carpet pattern was broken.",
    "negation": "The wreath was not added in accordance with heraldic rules, and it disrupted the carpet pattern.",
    "quantifier": "Some elements, like the wreath, were added in defiance of heraldry rules, affecting the carpet pattern.",
    "resemantic": "The addition of the wreath, though improper by heraldic standards, altered the design of the carpet.",
    "insert": "The decorative wreath was added despite contravening heraldic traditions, which led to a disruption in the continuity of the carpet's pattern.",
    "delete": "The wreath broke the carpet pattern and violated heraldry."
  },
  {
    "original_id": 943,
    "original_sentence": "He and his wife Mary have three children and, as of July 2016, six grandchildren.",
    "lexical": "Together with his wife Mary, he has three offspring and, as of July 2016, six grandchildren.",
    "shuffle": "As of July 2016, he and his wife Mary have six grandchildren and three children.",
    "restructure": "He has three children with his wife Mary, and by July 2016, they had six grandchildren.",
    "negation": "He and his wife Mary do not have fewer than three children and six grandchildren.",
    "quantifier": "They have three children and as many as six grandchildren as of July 2016.",
    "resemantic": "He and Mary raised three children and now have six grandchildren (as of mid-2016).",
    "insert": "He and his wife Mary have three children, and as of July 2016, they proudly have six grandchildren.",
    "delete": "He and Mary have three children and six grandchildren."
  },
  {
    "original_id": 2230,
    "original_sentence": "There were some changes in the terms of their service which may have created resentment.",
    "lexical": "Modifications to their service terms might have led to discontent.",
    "shuffle": "Changes in their service terms may have caused resentment.",
    "restructure": "Resentment may have stemmed from alterations to the terms of their service.",
    "negation": "There were not no changes; some adjustments may have caused resentment.",
    "quantifier": "Several changes in their service terms may have led to resentment.",
    "resemantic": "Adjustments in their service conditions possibly provoked dissatisfaction.",
    "insert": "There were notable changes in the terms of their service, potentially leading to resentment among the group.",
    "delete": "Changes in service terms may have caused resentment."
  },
  {
    "original_id": 1800,
    "original_sentence": "Mood and emotions at work are related to job satisfaction.",
    "lexical": "Affective states and feelings in the workplace are linked to job satisfaction.",
    "shuffle": "Job satisfaction is related to emotions and mood at work.",
    "restructure": "Job satisfaction is influenced by workplace emotions and mood.",
    "negation": "Job satisfaction is not unrelated to mood and emotions at work.",
    "quantifier": "Many aspects of mood and emotion at work relate to job satisfaction.",
    "resemantic": "How people feel emotionally at work often affects how satisfied they are with their jobs.",
    "insert": "Mood and emotional states within the work environment are directly associated with levels of job satisfaction.",
    "delete": "Work mood and emotions are tied to job satisfaction."
  },
  {
    "original_id": 53,
    "original_sentence": "They got together to pray and wish the rains would stop flooding the river and drowning the crops.",
    "lexical": "They assembled to pray and hope the rainfall would cease inundating the river and submerging the crops.",
    "shuffle": "To pray and hope the floods would end, they gathered together.",
    "restructure": "They gathered in prayer, hoping for the rains to stop overflowing the river and harming the crops.",
    "negation": "They didn’t gather for celebration but to pray for the rains to stop damaging the crops.",
    "quantifier": "All of them came together to pray that the constant rains would stop flooding the river.",
    "resemantic": "They united in hope and prayer that the severe rains would end and spare the fields.",
    "insert": "In a moment of collective concern, they gathered to pray and fervently wish the heavy rains would cease flooding the river and ruining their crops.",
    "delete": "They prayed the rains would stop flooding and drowning crops."
  },
  {
    "original_id": 1981,
    "original_sentence": "A nuclear meltdown may be part of a chain of disasters.",
    "lexical": "A nuclear core collapse could trigger a sequence of catastrophic events.",
    "shuffle": "Part of a disaster chain may be a nuclear meltdown.",
    "restructure": "A nuclear meltdown can serve as a link in a series of disasters.",
    "negation": "A nuclear meltdown is not necessarily an isolated incident; it may lead to further disasters.",
    "quantifier": "Often, a nuclear meltdown is just one in a series of disasters.",
    "resemantic": "One disaster, such as a meltdown, can initiate additional catastrophic outcomes.",
    "insert": "A nuclear meltdown, though rare, may contribute significantly to a sequence of interconnected disasters.",
    "delete": "A meltdown can be part of a disaster chain."
  },
  {
    "original_id": 2334,
    "original_sentence": "For many years, efforts to discover brown dwarfs were fruitless.",
    "lexical": "For decades, attempts to detect brown dwarfs were unavailing.",
    "shuffle": "Efforts to discover brown dwarfs were fruitless for many years.",
    "restructure": "Discovering brown dwarfs proved futile for many years despite continuous efforts.",
    "negation": "Efforts to discover brown dwarfs did not yield results for many years.",
    "quantifier": "Numerous efforts over the years to find brown dwarfs were unsuccessful.",
    "resemantic": "Scientists spent years searching for brown dwarfs without success.",
    "insert": "For many consecutive years, scientific efforts to discover elusive brown dwarfs were ultimately fruitless.",
    "delete": "Efforts to discover brown dwarfs were fruitless."
  },
  {
    "original_id": 482,
    "original_sentence": "From time to time, individuals joined the Order by special permission.",
    "lexical": "Occasionally, individuals entered the Order with exceptional authorization.",
    "shuffle": "Individuals, from time to time, joined the Order by special permission.",
    "restructure": "Special permission allowed certain individuals to join the Order on occasion.",
    "negation": "It wasn't uncommon for people to occasionally join the Order with special permission.",
    "quantifier": "Some individuals occasionally joined the Order under special permission.",
    "resemantic": "At times, the Order accepted new members through unique approval.",
    "insert": "From time to time, select individuals were permitted to join the Order by obtaining special authorization.",
    "delete": "Occasionally, individuals joined the Order with permission."
  },
  {
    "original_id": 2810,
    "original_sentence": "This subfamily is widely distributed and members are adapted to a wide variety of environments.",
    "lexical": "This subfamily is extensively dispersed, and its members are acclimated to diverse ecosystems.",
    "shuffle": "Members of this subfamily are adapted to many environments, and it is widely distributed.",
    "restructure": "The widespread subfamily includes species that are well adapted to numerous environments.",
    "negation": "This subfamily is not restricted in distribution, as members thrive in various environments.",
    "quantifier": "Many members of this broadly distributed subfamily have adapted to different environments.",
    "resemantic": "These organisms span a large range and thrive in many different habitats.",
    "insert": "This biological subfamily is widely distributed across regions, and its members have adapted to a remarkably broad range of environmental conditions.",
    "delete": "This subfamily is widely distributed and adapted to many environments."
  },
  {
    "original_id": 2781,
    "original_sentence": "As a result the two worlds collide and it seems they are doomed by circumstance.",
    "lexical": "Consequently, the two realms clash, appearing to be condemned by fate.",
    "shuffle": "The two worlds collide, and as a result, they appear doomed by circumstance.",
    "restructure": "Because of these events, the two worlds come into conflict and appear destined for ruin.",
    "negation": "It does not seem that the two worlds can avoid being doomed by circumstance once they collide.",
    "quantifier": "Both worlds seem entirely doomed by the circumstances that led to their collision.",
    "resemantic": "The convergence of the two worlds appears to seal their tragic fate.",
    "insert": "As a direct consequence, the two disparate worlds inevitably collide, and it seems they are tragically doomed by circumstances beyond control.",
    "delete": "The worlds collide and seem doomed by circumstance."
  },
  {
    "original_id": 418,
    "original_sentence": "Town criers were protected by royalty, as they sometimes brought bad news such as tax increases.",
    "lexical": "Heralds were safeguarded by the monarchy, as they occasionally delivered unfavorable news like tax hikes.",
    "shuffle": "Because they sometimes brought bad news like tax increases, town criers were protected by royalty.",
    "restructure": "Since they occasionally delivered unpleasant news, town criers received protection from royalty.",
    "negation": "It wasn't unusual for town criers to be protected by royalty when tasked with delivering unpopular news.",
    "quantifier": "Many town criers were protected by royalty due to their role in delivering negative news.",
    "resemantic": "Town criers, who often relayed unpopular messages, received royal protection.",
    "insert": "Historically, town criers were afforded protection by royalty, particularly because they were tasked with announcing unpopular proclamations like tax increases.",
    "delete": "Town criers were protected because they brought bad news."
  },
  {
    "original_id": 1643,
    "original_sentence": "The pumpkin is native to the continent of North America.",
    "lexical": "The pumpkin originates from the North American continent.",
    "shuffle": "Native to North America, the pumpkin is widely cultivated.",
    "restructure": "Pumpkins originally came from North America.",
    "negation": "The pumpkin is not native to continents other than North America.",
    "quantifier": "Most pumpkins are native to regions within North America.",
    "resemantic": "Pumpkins were first domesticated in North America.",
    "insert": "The well-known pumpkin is believed to be native specifically to the continent of North America.",
    "delete": "The pumpkin is native to North America."
  },
  {
    "original_id": 920,
    "original_sentence": "Agriculture is still one of the main activities in the province, adding 15% to its output.",
    "lexical": "Farming remains a key industry in the province, contributing 15% to its production.",
    "shuffle": "One of the main activities in the province is still agriculture, contributing 15% to output.",
    "restructure": "The province continues to rely heavily on agriculture, which contributes 15% to its total output.",
    "negation": "Agriculture is not a minor activity, as it adds 15% to the province’s output.",
    "quantifier": "A significant portion—15%—of the province’s output comes from agriculture.",
    "resemantic": "Farming continues to play an important economic role in the province.",
    "insert": "Agriculture remains an essential component of the provincial economy, contributing a notable 15% to its total output.",
    "delete": "Agriculture is one of the main activities, contributing 15%."
  },
  {
    "original_id": 2779,
    "original_sentence": "Evaporation is an essential part of the water cycle.",
    "lexical": "Evaporation constitutes a vital component of the hydrological cycle.",
    "shuffle": "An essential part of the water cycle is evaporation.",
    "restructure": "The water cycle relies heavily on the process of evaporation.",
    "negation": "The water cycle cannot function properly without evaporation.",
    "quantifier": "One crucial element of the water cycle is evaporation.",
    "resemantic": "Evaporation plays a key role in how water moves through the environment.",
    "insert": "Evaporation is a critically important process within the broader water cycle system.",
    "delete": "Evaporation is part of the water cycle."
  },
  {
    "original_id": 430,
    "original_sentence": "There are no records of any military related acts in his time in which he participated.",
    "lexical": "No documentation exists of his involvement in any martial endeavors during his era.",
    "shuffle": "In his time, there are no records of him participating in any military-related acts.",
    "restructure": "His period shows no recorded participation in military actions.",
    "negation": "There is no evidence suggesting he took part in military actions.",
    "quantifier": "Not a single record shows any military acts he participated in during that time.",
    "resemantic": "His historical record lacks evidence of any military involvement.",
    "insert": "There appear to be no official records documenting any military actions in which he was involved during his time.",
    "delete": "There are no records of his military involvement."
  },
  {
    "original_id": 849,
    "original_sentence": "People first began using weather charts in a modern way in the mid-19th century.",
    "lexical": "Individuals initially utilized meteorological charts in a contemporary fashion during the mid-1800s.",
    "shuffle": "In the mid-19th century, people began using weather charts in a modern way.",
    "restructure": "The mid-19th century marked the beginning of modern use of weather charts by people.",
    "negation": "Before the mid-19th century, weather charts were not used in a modern way.",
    "quantifier": "Many began using weather charts more modernly in the mid-19th century.",
    "resemantic": "The adoption of weather maps in modern forecasting began in the mid-1800s.",
    "insert": "In the field of meteorology, people first began adopting weather charts in a modern and systematic manner during the mid-19th century.",
    "delete": "Weather charts were used in a modern way starting mid-19th century."
  },
  {
    "original_id": 1600,
    "original_sentence": "There are major differences between the political system of the United States and that of most other developed democracies.",
    "lexical": "There are significant disparities between the political framework of the United States and those of most other advanced democracies.",
    "shuffle": "Between the political system of the United States and that of most other developed democracies, there are major differences.",
    "restructure": "The political system of the United States differs greatly from that of most other developed democracies.",
    "negation": "The political system of the United States is not the same as that of most other developed democracies.",
    "quantifier": "Many major differences exist between the U.S. political system and those of most other developed democracies.",
    "resemantic": "The U.S. political structure stands apart from the systems in most other industrialized democracies.",
    "insert": "There are several major and historically rooted differences between the political system of the United States and that of most other developed democracies.",
    "delete": "There are differences between the U.S. political system and most other democracies."
  },
  {
    "original_id": 2243,
    "original_sentence": "The structure of courts and the methods of selecting judges is determined by each state's constitution or legislature.",
    "lexical": "The organization of courts and procedures for appointing judges are dictated by each state's charter or legislative body.",
    "shuffle": "Each state's constitution or legislature determines the court structure and methods of judge selection.",
    "restructure": "Each state’s governing documents or lawmakers establish how courts are structured and judges are chosen.",
    "negation": "The structure of courts and selection of judges is not uniform but depends on each state's constitution or laws.",
    "quantifier": "In all states, the structure of courts and the method for choosing judges are governed individually.",
    "resemantic": "How courts are arranged and judges selected varies depending on the legal framework of each state.",
    "insert": "The overall structure of courts and the specific methods of selecting judges is largely determined by each individual state's constitution or legislative authority.",
    "delete": "Court structure and judge selection are determined by state law."
  },
  {
    "original_id": 2704,
    "original_sentence": "Jutbring has been an active proponent of feminism and equal opportunities for women.",
    "lexical": "Jutbring has been a vocal advocate for feminism and gender equality.",
    "shuffle": "An active proponent of feminism and equal opportunities for women, Jutbring has been.",
    "restructure": "As a supporter of feminism, Jutbring has consistently promoted equal opportunities for women.",
    "negation": "Jutbring has not opposed feminism or efforts toward equal opportunities for women.",
    "quantifier": "Jutbring has strongly supported many efforts toward feminism and equal opportunities for women.",
    "resemantic": "Jutbring has consistently supported women’s rights and feminist causes.",
    "insert": "Jutbring has long been an outspoken and active proponent of feminism and expanding equal opportunities for women across various sectors.",
    "delete": "Jutbring supports feminism and equal opportunities for women."
  },
  {
    "original_id": 2780,
    "original_sentence": "As a result, the two worlds collide and it seems they are doomed by circumstance.",
    "lexical": "Consequently, the two realms clash, and it appears they are fated for ruin.",
    "shuffle": "The two worlds collide, and as a result, they seem doomed by circumstance.",
    "restructure": "Due to this, the two worlds come into conflict and appear destined for misfortune.",
    "negation": "It does not seem that the two worlds can avoid being doomed once they collide.",
    "quantifier": "Both worlds appear completely doomed by the overwhelming circumstances after their collision.",
    "resemantic": "The meeting of the two worlds appears to seal their unfortunate fate.",
    "insert": "As a dramatic consequence, the two very different worlds inevitably collide, and it seems they are tragically doomed by unavoidable circumstances.",
    "delete": "The two worlds collide and seem doomed."
  },
  {
    "original_id": 2242,
    "original_sentence": "At about 11 : 31 AM MST, the track of both airplanes intersected over the canyon, and they hit each other.",
    "lexical": "At approximately 11:31 AM MST, the flight paths of both aircraft converged above the canyon, resulting in a collision.",
    "shuffle": "The paths of both airplanes intersected over the canyon at about 11:31 AM MST, and they collided.",
    "restructure": "The two airplanes collided over the canyon when their flight paths crossed around 11:31 AM MST.",
    "negation": "There was no way to prevent the collision once their paths intersected over the canyon at 11:31 AM MST.",
    "quantifier": "Both aircraft's paths intersected at precisely 11:31 AM MST above the canyon.",
    "resemantic": "The planes crashed into each other after crossing paths over the canyon around 11:31 AM MST.",
    "insert": "At approximately 11:31 AM MST, the flight paths of the two airplanes intersected directly over the canyon, ultimately resulting in a mid-air collision.",
    "delete": "At 11:31 AM MST, the planes intersected and collided."
  },
  {
    "original_id": 964,
    "original_sentence": "The provinces and territories are all sub-divided into regions for a variety of official and unofficial purposes.",
    "lexical": "The provinces and territories are each partitioned into regions for numerous administrative and informal purposes.",
    "shuffle": "For a variety of official and unofficial reasons, the provinces and territories are subdivided into regions.",
    "restructure": "Regions within provinces and territories serve both formal and informal functions.",
    "negation": "The division of provinces and territories into regions is not limited to only official purposes.",
    "quantifier": "Each of the provinces and territories is divided into multiple regions for different purposes.",
    "resemantic": "Administrative and informal needs have led to regional divisions within all provinces and territories.",
    "insert": "The provinces and territories are consistently sub-divided into multiple distinct regions for both administrative and other informal purposes.",
    "delete": "Provinces and territories are divided into regions for various purposes."
  },
  {
    "original_id": 364,
    "original_sentence": "In order to communicate with each other, both the French girlfriend and the Japanese boyfriend decided to learn a third language.",
    "lexical": "To facilitate communication, the French partner and the Japanese companion opted to acquire a tertiary language.",
    "shuffle": "The French girlfriend and the Japanese boyfriend decided to learn a third language to communicate with each other.",
    "restructure": "A third language was chosen by both the French girlfriend and the Japanese boyfriend to help them communicate.",
    "negation": "They did not want to rely solely on their native languages, so they chose to learn a third one.",
    "quantifier": "Both individuals equally committed to learning another language to communicate.",
    "resemantic": "The couple chose to study a common foreign language to bridge the communication gap.",
    "insert": "In order to communicate more effectively with each other, the French girlfriend and the Japanese boyfriend mutually decided to learn an entirely new third language.",
    "delete": "They decided to learn a third language to communicate."
  },
  {
    "original_id": 650,
    "original_sentence": "Fireworks dates back to the 7th century and originated in China.",
    "lexical": "Pyrotechnics trace their origins to the 7th century in China.",
    "shuffle": "Originating in China, fireworks date back to the 7th century.",
    "restructure": "First developed in China, fireworks have existed since the 7th century.",
    "negation": "Fireworks did not originate after the 7th century but date back to it.",
    "quantifier": "Many believe fireworks first appeared during the 7th century in China.",
    "resemantic": "The invention of fireworks is credited to China in the 7th century.",
    "insert": "Fireworks, a popular form of celebration worldwide, originally emerged in China during the 7th century.",
    "delete": "Fireworks originated in 7th-century China."
  },
  {
    "original_id": 1913,
    "original_sentence": "GCs are part of the feedback system for the immune system.",
    "lexical": "GCs constitute a component of the regulatory feedback loop within the immune system.",
    "shuffle": "Part of the immune system's feedback system are the GCs.",
    "restructure": "The immune system’s feedback mechanism includes GCs as a key component.",
    "negation": "GCs are not absent from the immune system’s feedback network.",
    "quantifier": "GCs are one of several components in the feedback system of the immune response.",
    "resemantic": "The immune system uses GCs as part of its internal regulation process.",
    "insert": "GCs play a critical role within the complex feedback system of the human immune system.",
    "delete": "GCs are part of the immune system’s feedback."
  },
  {
    "original_id": 1971,
    "original_sentence": "The first recorded outbreak of chikungunya may have been in 1779.",
    "lexical": "The earliest documented chikungunya epidemic likely occurred in 1779.",
    "shuffle": "In 1779, the first recorded outbreak of chikungunya may have taken place.",
    "restructure": "Chikungunya’s first known outbreak is believed to have occurred in 1779.",
    "negation": "There is no evidence that chikungunya outbreaks were recorded before 1779.",
    "quantifier": "One of the earliest known outbreaks of chikungunya might have taken place in 1779.",
    "resemantic": "Historical records suggest that chikungunya first spread in 1779.",
    "insert": "The first officially recorded outbreak of the chikungunya virus may have occurred as early as the year 1779.",
    "delete": "The first chikungunya outbreak may have been in 1779."
  },
  {
    "original_id": 2807,
    "original_sentence": "In the center of a village, the ground begins to open up and a strange green light emanates from within.",
    "lexical": "In the heart of a village, the earth starts to split and an eerie green glow radiates from inside.",
    "shuffle": "The ground begins to open up in the center of a village, and a strange green light emanates from within.",
    "restructure": "As the ground opens in the village center, an unusual green light shines from below.",
    "negation": "The ground doesn't remain solid in the village center; instead, it opens as a strange green light emerges.",
    "quantifier": "In many village centers, the ground sometimes opens up and a strange green light can emerge.",
    "resemantic": "At the village center, the earth parts and an otherworldly green light glows from beneath.",
    "insert": "In the very center of a quiet village, the ground suddenly begins to open up, and a strange, pulsating green light emanates from within.",
    "delete": "In a village, the ground opens and a green light emanates."
  },
  {
    "original_id": 2355,
    "original_sentence": "Crombie's family announced on April 18, 2015 that he had died suddenly three days earlier of a brain hemorrhage in New York City.",
    "lexical": "Crombie's relatives revealed on April 18, 2015, that he had passed away unexpectedly three days prior due to a cerebral hemorrhage in New York City.",
    "shuffle": "On April 18, 2015, Crombie's family announced that he had suddenly died of a brain hemorrhage three days earlier in New York City.",
    "restructure": "Three days before April 18, 2015, Crombie died suddenly of a brain hemorrhage in New York City, as his family later announced.",
    "negation": "Crombie did not survive a brain hemorrhage and passed away three days before April 18, 2015, according to his family.",
    "quantifier": "Crombie's family, like many others in such situations, announced on April 18, 2015, that he had died suddenly of a brain hemorrhage three days earlier.",
    "resemantic": "On April 18, 2015, Crombie's family shared the news that he had died unexpectedly in New York City from a brain hemorrhage three days earlier.",
    "insert": "Crombie's immediate family officially announced on April 18, 2015, that he had died quite suddenly three days prior from a brain hemorrhage while in New York City.",
    "delete": "On April 18, 2015, his family said he died of a brain hemorrhage."
  },
  {
    "original_id": 2809,
    "original_sentence": "This subfamily is widely distributed, and members are adapted to a wide variety of environments.",
    "lexical": "This subfamily is broadly dispersed, and its members are suited to numerous ecological niches.",
    "shuffle": "Members are adapted to a wide range of environments, and this subfamily is widely distributed.",
    "restructure": "With a wide distribution, members of this subfamily have adapted to various environments.",
    "negation": "This subfamily is not confined to a narrow range and its members are not limited in environmental adaptation.",
    "quantifier": "Many members of this subfamily are widely spread and adapted to diverse environments.",
    "resemantic": "The group is found across many regions and its members thrive in numerous types of habitats.",
    "insert": "This biological subfamily is widely distributed across continents, and its members have adapted to a remarkably broad variety of environments.",
    "delete": "This subfamily is distributed and adapted to many environments."
  },
  {
    "original_id": 1318,
    "original_sentence": "Call and response singing is common in modern Western popular music.",
    "lexical": "Call-and-response vocalization is prevalent in contemporary Western pop music.",
    "shuffle": "In modern Western popular music, call and response singing is common.",
    "restructure": "Modern Western popular music often includes the technique of call and response singing.",
    "negation": "Call and response singing is not uncommon in modern Western popular music.",
    "quantifier": "Many Western popular music styles commonly use call and response singing.",
    "resemantic": "This interactive vocal style appears frequently in today's Western pop music.",
    "insert": "Call and response singing, a dynamic vocal technique, is particularly common in modern Western popular music.",
    "delete": "Call and response is common in Western music."
  },
  {
    "original_id": 2457,
    "original_sentence": "The rocky coastline has been the site of a number of shipwrecks.",
    "lexical": "The jagged coastline has witnessed several maritime disasters.",
    "shuffle": "A number of shipwrecks have occurred along the rocky coastline.",
    "restructure": "Many shipwrecks have taken place along the rocky stretch of coast.",
    "negation": "The rocky coastline has not been free of shipwrecks.",
    "quantifier": "Numerous shipwrecks have occurred along the rocky coastline.",
    "resemantic": "The rugged shore has claimed multiple ships over time.",
    "insert": "The treacherous rocky coastline has historically been the site of a significant number of tragic shipwrecks.",
    "delete": "The coastline has seen many shipwrecks."
  },
  {
    "original_id": 1853,
    "original_sentence": "There was just two entries in the Quad doubles, and they played a straight final to decided the championship.",
    "lexical": "Only two entries were submitted in the Quad doubles, and a single match was held to determine the champion.",
    "shuffle": "In the Quad doubles, there were just two entries, and they played a final to decide the championship.",
    "restructure": "Because there were only two entries, the Quad doubles was decided by a direct final match.",
    "negation": "There were not more than two entries in the Quad doubles; a single final was played to determine the winner.",
    "quantifier": "Only a couple of entries participated in the Quad doubles, resulting in a direct final to determine the championship.",
    "resemantic": "With just two participants, the Quad doubles title was settled in a single decisive match.",
    "insert": "Due to the limited number of just two entries in the Quad doubles, the event culminated in a straight final to determine the championship outcome.",
    "delete": "There were two entries and they played a final."
  },
  {
    "original_id": 1389,
    "original_sentence": "Matches where also be played on Tuesdays or Wednesdays instead of the normal Thursdays due to scheduling conflicts.",
    "lexical": "Matches were occasionally scheduled for Tuesdays or Wednesdays instead of the usual Thursdays due to calendar clashes.",
    "shuffle": "Due to scheduling conflicts, matches were also played on Tuesdays or Wednesdays instead of Thursdays.",
    "restructure": "Because of scheduling conflicts, matches were sometimes moved from Thursdays to earlier days in the week.",
    "negation": "Matches did not always take place on Thursdays due to scheduling conflicts.",
    "quantifier": "Several matches were played on alternative days like Tuesday or Wednesday because of scheduling issues.",
    "resemantic": "Some games were rescheduled to earlier weekdays due to clashes in the timetable.",
    "insert": "Matches, which typically occurred on Thursdays, were also occasionally played on Tuesdays or Wednesdays due to unavoidable scheduling conflicts.",
    "delete": "Matches were also played earlier due to scheduling."
  },
  {
    "original_id": 2467,
    "original_sentence": "The historical journal, a forum where academic historians could exchange ideas and publish newly discovered information, came into being in the 19th century.",
    "lexical": "The scholarly periodical, a venue for historians to share insights and publish fresh discoveries, emerged during the 19th century.",
    "shuffle": "In the 19th century, the historical journal came into being as a forum for academic historians to exchange ideas and publish information.",
    "restructure": "Academic historians gained a platform to exchange ideas and publish discoveries when the historical journal was founded in the 19th century.",
    "negation": "The historical journal was not established before the 19th century as a venue for scholarly exchange.",
    "quantifier": "Many academic historians contributed to the historical journal, which was established in the 19th century.",
    "resemantic": "The 19th century saw the emergence of a journal that enabled historians to share research and publish findings.",
    "insert": "The historical journal, which served as an essential academic forum for professional historians to exchange scholarly insights and disseminate new findings, originated in the 19th century.",
    "delete": "The historical journal began in the 19th century for historians."
  },
  {
    "original_id": 164,
    "original_sentence": "The copilot whom I met was dressed in an Air Canada uniform.",
    "lexical": "The first officer I encountered wore an Air Canada uniform.",
    "shuffle": "Dressed in an Air Canada uniform was the copilot whom I met.",
    "restructure": "I met a copilot who was wearing an Air Canada uniform.",
    "negation": "The copilot I met was not wearing anything other than an Air Canada uniform.",
    "quantifier": "Most copilots, including the one I met, wear airline uniforms such as Air Canada's.",
    "resemantic": "The person I met turned out to be the copilot, dressed in Air Canada's uniform.",
    "insert": "The copilot, whom I happened to meet at the airport, was dressed in a neat Air Canada uniform.",
    "delete": "The copilot I met wore an Air Canada uniform."
  },
  {
    "original_id": 2350,
    "original_sentence": "Endgames can be classified according to the type of pieces remaining on the board.",
    "lexical": "Endgame scenarios may be categorized based on the nature of the remaining pieces on the board.",
    "shuffle": "According to the types of remaining pieces on the board, endgames can be classified.",
    "restructure": "The classification of endgames depends on the kinds of pieces that are still on the board.",
    "negation": "Endgames are not classified without considering the remaining pieces on the board.",
    "quantifier": "Many endgames are classified by the types of pieces left on the board.",
    "resemantic": "Chess endgames are typically grouped based on what pieces are still in play.",
    "insert": "In chess, endgames can generally be classified according to the specific types of pieces that remain on the board at the final stage.",
    "delete": "Endgames are classified by remaining pieces."
  },
  {
    "original_id": 560,
    "original_sentence": "Canada is also home to many indigenous languages.",
    "lexical": "Canada is also home to numerous aboriginal languages.",
    "shuffle": "Many indigenous languages are also found in Canada.",
    "restructure": "Many indigenous languages are spoken in Canada as well.",
    "negation": "Canada is not without a significant number of indigenous languages.",
    "quantifier": "Canada is home to a wide variety of indigenous languages.",
    "resemantic": "Canada hosts a rich diversity of native languages.",
    "insert": "Canada is also home to many distinct and historically significant indigenous languages.",
    "delete": "Canada is home to indigenous languages."
  },
  {
    "original_id": 549,
    "original_sentence": "Some clinics function as a place for people with injuries or illnesses to come and be seen by a triage nurse or other health worker.",
    "lexical": "Certain clinics serve as centers for individuals with ailments or injuries to consult a triage nurse or medical personnel.",
    "shuffle": "Clinics sometimes function as places where people with illnesses or injuries can be seen by a triage nurse or health worker.",
    "restructure": "Clinics often act as treatment sites where patients with injuries or illnesses are assessed by medical staff.",
    "negation": "Clinics are not solely for scheduled appointments; some help those with injuries or illnesses on arrival.",
    "quantifier": "Many clinics operate as places for people with injuries or illnesses to receive care from triage nurses or health workers.",
    "resemantic": "Some clinics provide initial care and assessment for injured or ill individuals by trained staff.",
    "insert": "Some community clinics function as important access points where people with injuries or illnesses can be initially seen by a triage nurse or other qualified health professional.",
    "delete": "Some clinics help people with injuries or illnesses see a health worker."
  },
  {
    "original_id": 431,
    "original_sentence": "March music is often important for ceremonial occasions.",
    "lexical": "March compositions are frequently significant for formal ceremonies.",
    "shuffle": "For ceremonial occasions, march music is often important.",
    "restructure": "Ceremonial events often include march music due to its importance.",
    "negation": "March music is not unimportant during ceremonial occasions.",
    "quantifier": "Many ceremonial occasions often include march music as an important element.",
    "resemantic": "Processional music is commonly featured during ceremonies.",
    "insert": "March music is often particularly important during formal ceremonial occasions such as parades or official events.",
    "delete": "March music is important for ceremonies."
  },
  {
    "original_id": 120,
    "original_sentence": "The officials announcing the new policy looked like they were ready for inevitable criticism.",
    "lexical": "The authorities unveiling the new policy appeared prepared for unavoidable criticism.",
    "shuffle": "Announcing the new policy, the officials looked ready for inevitable criticism.",
    "restructure": "When the new policy was announced, the officials seemed prepared for the criticism that would follow.",
    "negation": "The officials did not appear unprepared for the inevitable criticism following the policy announcement.",
    "quantifier": "Most of the officials looked like they were ready for the inevitable criticism.",
    "resemantic": "The officials seemed braced for the backlash that was sure to come after the new policy announcement.",
    "insert": "The officials, while announcing the controversial new policy, looked like they were fully prepared for the inevitable wave of public criticism.",
    "delete": "The officials looked ready for criticism."
  },
  {
    "original_id": 666,
    "original_sentence": "He played a brief part in the revolutionary events of 1848.",
    "lexical": "He had a minor role in the upheavals of 1848.",
    "shuffle": "In the revolutionary events of 1848, he played a brief part.",
    "restructure": "His involvement in the 1848 revolution was limited.",
    "negation": "He did not play a major role in the revolutionary events of 1848.",
    "quantifier": "He played a small part in some of the revolutionary events of 1848.",
    "resemantic": "He was slightly involved in the political turbulence of 1848.",
    "insert": "He briefly participated in the early revolutionary events of 1848, though his role was minimal.",
    "delete": "He played a part in the events of 1848."
  },
  {
    "original_id": 805,
    "original_sentence": "After several decades of prosperity, it entered a period of protracted political, military and economic decline.",
    "lexical": "Following decades of affluence, it entered an extended phase of political, military, and economic deterioration.",
    "shuffle": "It entered a period of long political, military, and economic decline after decades of prosperity.",
    "restructure": "Though prosperous for many decades, it later experienced a prolonged downturn in politics, military affairs, and the economy.",
    "negation": "It did not continue to prosper but instead declined politically, militarily, and economically.",
    "quantifier": "Several decades of prosperity were followed by a lengthy period of various declines.",
    "resemantic": "After a long time of flourishing, it began to face serious setbacks across multiple sectors.",
    "insert": "After enjoying several decades of substantial prosperity, it eventually entered a prolonged era of political instability, military weakness, and economic decline.",
    "delete": "After prosperity, it entered decline."
  },
  {
    "original_id": 133,
    "original_sentence": "The displeased principal kept walking around the classroom.",
    "lexical": "The disgruntled principal continued pacing through the classroom.",
    "shuffle": "Around the classroom, the displeased principal kept walking.",
    "restructure": "The principal, who was clearly displeased, walked repeatedly through the classroom.",
    "negation": "The principal did not stay still and showed displeasure by pacing around the classroom.",
    "quantifier": "The principal walked around the classroom several times in a displeased manner.",
    "resemantic": "Looking annoyed, the principal moved about the classroom continuously.",
    "insert": "The clearly displeased principal restlessly kept walking back and forth across the classroom.",
    "delete": "The principal kept walking around."
  },
  {
    "original_id": 2078,
    "original_sentence": "Is responsible for emulating realistic laws of physics within the application.",
    "lexical": "Handles the simulation of authentic physical laws in the application.",
    "shuffle": "Within the application, realistic laws of physics are emulated by this component.",
    "restructure": "The application includes a system responsible for simulating realistic physics.",
    "negation": "It does not ignore the laws of physics but emulates them realistically within the application.",
    "quantifier": "The module is responsible for emulating many realistic laws of physics in the application.",
    "resemantic": "Simulates the behavior of natural physical forces inside the software.",
    "insert": "This module is specifically responsible for accurately emulating realistic physical laws within the scope of the application.",
    "delete": "Responsible for physics emulation in the app."
  },
  {
    "original_id": 624,
    "original_sentence": "Up-and-over or overhead doors are often used in garages.",
    "lexical": "Retractable or overhead doors are commonly utilized in garages.",
    "shuffle": "Garage doors are often of the up-and-over or overhead type.",
    "restructure": "Garages frequently feature doors that open by swinging up and over.",
    "negation": "Garages don't typically use doors other than up-and-over or overhead types.",
    "quantifier": "Most garages use some form of up-and-over or overhead door.",
    "resemantic": "Overhead-style doors are frequently installed in garage settings.",
    "insert": "Up-and-over or overhead doors, which are designed to maximize space, are frequently used in residential garages.",
    "delete": "Overhead doors are often used in garages."
  },
  {
    "original_id": 2028,
    "original_sentence": "Different filters are used to select the wavelength of light which the solution absorbs the most.",
    "lexical": "Various filters are employed to isolate the wavelength of light that the solution most strongly absorbs.",
    "shuffle": "To select the light wavelength the solution absorbs most, different filters are used.",
    "restructure": "Filters are used to determine which light wavelength is most absorbed by the solution.",
    "negation": "The filters are not used randomly; they are chosen based on the wavelength the solution absorbs most.",
    "quantifier": "Several types of filters can be used to identify the wavelength best absorbed by the solution.",
    "resemantic": "Special filters help determine which light the solution absorbs best.",
    "insert": "Different optical filters are strategically used to select the precise wavelength of light that the solution absorbs most effectively.",
    "delete": "Filters are used to find the wavelength most absorbed."
  },
  {
    "original_id": 1651,
    "original_sentence": "In 1907, residents of the town decided to incorporate.",
    "lexical": "In 1907, inhabitants of the town resolved to form a municipality.",
    "shuffle": "Residents of the town decided to incorporate in 1907.",
    "restructure": "The town was incorporated after its residents made the decision in 1907.",
    "negation": "In 1907, the town's residents did not choose to remain unincorporated.",
    "quantifier": "Most residents of the town decided to incorporate in 1907.",
    "resemantic": "In 1907, the town’s people opted to become an official municipality.",
    "insert": "In 1907, after much discussion, residents of the town decided to incorporate as a formal local government.",
    "delete": "In 1907, the town decided to incorporate."
  },
  {
    "original_id": 1349,
    "original_sentence": "He died of pneumonia and heart failure on 7 January 2018, aged 61.",
    "lexical": "He passed away from pneumonia and cardiac failure on 7 January 2018, aged 61.",
    "shuffle": "On 7 January 2018, he died of pneumonia and heart failure, aged 61.",
    "restructure": "Pneumonia and heart failure caused his death on 7 January 2018 at the age of 61.",
    "negation": "He did not survive pneumonia and heart failure, dying on 7 January 2018 at age 61.",
    "quantifier": "He died from multiple health conditions, including pneumonia and heart failure, on 7 January 2018.",
    "resemantic": "He succumbed to complications from pneumonia and heart problems at the age of 61 on 7 January 2018.",
    "insert": "He died of severe pneumonia and congestive heart failure on 7 January 2018, when he was 61 years old.",
    "delete": "He died on 7 January 2018, aged 61."
  },
  {
    "original_id": 1683,
    "original_sentence": "Numbers seven and eight on the list are of a different kind from the first six, and have generally not been considered by the other authors.",
    "lexical": "Items seven and eight on the list differ from the initial six, and are typically overlooked by other scholars.",
    "shuffle": "On the list, numbers seven and eight are of a different kind from the first six and usually not considered by other authors.",
    "restructure": "Unlike the first six, items seven and eight on the list are different and usually ignored by other writers.",
    "negation": "The other authors have not typically included numbers seven and eight, as they differ from the first six.",
    "quantifier": "Several authors have generally not considered numbers seven and eight, which are of a different kind than the first six.",
    "resemantic": "The final two entries differ in nature from the earlier ones and are seldom addressed by other writers.",
    "insert": "Numbers seven and eight on the list, which are notably distinct from the first six, have generally not been taken into account by other authors.",
    "delete": "Seven and eight on the list are different and rarely considered."
  },
  {
    "original_id": 2511,
    "original_sentence": "Intellectual property laws have the effect of converting some goods to scarce goods by law.",
    "lexical": "Intellectual property regulations result in legally transforming certain goods into limited-access goods.",
    "shuffle": "By law, intellectual property laws turn some goods into scarce ones.",
    "restructure": "Some goods become scarce due to the enforcement of intellectual property laws.",
    "negation": "Without such laws, some goods would not be made artificially scarce.",
    "quantifier": "Many goods are made legally scarce due to intellectual property laws.",
    "resemantic": "These laws legally restrict access to certain products, making them artificially scarce.",
    "insert": "Intellectual property laws effectively transform some otherwise accessible goods into scarce goods through legal frameworks.",
    "delete": "IP laws convert some goods to scarce ones."
  },
  {
    "original_id": 749,
    "original_sentence": "The protected area is part of the Terai-Duar savanna and grasslands ecoregion.",
    "lexical": "The conserved region belongs to the Terai-Duar savanna and grasslands biome.",
    "shuffle": "Part of the Terai-Duar savanna and grasslands ecoregion is the protected area.",
    "restructure": "This area, which is protected, lies within the Terai-Duar savanna and grasslands ecoregion.",
    "negation": "The protected area is not outside the Terai-Duar savanna and grasslands ecoregion.",
    "quantifier": "Much of the protected area falls within the Terai-Duar savanna and grasslands ecoregion.",
    "resemantic": "This conservation zone is located within the Terai-Duar ecological grassland system.",
    "insert": "The protected area, which is known for its biodiversity, forms part of the Terai-Duar savanna and grasslands ecoregion.",
    "delete": "The area is part of the Terai-Duar ecoregion."
  },
  {
    "original_id": 1635,
    "original_sentence": "Batting tactics and strategy depends on the type of match being played.",
    "lexical": "Batting techniques and strategy vary depending on the nature of the match.",
    "shuffle": "The type of match being played determines batting strategy and tactics.",
    "restructure": "The approach to batting changes based on the match format.",
    "negation": "Batting tactics do not remain constant across different types of matches.",
    "quantifier": "In many cases, batting strategy depends on the type of match.",
    "resemantic": "How players bat is influenced by the format of the game.",
    "insert": "Batting tactics and overall strategy largely depend on the specific type and rules of the match being played.",
    "delete": "Batting depends on the match type."
  },
  {
    "original_id": 2708,
    "original_sentence": "Unique among the United States, Alaska is not entirely subdivided into organized county equivalents.",
    "lexical": "Alaska stands alone among U.S. states by not being fully divided into structured county counterparts.",
    "shuffle": "Among the United States, Alaska is unique in not being entirely divided into organized county equivalents.",
    "restructure": "Unlike other U.S. states, Alaska does not have full subdivision into organized counties.",
    "negation": "Alaska does not follow the standard U.S. model of county subdivisions.",
    "quantifier": "Few U.S. states, if any, besides Alaska, lack complete division into county equivalents.",
    "resemantic": "Alaska differs from other states in that it lacks comprehensive county-level divisions.",
    "insert": "Unique among all U.S. states, Alaska is the only one not entirely subdivided into structured administrative counties.",
    "delete": "Alaska is not fully divided into counties."
  },
  {
    "original_id": 1288,
    "original_sentence": "Strategic bombing was an idea first tried in World War I.",
    "lexical": "The concept of strategic aerial bombing was initially implemented during World War I.",
    "shuffle": "In World War I, the idea of strategic bombing was first tried.",
    "restructure": "World War I marked the first use of strategic bombing as a military tactic.",
    "negation": "Strategic bombing was not a concept that emerged after World War I.",
    "quantifier": "Some aspects of strategic bombing were first explored during World War I.",
    "resemantic": "The tactic of targeting infrastructure from the air began in World War I.",
    "insert": "Strategic bombing, a significant military concept, was first experimented with during World War I.",
    "delete": "Strategic bombing started in World War I."
  },
  {
    "original_id": 2237,
    "original_sentence": "There are various modifications that can be implemented atop the fundamentals of the battle royale.",
    "lexical": "Numerous alterations can be layered onto the core mechanics of the battle royale.",
    "shuffle": "Modifications of various kinds can be added atop the fundamentals of the battle royale.",
    "restructure": "The core battle royale format allows for many possible modifications.",
    "negation": "The fundamentals of battle royale are not the only possible structure; modifications can be applied.",
    "quantifier": "Several possible modifications can be implemented on top of battle royale basics.",
    "resemantic": "Different tweaks can be made to enhance the standard battle royale gameplay.",
    "insert": "There are various potential modifications and enhancements that can be implemented atop the foundational mechanics of battle royale games.",
    "delete": "Various modifications can be implemented."
  },
  {
    "original_id": 1070,
    "original_sentence": "The group sings the theme music for the following anime.",
    "lexical": "The ensemble performs the opening theme for the listed anime series.",
    "shuffle": "For the following anime, the group sings the theme music.",
    "restructure": "The theme music for the following anime is performed by the group.",
    "negation": "The theme music for the following anime is not sung by someone else but by the group.",
    "quantifier": "The group sings the theme music for several of the following anime titles.",
    "resemantic": "The group is responsible for performing the intro songs to these anime shows.",
    "insert": "The musical group notably performs the theme music for the following popular anime series.",
    "delete": "The group sings the theme for anime."
  },
  {
    "original_id": 2305,
    "original_sentence": "Several times people in Australia have wanted to remove the monarchy.",
    "lexical": "On numerous occasions, citizens in Australia have sought to abolish the monarchy.",
    "shuffle": "People in Australia have wanted to remove the monarchy several times.",
    "restructure": "The monarchy has faced removal attempts by Australians on several occasions.",
    "negation": "People in Australia have not always supported keeping the monarchy.",
    "quantifier": "Many people in Australia have, at various times, wanted to remove the monarchy.",
    "resemantic": "Australians have expressed interest in ending the monarchy on more than one occasion.",
    "insert": "Several times throughout recent history, people in Australia have actively wanted to remove the monarchy.",
    "delete": "People in Australia have wanted to remove the monarchy."
  },
  {
    "original_id": 839,
    "original_sentence": "There were several inter-promotional matches after Unforgiven.",
    "lexical": "Numerous cross-promotional matches occurred following Unforgiven.",
    "shuffle": "After Unforgiven, there were several inter-promotional matches.",
    "restructure": "Following Unforgiven, multiple matches took place between different promotions.",
    "negation": "There weren’t only single-promotion matches after Unforgiven.",
    "quantifier": "Several inter-promotional matches were held after Unforgiven.",
    "resemantic": "Various crossover bouts were staged following the Unforgiven event.",
    "insert": "There were several high-profile inter-promotional matches that took place after Unforgiven.",
    "delete": "There were inter-promotional matches after Unforgiven."
  },
  {
    "original_id": 872,
    "original_sentence": "Assuming a comfortable position helps the baby to latch properly.",
    "lexical": "Adopting a relaxed posture assists the baby in latching effectively.",
    "shuffle": "To latch properly, the baby benefits from assuming a comfortable position.",
    "restructure": "A baby is more likely to latch properly when a comfortable position is assumed.",
    "negation": "Not assuming a comfortable position can make it harder for the baby to latch properly.",
    "quantifier": "In many cases, assuming a comfortable position helps the baby latch properly.",
    "resemantic": "Getting into a cozy position makes it easier for the baby to feed well.",
    "insert": "Assuming a calm and comfortable position significantly helps the baby to latch properly during breastfeeding.",
    "delete": "Assuming a comfortable position helps the baby latch."
  },
  {
    "original_id": 568,
    "original_sentence": "Over 250 different species of looli marine life are found in the 300000 acre of lagoon and surrounding waters.",
    "lexical": "More than 250 distinct species of looli aquatic fauna inhabit the 300,000-acre lagoon and adjacent waters.",
    "shuffle": "In the 300000-acre lagoon and its surrounding waters, over 250 species of looli marine life are found.",
    "restructure": "The 300000-acre lagoon and its surrounding waters are home to over 250 looli marine species.",
    "negation": "It is not uncommon to find over 250 species of looli marine life in the lagoon and surrounding waters.",
    "quantifier": "A vast number of looli marine life species—over 250—exist in the lagoon and nearby waters.",
    "resemantic": "The lagoon and its neighboring waters host a rich diversity of over 250 types of looli marine organisms.",
    "insert": "Over 250 different species of looli marine life are typically found in the vast 300000-acre lagoon and its surrounding waters.",
    "delete": "Over 250 species of looli marine life are found in the lagoon and surrounding waters."
  },
  {
    "original_id": 2788,
    "original_sentence": "As well as industrial uses, maritime pine is also a popular ornamental tree, planted in parks and gardens in areas with warm temperate climates.",
    "lexical": "In addition to its industrial applications, the maritime pine serves as a favored decorative tree, cultivated in parks and gardens across warm temperate zones.",
    "shuffle": "Maritime pine, in addition to industrial uses, is also planted as an ornamental tree in warm temperate parks and gardens.",
    "restructure": "Besides being used industrially, the maritime pine is widely grown as an ornamental tree in warm temperate areas.",
    "negation": "Maritime pine is not used solely for industrial purposes; it is also favored in landscaping.",
    "quantifier": "Many parks and gardens in warm temperate regions include maritime pine as an ornamental tree.",
    "resemantic": "Apart from its practical functions, the maritime pine is often chosen for aesthetic landscaping in mild climates.",
    "insert": "As well as its various industrial uses, the maritime pine is also commonly used as a popular ornamental tree, especially in warm temperate regions for landscaping purposes.",
    "delete": "Maritime pine is also used as an ornamental tree in warm temperate climates."
  },
  {
    "original_id": 2636,
    "original_sentence": "Rat snakes are commonly kept as pets by reptile enthusiasts.",
    "lexical": "Rat snakes are frequently maintained as companion reptiles by herpetology hobbyists.",
    "shuffle": "By reptile enthusiasts, rat snakes are commonly kept as pets.",
    "restructure": "Reptile enthusiasts often keep rat snakes as household pets.",
    "negation": "Rat snakes are not uncommon as pets among reptile lovers.",
    "quantifier": "Many reptile enthusiasts keep rat snakes as pets.",
    "resemantic": "Rat snakes are popular pets among those interested in reptiles.",
    "insert": "Rat snakes are commonly and enthusiastically kept as pets by dedicated reptile enthusiasts around the world.",
    "delete": "Rat snakes are kept as pets by reptile enthusiasts."
  },
  {
    "original_id": 1715,
    "original_sentence": "The river is known for its water mills; during the 1950s, they numbered approximately 18.",
    "lexical": "The river is recognized for its historic water mills; in the 1950s, there were around 18 of them.",
    "shuffle": "Known for its water mills, the river had approximately 18 in the 1950s.",
    "restructure": "In the 1950s, the river was home to about 18 water mills, for which it is well known.",
    "negation": "The river wasn't without notable features; it had around 18 water mills in the 1950s.",
    "quantifier": "Roughly 18 water mills were present on the river during the 1950s.",
    "resemantic": "This river gained recognition due to the water mills it featured—about 18 in the 1950s.",
    "insert": "The river, especially well known for its traditional water mills, had approximately 18 operating during the 1950s.",
    "delete": "The river is known for its water mills; in the 1950s, there were about 18."
  },
  {
    "original_id": 2763,
    "original_sentence": "C-type asteroids are extremely dark, with albedos typically in the 0.03 to 0.10 range.",
    "lexical": "C-type asteroids are exceptionally dim, possessing albedos generally between 0.03 and 0.10.",
    "shuffle": "With albedos typically between 0.03 and 0.10, C-type asteroids are extremely dark.",
    "restructure": "These asteroids, classified as C-type, are known for their extreme darkness, having albedos usually ranging from 0.03 to 0.10.",
    "negation": "C-type asteroids do not reflect much light, given their very low albedos.",
    "quantifier": "Most C-type asteroids have albedos in the 0.03 to 0.10 range, making them extremely dark.",
    "resemantic": "C-type asteroids reflect minimal light, as shown by their albedos in the low 0.03–0.10 spectrum.",
    "insert": "C-type asteroids, which are carbonaceous and extremely dark, typically have albedos in the narrow range of 0.03 to 0.10.",
    "delete": "C-type asteroids are dark, with albedos from 0.03 to 0.10."
  },
  {
    "original_id": 1742,
    "original_sentence": "Basic general information about the clients: creator/company, license, etc.",
    "lexical": "Fundamental general data concerning the clients: developer/organization, licensing, and so on.",
    "shuffle": "Information about the clients—such as creator, license, or company—is basic and general.",
    "restructure": "General client details such as company, creator, and licensing fall under basic information.",
    "negation": "The information is not detailed—only general facts about the clients like company and license.",
    "quantifier": "Some basic general information is provided about the clients: such as creator, license, etc.",
    "resemantic": "Introductory client details like developer name, licensing terms, and affiliated company are included.",
    "insert": "Basic general information about the clients, including identifiers such as creator, company affiliation, license details, and more.",
    "delete": "Basic client info: creator, company, license."
  },
  {
    "original_id": 2484,
    "original_sentence": "Hyperoliids range from 1.5 to in body length.",
    "lexical": "Hyperoliids span from approximately 1.5 to in terms of body length.",
    "shuffle": "In body length, hyperoliids range from 1.5 to.",
    "restructure": "The body size of hyperoliids varies, starting from 1.5 and extending further.",
    "negation": "Hyperoliids do not all have the same body length; they range from 1.5 upward.",
    "quantifier": "Many hyperoliids range from about 1.5 in length and beyond.",
    "resemantic": "The size of hyperoliids generally begins at 1.5, with some growing larger.",
    "insert": "Hyperoliids, a diverse group of frogs, range from 1.5 to unspecified lengths in terms of body measurement.",
    "delete": "Hyperoliids range in body length."
  }
]